{
  "sources": [
    {
      "title": "知乎日报",
      "feedUrl": "http://feeds.feedburner.com/zhihu-daily",
      "siteUrl": "https://news-at.zhihu.com/api/4/stories/latest?client=0",
      "articles": [
        {
          "id": "https://daily.zhihu.com/story/9737651",
          "author": null,
          "description": "墨子连山，干货在这不受待见，我把他们放在同名公众号了……\n阅读原文\n\n当年去 ASML 面试，对，就是荷兰生产光刻机的，现在还卡着我们脖子那个，总部在埃因霍温。\n当时的课题是解决激光头移动最优路径的问题，这是个背包问题，特点是复杂度随着路径的增加呈几何级数增加……说叉了，装 13 装习惯了，抱歉。总之就是各种测试之后，最后的面谈中，那个项目负责人结束前问了我一个问题：如果你手上的工作遇到困难，进展不下去了，你怎么办？\n我看他那个样子，显然就是例行公事，赶紧随便问完最后一个问题，恨不得我嘴皮子一停，他就马上起来握手了。因为之前已经经历了一周的测试，我的表现还是比较突出的，因为毕设项目就是演化算法相关，我的导师还是这个领域最权威杂志的主编，所以……抱歉，又说叉了，我今后要改掉这个恶习。\n总之我那时有点飘了，于是就打算给他来点有意思的。我说：我永远不会让自己手里只有一项工作，所以，如果一项工作遇到困难进展不下去，我会开始另一项工作，直到这项工作出现转机。\n当时那大哥脸就变了，荷兰人这点很好，什么情绪都写在脸上，眼睛都放光。总之，他说这是他听到过的最让人印象深刻的回答，当然我也被顺利录取了。后来因为种种原因我选择了回国，走之前还跟大哥通了个电话，他还记着这事。\n当时我只是突发奇想，秀了一下，但是事后我还真的仔细回味了一下这个回答，才发现为什么他有那么大的魅力，甚至自己当时都没想这么深。\n你们应该猜出来我想说什么了吧？人在逆境的时候应该怎么调节自己？答案应该是，人就不应该陷入逆境，永远不应该把你的希望只寄托在一件事物上，大白话就是，鸡蛋永远不能放在一个篮子里。\n试想，一个人至少有父母、有爱人、有子女、有工作、有学业、有个人爱好、可能还有副业……这些不大可能在同一时间都陷入逆境吧？工作逆境了可以转移到家庭、与父母相处逆境了可以转移到子女、学业逆境了可以转移到爱好，等等等等。一般人，一辈子都不会遇到同时在所有方面都遇到逆境的情况。\n为什么这个答案让那位大哥印象深刻呢？因为人都有认知盲区，走到死胡同里就会认为那是唯一一条路，哪怕两边根本没有墙你的眼睛都看不到，因为你的认知里面有墙，你根本就不会去看。\n最后，再次明确一下我的回答，人在逆境中怎么办？答，不要一棵树上吊死，抬头看看，树有的是，我们生活在森林里。\n \n补充 0:我当年是做建模的，光刻机的核心是工艺，材料工艺、运输工艺、装配工艺、生产工艺等等，什么叫工艺？就是一堆一堆的小细节，根本不是几个人的问题，人家就算告诉你标准，你都做不到。为什么 ASML 能做到？因为那就不是一个公司，那几乎是世界上所有最高工艺的集合体，他不属于荷兰，他只是生产线设在了荷兰而已。里面工作的有好多德国人、美国人、当然中国人也不少，但基本都是在做算法建模这些，听着高大上，但实际上都是边角余料，真正牛的是车间里那批技术人员，那里面好像一个中国人都没有，他们应该是不敢放我们的人。我参观的时候，他们介绍的核心部件是那个透镜，就是把激光束汇聚到芯片上做烧结用的。外观看起来就是个大圆桶，里面不让看，是德国卡尔蔡司生产的，据说只有他和日本一家能生产。这东西从德国运到荷兰，用的运输车也是特制的，我没见过车什么样，说是只有那个车能运，为什么？因为这玩意太精密，稍微晃一晃就完蛋，所以这个车有各种变态参数，但即便是特制的运输车，仍然不能轻易加速、不能轻易刹车、转弯都得慢慢来，如果我国自己搞，别说车，连司机都得从头培养，这就是工艺。所以，不是我不想，但研究光刻机这事确实我连边都沾不上。大家就别围观这事了，洗洗睡吧。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737651",
          "publishedOn": "2021-07-04T23:08:17.000Z",
          "wordCount": null,
          "title": "人在逆境的时候该怎么调整自己状态？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737779",
          "author": null,
          "description": "Three诗睿，法律人，摄影痴，书籍癖。\n阅读原文\n\n关于司法实践难题”著作权合理使用“的：张海峡与于建嵘侵害著作权纠纷相关判决书。\n我们知道，著作权中的合理使用制度一直是司法实践中的难题，法律规定滞后于科技的发展，如何界定和调节权利的边界，在作品的创作者、传播者和社会公众之间落实利益平衡是理论界和实务界不断讨论的话题，本文仅以张海峡与于建嵘著作权纠纷相关判决书来聊一下著作权合理使用，虽则为一家之言，然而判决书再一次证明了一件事宜：科技倒逼法律前行。\n\n北京市第二中级人民法院（2012）二中民初字第 611 号民事判决\n北京市高级人民法院（2012）高民终字第 3452 号民事判决\n\n该案原告张海峡，当年是国内司考辅导专家。被告于建嵘则是社科院学者，微博大 V。2011 年 8 月 23 日，微博用户“巴黎观察”上传了张海峡关于评价留法女大学生言论的教学视频（视频名为：2011 张海峡·商经），在该视频中张海峡声称“凡是中国大陆的女孩子到法国留学的，回来之后都烂得一塌糊涂，都是超级潘金莲”。该微博经过于建嵘转发并评论后被众多的网友追捧。\n后张海峡向北京二中院起诉，称上述于建嵘在微博转载其讲课内容视频的行为侵犯了张海峡对涉案作品享有的发表权和信息网络传播权，要求于建嵘赔礼道歉并赔偿损失。\n该案历经一审判定于建嵘转发视频的行为构成合理使用，驳回张海峡全部诉讼请求，到北京高院驳回上诉，维持原判。笔者截取（2012）二中民初字第 611 号和（2012）高民终字第 3452 号民事判决之部分，个人认为北京二中院和高院对合理使用部分的说理颇为惊艳：\n\n北京二中院（2012）二中民初字第 611 号民事判决部分：\n本案中，涉案口述作品已经发表，于建嵘的涉案转发行为的目的在于评论“巴黎观察”及张海峡的观点，属于以其言论表达其观点的行为，但表达个人观点不得侵害他人的合法权利；同时，法律允许…",
          "link": "https://daily.zhihu.com/story/9737779",
          "publishedOn": "2021-07-04T23:08:13.000Z",
          "wordCount": null,
          "title": "你们在判决书上用过或看过哪些神来之笔？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737687",
          "author": null,
          "description": "ChubbyPillow，肥宅快乐枕\n阅读原文\n\n这是一个好复杂好复杂的问题……而且涉及到很多没有办法量化出来的玄学……\n这样吧，我能想到的方式就只有一种，就是搬出我的主观客观香水评价坐标图：\n\n我在这里面总共画了九个圈，每个圈都有对应的一部分香水\n我一直坚信在闻香经验足够丰富的香友眼里，对于香水的评价可以分为主观和客观两种\n主观其实讲起来很简单，就是好不好闻的问题，好闻就正值难闻就负值\n客观就是艺术价值和层次感怎么样，价值高就正值，毫无价值或者层次感极差就负值\n对于香水的“客观评价”就涉及到一个标准的问题了，但是很遗憾我没有一个完全客观的定义\n反正我个人的定义里面基本就只牵扯到这几个，原创性、层次感和原料……\n那么我一个圈一个圈来解释吧。\n①是我觉得巨难闻但是竟然还挺独特的玩意儿，常见于 Zoologist 或者 BeauFort 这种掉 san 品牌，尤其是诸如 Panda 或者 1805 Tonnerre 这种要么绿得抽筋要么黑得发晕的诡异产品\n②是一大堆传奇老香，由于老香经常有奇奇怪怪的康乃馨 note，香辛调，还有我不太喜欢的异丁基喹啉，所以有一部分是在坐标系左边的，但是总的来说艺术价值基本都还挺高\n③是最最最常见的各种现代主流商业香（包括男女），各种千篇一律的广藿花果香，千篇一律的现代馥奇，但是你也不能说人家完全没有艺术价值，毕竟配方还是要略微修改的\n④是某些良心的商业香以及还算不错的入门 niche 所在的区域，典型如 Guerlain 和 Hermes/Chanel 等等，不论是用料上还是调香水平都还算不错。入门 niche 大概就是 SL 和 AG 这种。\n⑤是恰好戳中我口味的某些普通的 designer 和 niche，由于我本人特别喜欢柑橘和清新花香，所以基本上类似于 Acqua di Parma 或者 Diptyque 的小清新我都闻着很开心\n⑥是整个坐标系中的佼佼者，用料和调香都是史诗级别，我能想到的唯一几个牌子就是旧版的 Frederic Malle 以及 Serge Lutens 吊钟，其他的就零散分布在各种 designer 纯香精和 niche 里\n⑦是大部分极其廉价的名人香以及不知来路的香水，基本处于不仅抄袭还抄得很垃圾那种\n⑧是由于用料实在太差了或者太诡异了足以引起人不适的香水，但至少还稍稍努了点力去抄\n⑨是彻彻底底弃疗的香水，随便扔进去几个闻着还行的合成原料完事儿，抄都懒得抄\n（肯定有人会问第四象限的点是什么？那是所谓的 clone，没有艺术价值但好闻）\n\n然后再次正面回答题主的问题，决定了香水价值的最主要因素是什么？\n这个价值究竟是哪方面的价值？艺术价值还是金钱上的价值？后者的话那就是成本了，香水成本一般确实挺低的，但是也要看一个品牌够不够良心，AG 和 SL 最初定价都不贵，但还是天然玫瑰天然晚香玉唰唰往里加，所以即使平均下来成本不高，这个用料分还是得打高一点。\n艺术价值这个玩意儿就见仁见智了，但是这么多年过来大部分香水爱好者会有一套趋同的评分体系，大家都不太能说明白是什么，但是一个香水差大家就都同意它差。典型的就如 Gabrielle，F 网有成堆的 dislike 不是没理由的，平时多体面的一个牌子（选料也认真）搞出来这种糊成一团的玩意儿，就前调能看，中后调乱七八糟，这不失望才怪了。还有那个 Dip 的 Essences Insensees Tiare，这连清新都算不上清新的破玩意儿……\n香精怎么评价好坏？不好意思这事儿你可能要找 @吃菜事魔者 ，我对这玩意儿一无所知，能闻出来天然跟合成的区别就了不得了，还得评价天然的究竟哪种最好……那得买好多精油净油，还得是不同产区不同网站的才区别得出吧。这事儿除了 @吃菜事魔者 以及我不认识的一些博主，好像也就只有 Steffen Arctander 能帮你了哈哈哈哈哈哈【苦笑\n总之我能够解释的差不多就只有这些了，本篇回答仅代表我个人看法不代表客观规律。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737687",
          "publishedOn": "2021-07-04T23:08:05.000Z",
          "wordCount": null,
          "title": "评价香水好坏的标准是什么？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737740",
          "author": null,
          "description": "扎维耶小丑，喜欢历史的摄影爱好者\n阅读原文\n\n教父系列之所以称之为经典，有一部分原因就是导演科波拉对细节的构思和表现做到了极致，让观众每次重看都会有新的发现。原片限于时长，没法交代出所有的分支剧情，但很多答案就隐藏在分镜头中，观众可以细心观察，自己就能推理出来。\n比如下面几个初次观看会迷惑不解的问题。\n细节 1：迈克尔为何要牺牲大将罗可去刺杀一个活不了几天的海门罗斯？(《教父 2》)\n先科普一下罗可：\n罗可兰坡是迈克尔时代的两位家族角头之一。第一部里他为克莱门扎刺杀了出卖老教父的保利，因此得到了迈克尔的信任。在影片最后的大清洗中，罗可带着士兵成功刺杀了塔塔利亚，晋升为柯里昂家族的角头。\n如果只看影片，观众可能会觉得罗可的晋升之路看起来太轻松了。普佐在小说中则对此进行了详细的解释。\n早在成功刺杀保利之后，迈克尔就将罗可收为己用，命令他私下招募没有案底的士兵，作为自己的直属军团备用，泰西欧和克莱门扎都不知道这支秘密军队的存在。后来正是这支军队扑灭了五大家族的反击，为迈克尔彻底拿下了纽约战争的胜利。\n到了教父二，罗可不但担任了角头，而且还成为了迈克尔的安全主管，职责类似于以前的克莱门扎。但正是这个职责最终让他丢掉了性命。\n黑手党讲究的是高风险高回报。位子坐得越高，责任就越重，出了岔子就要负责到底。教父 2 里柯里昂家族一共出了三个背锅侠，他们每个都为自己的错误付出了代价。\n第一个是二哥弗雷多，这个最明显的了。当了叛徒就 GG 吧，亲哥也没用。\n第二个是汤姆哈根。他的错误是主事期间让凯溜出了庄园，导致迈克尔的孩子被流产。这个事对意大利人来说很严重，因此迈克尔当面羞辱了汤姆，并威胁将他踢出决策层。\n最后一个就是罗可了。罗可身为安全主管，却让迈克尔险些遭到刺杀，这是重大失职。第一部里老教父遭到刺杀，结果克莱门扎从头到尾被自己人怀疑，哪怕桑尼通过调查确认了克莱门扎没有嫌疑，但他依然被汤姆…",
          "link": "https://daily.zhihu.com/story/9737740",
          "publishedOn": "2021-07-04T23:08:00.000Z",
          "wordCount": null,
          "title": "电影《教父》中有哪些易被忽略却令人深思的小细节？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737788",
          "author": null,
          "description": "Tuttiii，HKU艺术史系，NYU艺术管理。电子+桌面游戏爱好者。\n阅读原文\n\n设定很酷的桌游不胜枚举，这里详细介绍两款个人非常喜欢、玩家也好评不断的桌游，再简单推荐一些我玩过的很有创意的游戏，希望能有价值。\n《深海谍影 Captain Sonar》,2-8 人\n一款很像小时候玩的海战棋的游戏，配件华丽丽升级，加入了多种元素、角色。规则不算复杂，玩起来趣味十足，既有个人策略又充满了互动和沟通。\n玩法简介：玩家根据游戏人数分为两队，每个队控制一艘潜水艇，每个队伍有四个角色分别负责不同的任务——船长、大副、工程师、监听员。两艘潜水艇的初始位置是不告诉对方的，在游戏过程中，玩家们需要通过监听员听到的情报，判断出对方潜水艇的位置，再通过大副准备的武器来攻击对方。船长负责己方潜艇的行进路线，工程师负责修复船体的损伤。\n游戏分为回合制和即时制两种模式，新手推荐先玩回合制熟悉游戏流程和技能，玩熟后再尝试即时制，更加紧张刺激。\n吸引人的特点：\nl 两块超长的挡板：用来遮挡两方玩家视线以防作弊，上面有精致的插画，横置在桌上很吸睛\nl 慷慨激昂的游戏过程：玩家在游戏过程中会扮演各种角色，说出各种口令，非常有代入感\nl 紧张刺激的游戏体验：玩家需要不断猜测对方的位置，又要时刻担心自己是否暴露，当己方的鱼雷炸到对方潜艇时的快感简直棒极了\nl 有趣的侦测系统：双方潜艇都有两个特别的侦测系统，十分考验玩家的推理能力，还有一点点尔虞我诈的成分\n\n《时间守望 TIME Stories》，2-4 人\n一款集优秀的美工、机制、剧情为一体的解谜探险游戏，极简、未来风格的封面和版图非常符合它的游戏背景：未来世界的时间穿越特工，乘坐时间穿梭机回到过去完成组织的任务。\n游戏模式是合作类，每个扩都是一个新剧本，有不同的主题（甚至画风都会跟着主题变化），玩家要通过探索剧情、步步解谜，做出各种各样的选择，与 NPC 和…",
          "link": "https://daily.zhihu.com/story/9737788",
          "publishedOn": "2021-07-04T23:07:55.000Z",
          "wordCount": null,
          "title": "有哪些设定上非常吸引人的桌游推荐？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737789",
          "author": null,
          "description": "每次开车直接从 P 挡到 D 挡给油就走，这样会伤车吗？\n\n知乎用户，有意愿，有能力享受生活。\n阅读原文\n\n那不然你还打算档杆上下上下左右左右再再油门油门刹车刹车这么搓一遍解锁个马力加二百匹的隐藏性能再走？\n阅读原文\n\n你有哪些匿名才敢发出来的照片？\n\n葵神，又黑又瘦成熟且贫穷的男人\n阅读原文\n\n\n00后的舍友\n\n匿名用户\n阅读原文\n\n匿名用户：\n这是一个女生……\n\n\n\n阅读原文\n\n你是通过什么事情才知道自己丑的？\n\n千峰月，作家、登山客、金融业者、恋旧的凡人\n阅读原文\n\n见到朋友介绍的“跟你很般配的”相亲对象。\n阅读原文\n\n有什么类似「尼古拉斯·赵四」的名字？\n\nTuring，教书匠/播音主持/前乌云白帽/各种烧钱爱好\n阅读原文\n\n端木 桶\n阅读原文\n\n怎么给小孩起小名？\n\n格林喂养着野兽\n阅读原文\n\n我一朋友，大名贼好听，他还有一妹妹。\n他叫苏寞，他妹叫苏茉。\n我问他 他妈在家里叫 su mo 叫的谁\n他大手一挥，不是有小名嘛。\n所以。。。。他小名 狗哥\n他妹小名 茉茉\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737789",
          "publishedOn": "2021-07-04T23:07:51.000Z",
          "wordCount": null,
          "title": "瞎扯 · 如何正确地吐槽",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737723",
          "author": null,
          "description": "segelas，电影学硕士已毕业，但仍旧略懂皮毛\n阅读原文\n\n谢在类似问题下的邀请 @魅影缝匠 。谈一谈个人的看法。\n于个人对电影的理解而言，直观触发观者感情反应的高潮瞬间与多元丰富的主题表达系统的结合，且能让这种感情反应融入整体系统、甚至引导观者把握整体表意系统，便构成了电影艺术基于“感官作用”之情绪层面、“立意表达”之逻辑层面的双重性。对电影艺术独特——区别于绘画等独立画面，以及文学等文本倾向——之美的审视，电影的审美，莫过于此。\n艺术的重要价值，在于对人更直接的震撼效果，它直接作用于人的内心，而伟大的艺术，则可以让这种效果亘久而永恒。而电影艺术，作为视觉、听觉共同作用的形式，对观者的感观作用更为丰富，也自然就具备了直接对接观者感受性的能力。因此，电影作为视听艺术之美的重中之重，一定在于“对观者情绪的直接效果”。\n并且，它与电影的好懂或晦涩无关。当然，这并不是否认电影表达手法与主题系统的重要性，它同样是决定电影质量不可或缺的一环。但是，如果仅有这一点，电影的观赏门槛未免会有点过高，一般观众对于艺术之美的感受未免过于艰难。因此，在节寸点上“直击心灵”的灵感时刻，让观众产生直观触动的高潮瞬间，对于一部优秀的电影而言，非常重要。\n并且，作为同样是优秀作品一部分标准，高潮瞬间的局部，理应是与整体表达高度贴合统一的。它理应构成作品主题表达系统的画龙点睛之处，让调动起的情绪成为对主题的最强力映射，甚至在很大程度上起到引领、推动观众更好地进入系统、理解表意、降低观影门槛的作用——毕竟，比起那些前后对应、明叙暗喻、符号象征，直接从感情上的信息接收，终究是要容易多了。\n这一切，或许就像某位电影人在观看《2001 太空漫游》后、以及网上风靡的李安表情包所共同感概的那样——“我不知道我在看什么，但我知道我看了一些了不得的东西”、“我看不懂，但我大受震撼”。\n事实上，前者的感慨，恰恰就构成了第…",
          "link": "https://daily.zhihu.com/story/9737723",
          "publishedOn": "2021-07-03T23:06:32.000Z",
          "wordCount": null,
          "title": "哪些好看的电影可以帮助提高审美？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737696",
          "author": null,
          "description": "刘洞宇，在做教育 / 想写一本奇妙的书\n阅读原文\n\n反对所有简单认为古美门的三观就是强者通吃，就是「胜者正义论」的回答。这样的理解显然不得要义。\n要把握《Legal High》真正的三观表达，我们应该意识到：\n古美门展露变态好胜心、不择手段维护其连胜纪录的人格，从头至尾都没有作为编剧的「第一呈现」。他贪婪好色，爱慕虚荣，嘴炮毒辣，对豪车游艇念念不忘，以及，最重要的，对不败金身有种狂热的偏执。但要注意：他的法律人格，或者说他作为法律人的基本信仰，是在情节中刻意和这些私德分离的。流氓痞子也好，拜金主义也罢，当这个人西装革履坐上原告或被告代理律师席的时候，我们才看到了藏在香车美女崇拜背后真正古美门式的三观。 \n\n诚然，持续的胜仗，对古美门有着极其重要的意义。抛开「谋求委托人利益最大化」这一职业属性和他本身越养越大的身价需要，这份重要性的形成，至少还有其他来源。\n比如家庭。从天才童星案我们得知，古美门父亲奉行家长独大的严苛教育，对儿子的异见进行过污蔑性的刁难。父子关系不和，以及随之而来同父辈权威的决裂，伴随了古美门的成长。后来的离经叛道，追求认可，偏执求胜，种种不过是这种挑战和自证的延续。\n\n比如职场。三流大学毕业，律考一次通过，青云直上很快来到了号称日本第一的三木律所。在这里，急待施展拳脚的古美门遇到了老道的三木，也遇到了女强人圭子，前者亲口教导他为了赢要不惜一切，后者更是同他并肩实践并捍卫了这一守则。于是在第一季决战中三木对古美门父亲说出了下面的话：\n「古美门研介这位法律家，是您赋予了他生命，由我培养出来的怪物。我们是共犯。」\n\n比如仓鼠纱织。小黛在健身房也向古美门挑明了这一点：\n我好像明白了，为什么您执着于胜诉，是因为纱织吧。（古美门愣住。）您为了胜诉，夺取了无辜孩子的性命。若是放弃对胜诉的执着，就等于是否定了自己做的事。您通过不断胜诉，在拼命摆脱自己的罪恶感。这过程，想必很…",
          "link": "https://daily.zhihu.com/story/9737696",
          "publishedOn": "2021-07-03T23:06:24.000Z",
          "wordCount": null,
          "title": "《Legal High》呈现的是怎样的三观？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737716",
          "author": null,
          "description": "叶佳桐，怪物总渴望着遇见同类 那么 你是我的同类么？\n阅读原文\n\n1985 年，吉卜力工作室成立。在《风之谷》获得成功后，整个日本的动画观众都在期待宫崎骏监督的下一部作品究竟会是什么。还会是和自然有关的主题么？这次会走的更深更远么？还会出现和娜乌西卡一样可爱的主角么？倍受期待的宫崎骏监督交出了一份出人意料的答卷——《天空之城》一部专门为孩子们制作的复古漫画般的电影。\n古老帝国拉比达是一座漂浮在空中的巨大的机器岛，传说那里已经无人居住，蕴藏着巨大的财富。因此，无论军方还是海盗，都在找寻着这座传说中的飞行岛。\n矿工帕克这天偶遇拉比达继承人希达，两人一见如故。因为希达身上有找寻拉比达帝国的重要物件飞行石，军方和海盗两帮人马都在追杀希达。帕克带着希达一起逃亡，最终都没有逃出军方的手中，希达被军队掳走了。\n为救朋友，帕克只能选择与海盗合作。帕克与海盗成功救出了希达，同时，他们也发现了军方的邪恶计划。为了阻止军方邪恶计划的实施，他们和海盗一起踏上了寻找拉比达之旅。\n在上映之时，《天空之城》并没有获得日本本土观众们的青睐。在 SF 动画风潮席卷日本的 80 年代中期，《天空之城》被看做是过时的作品。因此票房也并不理想，分账收入只有 5.83 亿。算得上吉卜力工作室出品的动画中数一数二的低票房。到了 80 年代末，随着宫崎骏监督个人地位的提升和复古未来主义风潮的影响，《天空之城》的口碑才得以扭转。不过根据发行商东宝那边的数据来看，上映之时《天空之城》的观众满意度高达 97.7% ，观影人群覆盖了各个年龄层。这在当时的动画市场还是比较少见的。作为吉卜力工作室成立后的第一部动画，《天空之城》开启了吉卜力老少咸宜合家欢的路线。\n1984 年，宫崎骏监督的《风之谷》获得了巨大的成功，关于现代工业文明破坏自然这一问题的讨论一时层出不穷。《风之谷》赚来的钱原本计划用在高畑勋监督预备筹拍的纪录片《柳川堀…",
          "link": "https://daily.zhihu.com/story/9737716",
          "publishedOn": "2021-07-03T23:06:15.000Z",
          "wordCount": null,
          "title": "如何评价宫崎骏的动画《天空之城》？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737763",
          "author": null,
          "description": "知乎用户，生如蝼蚁当立鸿鹄之志，命薄如纸应有不屈之心！\n阅读原文\n\n比大部分游戏逻辑性要强一些。\n因为这个游戏的规则就是你死我活、非输即赢的游戏。\n这个游戏除了几个基本的游戏规则是硬逻辑，100%成立，比如一局网杀 12 个人，有 4 个平民、四个狼，4 个神，每个神都有各自的技能，狼可以每晚刀一人。\n除此之外其他的都是概率逻辑，比如上警必有对跳，要是没狼出来对跳，怂狼局神职们除了守卫肯定是要摆名身份裸打的，加上预言家 3 轮验人，狼根本没有生存空间。所以上警出现对跳的概率是 95%以上。那么当首跳预言家后，一个比较硬的逻辑就是至少还会有一个对跳。但也有可能这局就是怂狼局，那我们能说一般上警开对跳是没有逻辑的吗？当然不能。\n再比如女巫首晚不被首刀，大概率会捞人。因为捞人的收益最大，毕竟狼自刀的概率比狼杀好人的概率低多了。所以女巫大概率会捞起一个好人，如果捞起个神职就更好了。但如果不捞人，狼再刀走一个神职基本这局狼的赢面就奠定了。但是偏偏有女巫不仅首夜不救人，还要盲毒一个走。那认定女巫会首夜捞人能不能作为一个逻辑，当然可以。\n毕竟除了游戏硬规则几个铁逻辑，没有其他逻辑是 100%成立的。但是团队还是要在这个规则下为了胜利而努力。而赢得游戏的基本方式，就是通过发言。\n而有些说法正反都成立，几乎是 55 开。比如大家都认定对跳发言好的预言家的概率高，实际一个人发言能力跟他摸的是预言家还是狼没有任何关系，一个发言能力差的预言家很可能被认定为狼首推出局。这个时候狼队可以根据发言来把焦点引到真的预言家发言差，没视角、爆点多上面来，从而煽动平民和其他神职把真的预言家抗推出局。\n这个时候一个优秀的选手就能在众多的逻辑中选择出最有利于自己团队胜利的一些来重点表述，带节奏。比如，如果是狼大概率是要抗推其他非狼的平民，这应该是个主逻辑，但是不是疯狂点狼坑的人（找抗推）就是狼呢？\n还是要区分考虑，这时候你就要参考场上形势来具体判断了，这个人到底是个尽职的强神、还是个想挡刀的平民，还是打坑位抗推的冲锋狼？\n狼人杀常用的逻辑未必都是 100%成立，但是根据情形选用哪些信息，哪些逻辑为己所用，则是一个十分考验人的事情。\n至于题主说的狼可以反其道而行之，就我狼人杀的经验而言，其实难度还是很大的。因为狼人在取胜目标和假穿身份时，需要有意的吃掉一些信息，然后找出有利于自己的逻辑来表述，这中间大部分人会出现停顿、拖时间、底气不足、拿一些概率非常小的逻辑在抗推人，即使在狼王区也是如此。\n你就想想，为什么极少有人能骗过测谎仪。\n所以，我觉得狼人杀是一项逻辑性比较强的游戏。这个逻辑性，不仅仅指游戏规律有 100%成立的，有大概率成立的，有 55 开的，有概率较小的，还包括通过发言判断目的、判断共边关系、判断身份、通过形式改变策略进而相互言语间不动声色的沟通的辨识能力、判断能力、沟通能力在内。\n但每个游戏者如何运用这些规则为己所用，尤其对于狼人而言，有时发言多达 10 轮，每轮都要吃信息，又要故意隐瞒信息，还不能言语前后矛盾，还要达成保护同伴抗推好人的目的，本身就是一个逻辑性很强的事情。\n狼人杀的游戏规则设定就是 55 开的游戏，压倒性获胜是小概率事件，大部分胜败都在一推或一刀之间。\n激励的游戏规则，每个不同参与者的不同表现，使得该游戏被越来越多的人喜欢。\n说狼人杀逻辑性不强的，可能还没有真正玩透这个游戏。\n反问一句，如果这个游戏不是靠逻辑判断来支撑，难道是靠胡言乱语取胜吗？\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737763",
          "publishedOn": "2021-07-03T23:06:09.000Z",
          "wordCount": null,
          "title": "狼人杀逻辑性真的很强吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737704",
          "author": null,
          "description": "许多的小兵器，石田龙弦、甚平、漩涡鸣人.jpg\n阅读原文\n\n《火影忍者》里确实有很多人物会让人联想起历史上著名的忍者，但是远远达不到“历史原型”的程度。\n因为大多数情况下，岸本只是借用了一个名字（甚至是不是有意借用的都不一定）。至于性格特征、招式技能、人生经历等等基本上和历史上的忍者都相差甚远。\n关于忍者\n先得梳理一下现实中的日本忍者的体系。\n基本上，历史上有名的忍者大多数都活跃于日本战国时期（《火影忍者》的角色名字也大多数取材于这个时期的忍者）。\n战国时期诸国并立，各个大名都会雇佣忍者来扩充自己的军事力量。其中最有名的两家就是甲贺忍者（先后服侍织田家和丰臣家）和伊贺忍者（主要服侍德川家）。\n除了和战国三杰关系密切的甲贺与伊贺之外，其他大名麾下也有各自专属的忍者军团。比如北条家的风魔忍者、毛利家的座头众以及虽然历史上可能不存在但民间传说非常盛行的真田十勇士。\n一个一个说吧\n甲贺忍者\n据说甲贺忍者起源于日本本土的山岳信仰·修验道。什么是修验道我就不展开讲了，看我之前的回答：\n哪些日本动漫融入了很强的神道教的世界观？\n\n猿飞佐助\n\n毫无疑问是最有名的忍者之一。\n比起“甲贺忍者”这个身份，“真田十勇士”领头人的头衔更为人所熟知。\n出自战国无双真田丸\n这个人物的名和姓被岸本拆开，分别赐给了男二号宇智波佐助和三代火影猿飞日斩。\n\n不仅如此，岸本还设定三代火影的爸爸就叫“猿飞佐助”，隐晦地玩了个梗。\n\n望月千代\n\n也叫望月千代女，历史上是否真实存在不详。据说是武田信玄下属的巫女头领。\n望月家是甲贺流忍者中的一家，除了望月千代，还出了一个英雄人物叫望月六郎，和上面的猿飞佐助都是真田十勇士的一员。\n出自信长的野望\n那么风之国的千代婆婆名字是不是取材自这位传奇女忍者呢？\n考虑到“千代”也并不是多么罕见的名字，我只能说存在这个可能性。\n\n伊贺忍者\n和号称发源于本土的甲贺忍者相比，伊贺忍者着实来…",
          "link": "https://daily.zhihu.com/story/9737704",
          "publishedOn": "2021-07-03T23:06:06.000Z",
          "wordCount": null,
          "title": "火影忍者中有哪些忍者有历史原型？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737772",
          "author": null,
          "description": "言踪，水利工程设计师\n阅读原文\n\n\n我院为之奋斗 30 年，我个人为之奋斗 11 年的电站终于投产了，非常激动！28 日晚上我们在食堂还开了酒，好多人都哭了，真的是太不容易了。\n我最近常跟人说的一句话就是，我们学的是水电专业，毕业后又深度参与世界最大的水电工程，并且把它顺利建成，刚好还赶上了 2021 年的七一，想想还真是热血澎湃，豪情万丈！\n2021 年 6 月大坝下游（航拍）2021 年 6 月大坝上游\n工程意义方面：白鹤滩发电标志着金沙江下游水电基地开发完成，这个无需多说，为实现 2030 碳达峰、2060 碳中和起到重要作用。光是每年 624 亿度电、相应减碳5000 多万吨，白鹤滩的环境效益就已经非常突出。工程环境影响方面，对鱼类、鸟类、植物也都有妥善的综合保护措施。\n第二是防灾，白鹤滩 206 亿立方米水库相当于乌东德、溪洛渡、向家坝三座姊妹水库之和，能够大大减轻长江中下游防洪压力。库区近 200 公里边坡的滑坡、塌岸、泥石流风险也得到了控制，提高了抵御自然灾害的能力。\n第三是航运，白鹤滩水库形成后，金沙江下游四座水库库库相接，原来水流湍急、险滩遍布的金沙江成为深水航道，通过翻坝转运可将从上海到四川攀枝花的路线彻底打通。\n第四是脱贫，可能很多人还不知道，白鹤滩 2000 多亿投资里面超过一半是移民工程，库区七个县原来全是贫困县，去年底 47 个新建村镇、16 条新建公路陆续建成，一夜鸟枪换炮，也算是狠狠助攻了一记脱贫攻坚。\n最后是科技，四十年前我们的工程技术和装备制造水平是发达国家的跟随者，二十年前我们可以说是并行者。到了白鹤滩，世界第一的百万千瓦机组全部国产，工程所有设计、建设、制造、安装团队都是中字头企业，我们可以骄傲地说已经是领跑者。\n世界水电看中国！2020 年 8 月白鹤滩左岸地下电站 1 号机组转子吊装白鹤滩机组示意图，注意顶部那个人有多大\n科技进步…",
          "link": "https://daily.zhihu.com/story/9737772",
          "publishedOn": "2021-07-02T23:06:18.000Z",
          "wordCount": null,
          "title": "单机容量世界第一的白鹤滩水电站正式投产发电，具有哪些重大意义？该水电站的工程技术在世界上是什么水平？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737712",
          "author": null,
          "description": "畅畅，谢天谢地你来啦\n阅读原文\n\n竟然被 @張冬磊 先生点了评论看到，既如此我就进一步梳理一下这个题吧，希望@张孟杨同学不要介意，我是来补充的。\n一、孟杨同学说的很对，罗念生先生在翻译希腊史诗时，是很讲究的，「忒」与「特」的选取差别在于τ/t/ 和θ/tʰ/ 后面有没有接元音字母η（ē）、ε（e）。但是「[e][ei][e:]」几个元音音素的说法不太准确，因为这些是近代语言学家对古典希腊语 eta 和 epslion 的拟音，本身其具体发音随时代不同，变化也很大。\n另外，「忒」不用于Ἀθηνᾶ（Athēnā 雅典娜）这种固定翻译中。\n二、在孟杨同学回答的基础上，我再整理几个类似的音译规律（括号内的都是拉丁字母转写）：\n（一）以后面有没有接元音为区别的同音音译字\n1、δ（d）\n「得」用来翻译δ后面有元音字母η、ε的情况，例如 Hādēs 哈得斯、Dēmētēr 得墨忒尔（Mēdea 美狄亚固定翻译除外）；\n「德」用来翻译δ后面没有元音字母的情况，例如 Cassāndra 卡珊德拉、Cādmus 卡德摩斯。\n2、κ（c）、χ（ch）以及ξ（x）\n「刻」用来翻译κ和χ后面有元音字母η、ε的情况，例如 Eurydicē 欧律狄刻、Andromāchē 安德洛玛刻；\n「克」用来翻译κ、χ后面没有元音字母以及ξ（发音为 /ks/）的情况，例如 Hectōr 赫克托耳、Chronus 克洛诺斯、Ixiōn 伊克西翁。\n3、γ（g）\n「革」用来翻译γ后面有元音字母η、ε的情况，例如 Agēnōr 阿革诺尔、Iphigenia 伊菲革尼亚；\n「格」用来翻译γ后面没有元音字母的情况，例如 Graecus 格剌伊科斯、Aeglē 埃格勒。\n4、φ（ph）\n「福」用来翻译φ后面有元音字母ο、ω的情况，例如 Sisyphus 西绪福斯、 Phoenix 福尼克斯；\n「佛」用来翻译φ后面没有元音字母的情况，例如 Aphrodītē 阿佛洛狄忒、Iphthīmē 伊佛提墨。\n（二）λ（l）和ρ（r/ rh）的同音异调音译字\n1、λα为拉（Laocoön 拉奥孔），ρα为剌（Hēraklēs 赫剌克勒斯）\n2、λι为利（Libya 利彼亚），ρι为里（Pāris 帕里斯）\n3、λο和λω为罗（Apollō 阿波罗），ρο和ρω为洛（Erōs 厄洛斯）\n4、λυ为吕（Calypsō 卡吕普索），ρυ为律（Eurymachus 欧律玛科斯）\n（三）ι（i）和υ（y）的同音异调或同调异音的音译字\n1、δι为狄（Dionysus 狄俄倪索斯），δυ为底（Odysseus 俄底修斯）\n2、θι和τι为提（Antigonē 安提戈涅），θυ和τυ为堤（Pithys 庇堤斯）\n3、μι为弥（Thermis 忒尔弥斯），μυ为密（Smyrna 斯密耳娜）\n4、νι为尼（Mānia 玛尼亚），νυ为倪（Erīnnyes 厄里倪厄斯）\n5、πι为庇（Epīrus 厄庇洛斯），πυ为皮（Pygmāliōn 皮格玛利翁）\n6、φι为菲（Amphitryōn 安菲特律翁），φυ为费（Zephyrus 仄费洛斯）\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737712",
          "publishedOn": "2021-07-02T23:06:13.000Z",
          "wordCount": null,
          "title": "为什么希腊神话专名翻译频繁出现不常用的「忒（tè）」而不是「特」？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737677",
          "author": null,
          "description": "是古米呀，新传考研三跨上岸，懒癌晚期，努力分享ing\n阅读原文\n\n这届观众被国产剧逼出了“剧怒症”。\n\n国产剧里刚毕业的主人公，月薪三千却住着北上广市中心的大开间。\n\n国产剧里的主人公是打工人却从来不用上班，每天有大把的时间谈恋爱。\n\n国产剧里的主人公明明是学霸人设，可就是从来不学习。\n\n明明是为了放松解压才看剧，结果剧中人物设定和剧情太过“降智”，不仅没解压，反而气出了“剧怒症”——大家看到电视剧中超级不合常理的或者让人心塞的剧情时，会感到由内而外的愤怒，这种症状在看现代剧时更为明显。\n\n不知从何时起，国产剧总是和“悬浮”“套路”联系在一起，无论是职场剧还是校园剧，本质上都是披着外衣的偶像剧；无论是甜宠剧还是伦理剧，本质上都是牵强附会的套路剧。\n国产剧这是怎么了？观众们的“剧怒症”还有解么？\n01.现实题材剧，从刻画时代到悬浮套路\n现实题材剧，是一种以现实生活为题材，以当代社会为背景讲述时代故事的类型剧。自改革开放以来，现实题材剧就是刻画时代、引领思想的重要艺术表达形式。\n80 年代，受“改革思潮”的影响，出现了一批反映“社会改革”和“伤痕文学”的现实题材剧。\n\n《蹉跎岁月》反映了特殊时期云南知青上山下乡的情感和工作经历，回味动荡年代的青春岁月，用艺术力量修复人们的精神创伤；《篱笆·女人和狗》则描绘了农村女人冲破封建婚姻思想桎梏，勇敢寻求个人幸福的故事，有着极大的解放思想的意义。\n90 年代，中国社会进入转型期，现实题材剧开始更加关注普通人的日常生活。\n\n《渴望》通过对两对年轻人复杂爱情经历的描述，将人生和人性的一切有机地融入到时代的大背景中，首播时曾万人空巷；《编辑部的故事》开中国电视剧系列喜剧先河，用夸张和调侃的手法揭露人性，剧中不少段子至今仍为人津津乐道。\n进入 21 世纪，都市情感剧和职场行业剧开始崭露头角。\n\n《蜗居》播出时正值上海房价开始飙升，剧集以当代大学生…",
          "link": "https://daily.zhihu.com/story/9737677",
          "publishedOn": "2021-07-02T23:06:07.000Z",
          "wordCount": null,
          "title": "你看剧会有「剧怒症」吗？国产剧的 bug 该作何解？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737750",
          "author": null,
          "description": "Calvin，一枚聪明又傲娇的硬件工程师！\n阅读原文\n\n一个问题\n大家知道中国人自己的第一盏白炽灯、荧光灯、高压汞灯是什么时候点亮的吗？\n\n世界光源史，短短不过百余年\n世界光源的历史，即从白炽灯开始的历史，至今不过百余年。 1850 年，英国人约瑟夫·威尔逊·斯旺爵士发明了世界上第一盏白炽灯，并于 1861 年申请了白炽灯设计专利。 但是由于当时抽真空的技术很差，灯泡中的炭丝稍遇氧气，即很快燃断，实用性很差。 当时，爱迪生也在钻研白炽灯技术，他说服了斯旺加入他的公司从而实际拥有了白炽灯的专利，在此基础上研制改良出基于碳化纤维灯丝的白炽灯泡。\n白炽灯\n1879 年，爱迪生点燃了世界上第一盏实用的白炽灯泡，这盏白炽灯可以持续亮 1200 小时。 正是基于这项技术，爱迪生于次年 1880 年创办了爱迪生电气照明公司。\n白炽灯技术给现代照明行业带来了科技革命， 到那时白炽灯却始终面临着低效能的问题 - 只有不到 10%的电能会被转化为光，而剩下的超过 90%的能量都会转为为无用的热能被耗散掉。先解决吃饱，再解决吃好，寻找一种更高效的光源势在必行。\n1910 年，法国人 A·克洛德发明了氖气放电灯，他将汞充入玻璃灯管中制成了辐射蓝光的灯管，后来又在灯管内壁涂敷荧光粉制成了辐射白光的灯管。\n1939 年，在纽约和洛杉矶世博会上，世界上第一盏实用的荧光灯得以展示。它通过加热灯管两端的灯丝释放出电子并激发水银蒸气形成等离子体，辐射出短波紫外线，紫外线被灯管内测涂敷的含磷荧光粉吸收转化成可见光，这个过程也正是这种光源用“荧光”命名的原因。\n荧光灯发光效率高，发光面积大。同样亮度的荧光灯管大于只需要消耗白炽灯 1/3 至 1/4 的电能，寿命也更长。 这也正是在 LED 出现前 荧光灯被称为“节能灯”的原因。 有趣的是，荧光灯的发明者也有诸多争议，但是通用电气公司通过一系列专利整合收购最后成为…",
          "link": "https://daily.zhihu.com/story/9737750",
          "publishedOn": "2021-07-02T23:06:01.000Z",
          "wordCount": null,
          "title": "这 100 年来，中国科技数码行业有哪些飞跃发展的成果让你感到骄傲和自豪？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737732",
          "author": null,
          "description": "艾叶，以喷会友。\n阅读原文\n\n题主的问题，在原作中真红眼黑龙出场的第一页交代清楚了。\n\n在卡片交易市场行情中价值数十万的顶级稀有度，以及顶级的攻击力数值。这就是真红眼黑龙被称为顶级卡片的理由。\n首先说它数值顶级这点，你能在早期（决斗王国篇）数出很多攻击力超过真红眼的卡。但那种靠组合或战术堆起来的数值很显然还是不能算这张卡本身 nb 的。比如羽蛾的大飞蛾需要用很苛刻的条件让毛虫进化；神鹰女郎需要靠大量装备；鬼骨冢的活死人战术要用长时间来让僵尸慢慢强化。只算基础能力值的话，真红眼黑龙确实已经非常高了，在它之上的青眼白龙、黑魔术师、恶魔的召唤，都一样是被评价为万里挑一的稀有卡的。\n大概也是因为比起各种铺垫的青眼白龙，它出现得太突兀了，当时的动画组在这上面做了些文章，围绕这张卡专门做了一个剧场版动画。这就是东映出品、延续自朝日版游戏王的，游戏王历史真正意义的第一个剧场动画，1999 年剧场版《游戏王》，民间俗称《游戏王 - 真红眼黑龙》。下面跟大家讲解下这部 30 分钟的剧场动画剧情。\n\n故事讲述的是武藤游戏邻居家，一个胆小懦弱、常被同龄人欺负的小孩，青山翔吾。他在偶然间去卡店抽包，开出了真红眼黑龙。\n\n卡店老板说明，这是和青眼白龙齐名的顶级稀有卡。显然出于大家可以理解的历史的局限性，她无法预知 20 多年后青眼白龙的身价上升到了 8700 万人民币。\n\n得到了真红眼黑龙的翔吾自然把欺负他的大孩子吓了一跳。但他从未用真红眼黑龙决斗过。只是出示这张卡证明自己已经不会输给任何人了。\n\n长期监视着童实野各大卡店的海马知道了这件事。他举办了一场赌上稀有卡的邀请赛，一方面想弄到翔吾手上的真红眼，另一方面也是为了击败游戏。\n中途，游戏和城之内在去参加过程中撞见海马的保镖，他抢走翔吾的真红眼并和游戏、城之内产生肢体摩擦。最后城之内帮翔吾夺回了真红眼，并将其加入到游戏卡组中去对战海马。\n\n王样和海…",
          "link": "https://daily.zhihu.com/story/9737732",
          "publishedOn": "2021-07-02T23:05:54.000Z",
          "wordCount": null,
          "title": "《游戏王》中真红眼黑龙为什么被称为顶级卡片？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737657",
          "author": null,
          "description": "知乎用户，爱因斯坦的斯坦。。。\n阅读原文\n\n这个问题其实是包含了好多问题。。。一个是艺术是不是需要强烈的个人风格，一个是可不可以不考虑公共性，一个是个人的艺术是不是产生于灵感的。\n艺术并不那么个人\n先说一下前者，现在有一个广为人们所接受的想法，就是艺术是一个很个人的东西，甚至是私人的东西。这大约和学院派式微，印象派的崛起和个人风格越来越受重视有关。但如果你放眼艺术史，会发现其实艺术在绝大部分时候，都是一个非常公共性的东西。\n比如古代西方，不用说，我们现在所谓的艺术家在那个时候都是工匠，雕塑和绘画上连名字都是没有的。这个情况大概一直延续到文艺复兴。更不用提古代艺术家的创作更是完全公共的作品，教堂的壁画，雕塑，古希腊的神像，都是服务于公共空间的。文艺复兴之后，服务于金主，公共性少了点，个人性大约是多了点，但也是有限得很。大概马上有人会说了，卡拉瓦乔，伦勃朗，都是很个人的艺术家，没错，但问题是他们可都是创造出新风格的人物啊，看看同时期其他艺术家，都是比较同质化的。我们学艺术史，都是节点式学习，就学那个跳变的一个点，导致我们脑子里的艺术史都是这一个个的闪光点，其实历史上 99.99%的艺术，都是在同质化的基础上有那么一点点个人的东西，我们眼睛里只看到了那 0.01%。相当于只有骨架，没有肉。直到印象派，艺术的主旋律，还是同质化的，不那么个人的。\n中国比较特殊一点，宋代以后，文人画开始流行，绘画变得个人起来了。文人画画，号称都是笔墨游戏，但这个个人只是创作心态上而言的，谈到笔墨技法，又是同质化。当然也有不少风格独特的艺术家，但还是那句话，那是 0.01%。。。至少在中国书画这个领域，你可能学这个学那个，你有你自己的路子，但那也是老路，不强调个人独创的风格。\n可以说在古代，公共性不说有多强吧，至少个人风格并不被鼓励。\n直到现代，忽然之间，艺术风格才得到了重视。每个人都在探索个人的风格，没有个人风格，大概就属于无聊的画匠了。到了当代，又没有人重视风格了，因为当代艺术范围之广，突出形式的艺术家越来越少了，可能还有草间弥生，杰夫昆斯之类具有鲜明形式特点的艺术家，但这只是无数当代艺术中的一小类罢了。\n当代艺术的公共性\n如果说形式和风格已经不是重点了，那么对于当代那什么是重点？你可以回忆一下，观看当代艺术展览，你看的是什么？你是不是在那疯狂猜，疯狂脑洞他到底是什么意思？\n所以啊当代艺术理念是最重要的，他的最终目的，是让你思考，并且思考个爽。为什么思考当代艺术会爽到？不是他风格多么独特，也不是他有多么好看，而是他表达背后理念的方式和过程，有能挠到你痒处的地方，有能戳到你小心心的地方。最终，这是一个理念的游戏。\n在以前，注重形式的艺术，只需要关注形式，人人都长了眼睛，好看的东西，大家都能看出来。但现在呢，理念就不是那么普适的东西了，每个观众的生活经历，知识，文化背景差别都巨大，对牛弹琴是常有的事情。公共性就体现在这里了，艺术品想要谈的东西，必须得考虑观众的接受问题。谈一个超级冷门的问题，没人知道，等于对着空气使力，所以得谈一个公共问题，批不批判先不说吧，也有走温暖路线的，不是说必须得批判。但讨论的问题如果太个人，别人得不到，等于不考虑观众了，也就是说有没有人看无所谓。我是严重怀疑这一点，哪怕梵高，这么自嗨的艺术，也是渴望观众的。或者说你仍然走纯形式路线？那这就过时了，老师大概是不会希望这样的，形式化的艺术路都被前人走尽了。\n艺术灵感\n最后一个问题就是所谓“灵感”不是持续的东西。灵感当然是有的，也是一瞬的，但把灵感变成艺术品，是一个需要极大耐心的，持续性思考的过程。\n如果看下面这个康定斯基画画的视频，你是不是觉得这是灵感喷薄而出的产物？好像也是没什么理由的？\n但其实不是的，这是康定斯基“唯手熟尔”的结果。他绘画一整套理论，慢慢形成《点线面》这本书，详细到你照着操作就能画出满满地都是康定斯基味的画来。这是长时间持续思考的结果，里面当然也汇聚了康定斯基无数个灵感的瞬间。但最终呈现出来的，就是视频这个样子，几乎不需要多加思考。\n包括梵高也是一样的，别看他画的好像很潇洒，其实都是他画废很多张之后出来的东西了。比如向日葵，据他的日记说，画了很多都不满意，反复雕琢，才出来他认为好的几张向日葵。\n当代艺术的很多“idea”，也是一样的。瞬间的灵感只是一个种子，要让这颗种子长大开花，成为最后的艺术品，需要细心的培育。同时因为当代艺术是一个理念的游戏，你就得对理念进行深入的思考，这是支撑起作品的内核，否则就只剩下一个形式的空壳，而形式对于当代艺术等于什么都没有。\n也有一些当代艺术作品是没经过仔细思考，就“看起来很当代”的那种，作者可能也没仔细想过。但这些一般都不是好的作品，或许偶尔瞎猫碰少死耗子出来一些好的，那也是随机事件罢了。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737657",
          "publishedOn": "2021-07-01T23:07:05.000Z",
          "wordCount": null,
          "title": "不具有公共性的艺术还算艺术吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737645",
          "author": null,
          "description": "sydneyhugh，会跳高的父亲，理性的白痴\n阅读原文\n\n电影拍摄时的难度是可预见性。\n为什么是可预见性，另外组成可预见性有那些不可预见的因素影响。\n因为商业电影拍摄无论数字还是胶片大约在是一个 35mm 到 70mm 的胶片或感光元器件上记录下来拍摄的现场信息，拍摄完经历一系列处理最后与观众见面的是大屏幕。放大很多，所有的缺陷都会放大。\n另外电影是剪接的艺术，每次拍摄一段，然后进行拼接和剪接完成最后的整部电影，那么它们在成片前不同机位，机器不同时间拍摄的内容需要精密的控制技术参数便于无缝的再组合。不然一个正反打观众就觉得不一个环境，那就车祸出戏了（这就举个最最简单的小例子）。\n所以电影要求拍摄时的范围尽量变小，做减法，小到影响拍摄的可能性降至最低。所以拍摄范围也相对减小。\n电影演员除了表演外，最大的要求是自己的位置感，就是你被拍摄时，你与对应环境与人以及摄影机的位置关系。不然导演就要忙乎，让你在你的位置表演。这样看，孩子和动物对于这种所谓的位置感是很陌生的，有很多专业演员都做的不一定好（说个笑话，电影学院培养的演员一般位置感好，戏剧学院培养的演员则台词好，但动作过大，过于夸张，微表情差）。那么当然导演，摄影，灯光一大堆人就一通忙乎，重拍率就大大提高。\n我自己经历过多次拍摄动物，比如 speedo 的全球投放广告索普与海狮还是胶片时代，120 秒，我勒个去拍了一个月。海狮一会太配合，一会不配合，萌萌哒，气得你笑出来。国内拍七匹狼广告，狼是美国搞过来从小狼崽养起来的，拍完了都说再也不给自己惹这种麻烦了。因为要狼们按一个阵形跑，那简直就是用肉啊。吃多了不干活，吃少了乱动，四个机位最后拍摄周期太长直接上 6 机位了都。\n小孩。小孩的问题是过度表演。影像要求的自然，孩子一上场听到导演说开始，就如同打了鸡血一样的满脸诗朗诵的表情。结果呢？让表演回归自然等于上了一个月表演培训课。\n水。水的问题是各种反光，衍射，当连贯影像出来后一致性差。主要是不同条的一致性差。另外棚拍时候自然模拟的参数和感觉需要大量实验参数积累和模拟。难度在接触面的感觉。比如自然情况下下去 4-5 点的黄金拍摄期阳光，海与船体，岸边，以及船上人与物品的自然光反射模拟情况复杂。很多时候模拟可以完成，但自然特点不够理想。比如拍《甲午海战》，不同水质对于不同材质和重量的反应不同，结果呢？其实很车祸。\n国外有一些专门的小公司做动力试验，参数完整，拍摄时会外包购买。但不便宜。比如拍《太平洋战争》的制片，特指和摄指，其实出生都是原本部队的技术人员，退役军官。\n这一堆加在一起比如老虎，船，海，小孩，棚内，外景，前期参数与后期参数匹配，影像对位资料都加一起。是不是要吐血？\n当然没有什么不是一闭眼就能过的。关键还要看要求和标准了。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737645",
          "publishedOn": "2021-07-01T23:07:01.000Z",
          "wordCount": null,
          "title": "为什么小孩、 动物和水是电影界三大最难拍摄的元素?",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737644",
          "author": null,
          "description": "王小龙，陕师大数统院讲师\n阅读原文\n\n一个好好的数学问题为啥没人正经答题呢？\n先说结论：两种策略的赢率是一样的，但是赢率的波动性大小不同。\n假设你叫小明，玩一把游戏的获胜概率是\n\n，输的概率是\n\n，各局游戏相互独立，有两种游戏策略：输了就睡觉和赢了就睡觉。这就带来几个问题：\n\n什么时候能睡觉？\n胜率如何？\n如何稳赢？\n\n为了分析这些问题，定义随机变量\n\n和\n\n分别为采取\"输了就睡觉\"和\"赢了就睡觉\"策略玩游戏的总局数，那么由独立性条件可以得到概率：\n\n\n即前\n\n局连赢(输)，第\n\n局游戏第一次输(赢)的概率，这个分布称为几何分布。注意这两个分布具有对称性(把\n\n和\n\n对调，问题只是换了一种陈述）。\n问题 1：什么时候能睡觉？\n计算游戏局数的期望：\n\n类似地，由对称性：\n\n因此\n\n等价于\n\n，也就是说，如果小明的胜率\n\n，\"输一把睡觉\"能够更快地睡上觉。如果小明很菜，\n\n，采用输一把睡觉的平均游戏局数为\n\n也就是基本上玩一局就能睡觉啦。反之，如果小明错误的采用\"赢一把睡觉\"的策略，那么他平均需要玩\n\n，因此对于菜鸡来说，赢一把就睡策略的潜台词是我要通宵。\n问题 2：胜率如何？\n如果采取\"输了就睡觉\"策略反复玩游戏\n\n天，每天一共玩\n\n局，其中赢\n\n局，输\n\n局，那么总共赢了\n\n局，输了\n\n局，赢率为：\n\n其中我们用到了大数定律，大量样本的平均值趋向于期望\n\n如果采取\"赢了就睡觉\"策略反复玩游戏\n\n天，每天一共玩\n\n局，赢\n\n局，那么总共赢了\n\n局，赢率为：\n\n因此如果每天采取同样的策略玩游戏，长此以往，两种策略的赢率是一样的，都是\n\n。这类似于如果所有人都采用一直生娃，直到生出男(女)娃停止的生育策略，那么男女比率还是 1:1。\n问题 3：如何稳赢？\n现在小明有了三种游戏策略：a.只玩一把就睡觉，b.输一把就睡觉，c.赢一把就睡觉，上面我们推导出这三种策略的胜率都是\n\n。但是在现实生活中，这三种策略的实际胜率具有随机性，其波动大小并不一样。这就好比你有三种股票可以选择投资，它们的平均回报率可能都是 5%，但其波动性不同：第一种股票稳赚 5%，第二种股票可能赚 1%-%9，第三种股票可能赚 15%，也可能亏 5%，只是平均而言赚 5%。小明的人生只有一次，因此当他选择投资方式时，应该选择波动性较小或者风险较低的投资方式，甚至为较小的风险、牺牲一定回报率也是值得的。这也是为什么国债虽然利率低，但总是很抢手，因为风险极低。\n我们可以用胜率的标准差来衡量其波动性，假设小明是高玩(\n\n)，下图种展示了小明采取三种策略的胜率的均值和标准差，可以看到随着游戏天数增加，三种策略的平均胜率很快趋向于 0.9，但\"输一把就睡\"的 error bar 更窄，说明胜得更稳。\n\n相反，下图表明如果小明是菜鸡(\n\n)，采取赢一把就睡的策略，不仅能够爽玩，赢率也更稳定。如果小明的目标是提高胜率，那么采取输一把就睡策略，胜率的波动性更大，更有可能高到 0.15 以上，但也有较大可能低到 0.05 以下，如果小明兼有赌狗属性，也许会不理智地选择这种高风险策略。对于理性人来说，当平均收益(胜率)相同时，总是应该选择低风险的策略。\n\n总结：\n两种策略的赢率是一样的，对于高玩(\n\n)采取赢了就睡觉策略能更快睡上觉，但赢率波动性较大，反之对于菜鸡(\n\n)，采用赢了就睡觉策略更难睡上觉。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737644",
          "publishedOn": "2021-07-01T23:06:51.000Z",
          "wordCount": null,
          "title": "从概率学上看，输一把睡觉vs赢一把睡觉，哪个胜率更高一些？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737635",
          "author": null,
          "description": "姚蔚铭，纺织品化学工程师（神秘职业） 纺织品问题请付费咨询\n阅读原文\n\n先说结论：防晒口罩就是智商税，并且还要额外收点生命税\n如果你想弄明白防晒口罩，那你一定要找我，因为只有我（姚蔚铭 纺织品化学工程师）才能给你讲明白。\n凡是大肆假科普真带货的文章，都会只和你提防晒口罩的防晒效果（UPF 值）,如果你知道防晒口罩是如何生产制造出防晒效果的，那你可能再也不愿意用了。\n插一句，防晒伞也是智商税“遮阳伞有必要买很贵的吗？”但防晒衣不是智商税“防晒衣是不是智商税？”，它们的防晒出发点并不一样。\n\n1.盲目追求 UPF 数值 毫无意义！\n正常的防晒功能根本不需要去实现，普通的几毛钱的一次性口罩就有足够的防晒效果了。如果没有，那他们的脸是如何晒成这样的？\n\n许多商家都在标榜自己的产品高 UPF 值，但根本不给你解释清楚什么是 UPF 值。\n\n其实这串八股文换成人话讲就是\n50 UPF=只有50 分之 1的紫外线可以通过\n30 UPF=只有30 分之 1的紫外线可以通过\n..........以此类推\n假科普真带货的文章，只会一味告诉你购买 高 UPF 值 的防晒口罩，其实高 UPF 值毫无意义。\n哪怕 UPF 只有可怜的 15（普通口罩水平），也能阻挡 93.3%的紫外线。\n因为我真的有设备直接测试（普通医用口罩）\n看似防晒口罩 UPF 50 和 30 差距很大，其实 UPF 50 换算过来就是紫外线穿透 2.0%，UPF 30 等于紫外线穿透 3.3%。\n差距根本不大，良心的讲，盲目追求 UPF 数值毫无意义。\nUPF 值详细分析参考这篇防晒衣是不是智商税？\n2.高防晒值的口罩是如何制作的？\n前面讲了，普通的口罩足以提供良好的防晒效果（日常出勤完全完全完全足够），但是“通过防晒产品的认证”要求是很严格的。\n要达到 UVA 透射率小于 5%，UPF 值大于 40\n因为中国防晒产品的标准基…",
          "link": "https://daily.zhihu.com/story/9737635",
          "publishedOn": "2021-07-01T23:06:43.000Z",
          "wordCount": null,
          "title": "防晒口罩和普通口罩的区别在哪？是智商税吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737666",
          "author": null,
          "description": "宜柔，有的人之所以宝贵，是因为他们像风，永不停歇，谁也留不住。\n阅读原文\n\n这种说法不对。周芷若不仅打算杀了赵敏，而且实施了杀人行为。你想想，把一个中了十香软筋散之毒且处于昏迷状态的人扔进海里，这种行为本身就包含了致人死亡的高度盖然性。只不过赵敏运气太好了没有死，这不叫不杀赵敏，而是“欲达目的而不能”，周芷若构成故意杀人罪（未遂）。\n祝绪丹版周芷若\n至于为何不嫁祸谢逊，那是因为：第一，周芷若当时并不知道金毛狮王偶尔会发狂；第二，周芷若给所有人都下了十香软筋散，狮王本人也中了毒；第三，周芷若本人还出于嫉妒和嫁祸于人的目的，把蛛儿的脸划伤了，从这点来看，赵敏嫌疑最大，因为曾经赵敏在万安寺也是预备毁周芷若容的。而谢逊如果发了疯，何至于毁了蛛儿容貌，这点在逻辑上难以自洽。\n高圆圆版周芷若\n所以我想，你想问的是“为何周芷若没有手刃赵敏或者把她捂死、掐死，而是要让她被海水淹死”。这是因为周芷若什么都想要：一来她要报杀师之仇，赵敏对灭绝师太的死确实是有很大的责任；二来她想要婚姻，杀了正妻蛛儿后一定要有个嫁祸的对象；三来她想要张无忌的爱情，那么赵敏一定要带着满身污点去死。\n张敏版赵敏，搭档是黎姿，黎姿目前是唯一个既演过周芷若又演过赵敏的演员，但这个版本的周芷若其实是周芷若 + 朱九真。\n四来倚天屠龙的秘密只有她知道，而赵敏持有倚天剑，又是朝廷的人，自然应该嫁祸赵敏；五来当时岛上只有他们 5 个人，谢逊和张无忌情同父子，正房蛛儿又病入膏肓，那么最适合嫁祸的那当然是赵敏了，而且赵敏本人太聪明了，只要赵敏没死，那么她一定会输。概言之，在周芷若的计划里，赵敏必须是背锅侠，也必死无疑，还要死得其法。\n陈钰琪版赵敏\n那么为何不能把赵敏掐死、闷死，或者砍死呢？那是因为若趁赵敏昏迷掐死或者闷死她，然后扔进海里喂鱼，貌似是安全了。可如果一旦海浪把赵敏尸体带回来，张无忌很容易就会发现赵敏在落水之前就死了，因为如果是淹死的，肺里面不可能没有水，肺里没水就说明赵敏一定是被弄死了再扔海里的。\n贾静雯版赵敏\n砍死赵敏后再扔水里也同理。问题关键在于周芷若要让张无忌恨赵敏，那她就要“制造”出一个无比阴毒的赵敏，让众人觉得是赵敏意图下毒夺刀杀人。如果赵敏尸体被海浪冲回来，她倒是可以推说赵敏是因为遇到波斯船队被砍杀而死。但只要找到波斯人对峙，谎言就会被戳穿，同时因为她想要张无忌的爱情，她需要维持一种楚楚动人、无依无靠的人设，所以她不能冒这个险。\n黎姿版赵敏\n所以，对于当时啥都想要的周芷若来说，最万无一失的万全之策就是直接让吃了十香软筋散的赵敏沉入大海。那时候，由于死人不会说话，即使赵敏的尸体被海浪冲上了岸，所有人也都只会觉得赵敏是“自作孽不可活”，那时候周芷若想要的婚姻、爱情、掌门人、教主夫人，还有武功艳压群雄、找到完美替死鬼、为师父报仇等目标都可以实现了。\n佘诗曼版周芷若\n当然后来周芷若千算万算也没想到：孤岛上忙活了一通下来，蛛儿没死、赵敏被救起，谢逊也知道了孤岛事件的真相，自己机关算尽、寻死觅活、一哭二闹三上吊谋来的姻缘，就这么成了笑话。也可以说是人算不如天算，苍天有眼了。\n叶童版赵敏和周海媚版周芷若\n\n\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737666",
          "publishedOn": "2021-07-01T23:06:37.000Z",
          "wordCount": null,
          "title": "周芷若在荒岛上为什么不杀赵敏？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737670",
          "author": null,
          "description": "为什么有些人认为“不要跟律师谈恋爱”？\n\n刘泽枫，谈笑怼鸿儒，往来干白丁。懂王刘大律师v：zefeng03\n阅读原文\n\n因为谈恋爱没有法律效力，一般都是建议跟律师结婚\n阅读原文\n\n南方人在北方生活，有哪些搞笑的事？\n\n知乎用户，泥萌能不能自己独立完成作业？\n阅读原文\n\n讲个笑话吧。黑龙江这里，入冬之后，人们说气温的时候是不加“零下”俩字的，默认就是零下。有一年冬天，一个广东老板，第一次来哈尔滨玩，晚上下飞机直接坐车到酒店，没觉得冷。第二天早上问大厅前台，今天气温多少呀。前台说，22度。老板穿个短袖就出去了……\n阅读原文\n\n你爸妈刚用支付宝时闹出过什么笑话吗？\n\n知乎用户，家庭煮夫\n阅读原文\n\n我来说一个，我妈刚学会蚂蚁森林的时候，每天早上定时给我扔大便，定时，定点，每天，我一开始以为这是她俏皮的跟我打招呼的方式，直到春节回老家提起，她说，难道扔大便不是在给我的树施肥吗？她一直以为我的树是她扔大便施肥长大的！\n阅读原文\n\n如何用一张图证明你看过《权力的游戏》？\n\n知乎用户\n阅读原文\n\n\n\n\n阅读原文\n\n被男生强吻是一种什么样的体验？\n\n铁拳森林，出口贸易行业里最沙雕的男人\n阅读原文\n\n我以为我这么帅她不会报警\n\n\n\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737670",
          "publishedOn": "2021-07-01T23:06:29.000Z",
          "wordCount": null,
          "title": "瞎扯 · 如何正确地吐槽",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737623",
          "author": null,
          "description": "浩浩耗，我有屠龙之术，欲翻流云起舞；我有苍茫之志，欲煎七海成田；\n阅读原文\n\n好吧，我只不过就是简单的解读了一下这篇论文的内容，而且还写了个人觉得，对结论参考值得思考的地方。还是有朋友觉得我是在卖咖啡，我一小渣渣有能力帮一个产业带货？太看得起我了 哈哈\n那我就把核心部分放在最前面吧，并且提醒大家：平时不怎么喝咖啡的，千万不要因为这个结论改变自己的习惯，因为 没有用，没有用，没有用！！！\n原因我原文写在最后，那就先提上来吧\n当然，这项研究的结论因为其样本人群数量很大，所以还是有相当的可信度和说服力的。但对于我们中国人来说，也只能作为一个参考，并不能完全照搬结论。原因如下：\n首先，因为中国人与欧洲人群存在着很大的遗传背景差异，同时生活环境和饮食习惯也有很大的差异，而这项研究的人群主要都是英国人，因此是否同样的结论能够在中国人群数据上重复，还是一个未知数。\n其次，所谓“抛开计量谈效果，就是耍流氓”，虽然近年来，我国的咖啡饮用量正在逐步上升，但相对而言还是远远低于欧美人群的。比如这项研究里，喝咖啡的人群，其每天饮用量的中位数是 2 杯，而我国人群对咖啡的平均饮用量明显是要低于这个量的。因此，是否摄入咖啡需要满足一定的量，才会起到保护肝脏的作用，仍然是一个值得进一步研究的问题。\n原回答：——————————————————————————\n慢性肝病，近些年来在全球范围内的死亡率和发病率，都一直在持续增长。而之前有一些研究结果发现，咖啡消耗较多的地区，患慢性肝病的比例相对偏低，但具体原因，是否与咖啡的类型相关，都还没有具体的结论。\n近期，一项基于英国人群大数据的研究结果发表，对这些疑问有了进一步的解答。那关于这项研究，这些核心知识点值得了解：\n\nI. 首先，整个研究项目的入组人群数接近 50 万人（其中约 39 万人有喝咖啡的习惯，另外 11 万人是不喝咖啡的），入组的人群不仅有平常饮用咖啡量的数据，也有其电子病例等临床数据。因此，这样数量的研究人群，几乎可以说是史无前例的。\nII. 研究同时分析了不同类型的咖啡，包括研磨咖啡，速溶咖啡和不含咖啡因的咖啡（decaffeinated）。\nIII. 整个研究结果跟踪的时长中位数为 10.7 年，在这个过程中，有接近 1 万人，出现了慢性肝病相关的症状。\nIV. 研究结果发现，无论是喝哪一种咖啡，患慢性肝病的比例都显著低于不喝咖啡的人群。同时，相对而言，喝研磨咖啡的人患慢性肝病的风险（Hazard ratios=0.65）比其它两种类型的咖啡更小。\n\n当然，这项研究的结论因为其样本人群数量很大，所以还是有相当的可信度和说服力的。但对于我们中国人来说，也只能作为一个参考，并不能完全照搬结论。原因如下：\n首先，因为中国人与欧洲人群存在着很大的遗传背景差异，同时生活环境和饮食习惯也有很大的差异，而这项研究的人群主要都是英国人，因此是否同样的结论能够在中国人群数据上重复，还是一个未知数。\n其次，所谓“抛开计量谈效果，就是耍流氓”，虽然近年来，我国的咖啡饮用量正在逐步上升，但相对而言还是远远低于欧美人群的。比如这项研究里，喝咖啡的人群，其每天饮用量的中位数是 2 杯，而我国人群对咖啡的平均饮用量明显是要低于这个量的。因此，是否摄入咖啡需要满足一定的量，才会起到保护肝脏的作用，仍然是一个值得进一步研究的问题。\n\n\n\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737623",
          "publishedOn": "2021-06-30T23:06:47.000Z",
          "wordCount": null,
          "title": "新研究称喝咖啡有助保护肝脏，是真的吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737627",
          "author": null,
          "description": "魏玮，丁香诊所内科医生\n阅读原文\n\n可能得先去定义什么叫做「损伤」。\n吃冷的东西有可能让你不舒服。接触到冷食的口腔、胃肠会发出信号告诉大脑：「我们冷了」。负责感知冷的温度感受器，大约在 25℃ 之下就开始启动了，10 几度的时候会更欢实。冷信号被传递给大脑，你先会感觉到这种「冷痛」。然后后续可能还有其他，有的来自于人体感知到冷后的天然保护动作：胃食管痉挛减少产热、更多的消化液分泌提高局部温度。有的更复杂些，跟脑肠轴有关，后天事件能影响到，比如如果你从小就被灌输建立了冷会让我不舒服，口腔一接触到冷，胃肠就会做出一系列敏感度的变化，让你更快有便意有腹痛。\n这些可能都会存在，具体呈现到什么程度，取决于到底有多冷，你是不是有建立这样跟冷的反应关系，以及吃冷食给你带来的快乐（更甜更冰爽）是不是足够掩盖这些不舒服。如果把这些可能的不舒服，也叫做损伤的话。那确实吃低温的东西「损伤」了胃。但我们要知道，冷痛，真的很表面。除了传递出去冷信号之外，直接跟冷接触的黏膜并不会因此受到实际伤害。黏膜的样子、功能都是正常的，也不会有未来出现的麻烦。过去也就过去了，不留下一丝痕迹。可能随着你越吃越多，而越能耐受跟身体不太一样的温度，对冷热变化都不会那么的敏感。\n吃冷在这一点上跟吃热食是不一样的。也许你（主要是你的上一辈们）也可以适应更热的食物而不会有当时的不舒服，但这些热暗中是一点点累积伤害黏膜的。食物超过 65℃，食管癌的风险就会慢慢增加。\n所以年轻人爱吃冷就让他们吃去嘛。对冷热食物的选择，我们不应该给出不必要的限制，而是直接一点儿说，吃的冷点儿热点儿确实可能让你有些不舒服，但你就是你，你可以根据自己的情况选择适合自己的温度，快乐就好。如果你喜欢吃点儿热的，那也尽量注意不要超过 65℃。\n冷食就没有要注意的下限了，反正我们平时能耐受的冷藏冰镇温度，都不至于出现真实身体伤害。要做什么健康科普，就更应该告诉别人注意冷藏保存的卫生，冰箱储存直接食用的食物一定要是密封的，不要切开西瓜随便就放进冰箱里，这样有可能导致李斯特菌等感染，更不要拿出来之后放置很久再吃，那样的话患上感染性疾病的风险更高。\n当然，严格说，确实也有罕见的例子，人真的被吃进去的东西冻伤了。还真是特例。最近，BMJ 刊登过一篇个案报道。有人吸食笑气的时候太着急，压缩气体释放局部大量吸收热量造成了极冷环境，嘴巴就被冻伤了。这算是正儿八经的「吃冷」损伤了……\n\n图片来源及参考文献：Nabben T, Weijs J, van Amsterdam J. Problematic Use of Nitrous Oxide by Young Moroccan–Dutch Adults[J]. International journal of environmental research and public health, 2021, 18(11): 5574.\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737627",
          "publishedOn": "2021-06-30T23:06:43.000Z",
          "wordCount": null,
          "title": "食用冰镇西瓜或引发胃损伤，你怎么看待？夏天有哪些东西推荐食用？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737618",
          "author": null,
          "description": "从八品盛京游牧副尉，略懂法术\n阅读原文\n\n实施家庭暴力是可以判离婚的具体情形之一，从最大程度的保护自身来讲，遭遇家暴时留存证据，对于争取离婚、财产分割、争取孩子抚养权都非常有利。下面说说家暴取证。\n最常用的证据就是伤情照片，挨打了第一时间要把伤情照片拍下来，不然有些淤青啊肿胀的地方过一段时间就恢复了，注意不能仅仅拍局部，到时候法官怎么知道是不是你呀。所以要尽量拍露脸的全景照片。比如蒋劲夫家暴，受害者拍的照片就很有说服力。\n一定要在伤势看起来最严重的时候拍\n再有就是要保存好就诊证据，就诊后务必把医疗本啊、诊断证明啊、医疗报告、住院病历等保存好。因为这些材料都是在你向医生陈述伤情时形成的，相当于医生给你做的笔录。还有的打骨折的，拍了片子也要留好。这些都是法庭可以采纳的有力证据。\n\n最重要的就是报警问题，如果觉得事态很严重一定要报警，情绪再失控的人听到警察俩字也会注入一丝理性，这对保护自身安全很有利。如果当时没机会报警，那么事后也不能心软，也要第一时间报警，原不原谅是以后的事，先让警察看看伤再说。有的小区里为了便民会留下所属派出所电话，因为出警时间会缩短，但注意了，报警时一定要打 110 报警，而不要打什么派出所电话，因为 110 报警会有报警记录留存，他们有个接警系统，接电话就需要往系统里输入时间地点什么事，而派出所电话往往没有报警记录。\n警察来了后一看是两口子打架，肯定先调解，这时候你就得要求警察做笔录，为的就是怕打人的以后不认账，照片、医疗证明都可以证明你受了伤，但并不能直接证明是谁打伤你的啊，现在警察现场白纸黑字给你记下来，以后想不认账都难。\n警察一般不会因为两口子打架拘留，因为拘完了自己麻烦事也多，所以一般都会极力调解结案，不能就让警察叔叔就这么走了，调解结案行，得给出具个告诫书，告诫书啥意思？这是《反家暴法》立法者考虑到家暴取证难的问题，特意安排给公安机关的一项法定文书。就是告诉打人的，告你奥以后老实点不许再动手了，再动手收拾你奥。就这么个东西。告诫书有啥用呢？跟笔录一样，相当于警察给你出的他打你了的证明。\n警察看大面上如果伤的不是很严重，一般不会主动提伤情鉴定的事，多一事不如少一事。但如果你自己觉得被打的挺严重，那也不能委屈了自己，可以当着警察的面要求做伤情鉴定，万一是轻微伤或是轻伤呢？那你就牢牢的掌握了主动权。\n\n最后记得要民警的联系方式，你生成了这么些证据，又报警记录，又笔录告诫书的，以后上哪找去啊，公安局忙法官更忙，如果法官以后调取证据的时候知道找谁，他也乐意帮你去找。\n有的人面子薄，不好意思将家丑暴露在公权力下，或者干脆不忍心报警，怎么办呢？也不是一点办法没有，让打人的写保证书，写完了签名，留好。保证书大家都知道吧，小时候都写过，其关键用语是“我以后再也不.....”。保证书有啥用呢？跟笔录一样，还是证明人家打你了。\n还有一种常用证据就是证人证言，有时候家暴发生的地方不在那么私密的空间里，被亲戚、街坊邻里看到了，那么他们的证言就可以证明家暴的发生。如果被打的时候谁也没看到，但是你跑到亲戚朋友家里了，哭诉这个挨削了啊，你瞅瞅啊，亲戚朋友听你这么一说，再一看你这青一块紫一块的，那么他把这个过程在法庭上复述一遍，仍然可以构成间接证据。\n如果挨削已经形成常态了，那不妨提前准备好摄像头之类的设备，或者整个录音笔提前开开，这玩意比上边说的那些个可都好使，可以直接证明家暴的发生。如果没有事先准备，也需要有个意识，挨削了尽量往有摄像头的地方跑。\n还有的经常挨削的，街坊邻里都知道了，居委会村委会可能还到家里做过调解工作，如果调解过，就说明知道这事，可以让当时介入过你们家事的这些机构（街道、妇联、村委会居委会）出具个书面证明，也不用让机构证明有家庭暴力，你就把当时调解的情况写明白，就足够了，而且证据能力很强，作用还是证明人家打你了。\n家庭暴力的特点是多次发生，第一次没处理明白很可能就有第二次，有的平时像个人似的，打人时候控制不住自己，等打完了也清醒了，咣咣磕头道歉，然后心一软原谅了，在寄希望于对方改过的时候再次挨削。\n\n这种人渣，能离了最好，实在离不了，也要构建均势力量，均势是地缘政治学中的一个词，是指国际体系中的国家试图保持力量的平衡，以防止任何国家占据优势地位。在家里也是一样，不能总让一方占据打人的绝对优势地位，比如一个会空手道的妻子挨打的几率会比其他女性小。如果一方优势地位已经确立，你很弱小根本打不过对方，那就要想办法限制对方发挥这种优势，或者让对方知道发挥这种优势的代价很大，比如有一个强壮的哥哥，比如争得当地警方同情，比如去对方单位领导那里把对方批判一番，以实现另一种形态的制衡。最后，防止家暴最重要的手段还是选对人，过滤了人渣，也就远离了家暴。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737618",
          "publishedOn": "2021-06-30T23:06:35.000Z",
          "wordCount": null,
          "title": "第一次被家暴后应该怎么处理？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737601",
          "author": null,
          "description": "在远方的阿伦，自驾旅行作者，独立纪录片导演，星球研究所/天空之城特约摄影师\n阅读原文\n\n2021 年，我在新疆从冬天跨越到了春天，终于等到了新疆最美的春天\n这次的旅途包括博州的赛里木湖、木特塔尔沙漠胡杨，古尔班通古特沙漠，伊犁河谷的那拉提山、库尔德宁雪岭云杉森林、 那拉提草原、昭苏草原、特克斯，昌吉 101 省道、硫磺沟和棉田等地，依旧由我独立拍摄和后期完成。\n“在时冻若严寒，归来恍如盛夏”是这次旅行给我的最深印象。因为接连几场的暴风雪不仅打乱了我的拍摄计划，还冻结了天山南北以及伊犁河谷地区的所有农牧生产活动。可以说，这场来自西方的寒冷空气对我和其他游客而言，是何其的不幸；而且对于当时当地的农民和牧民来说，也是影响深远。 但是当我返回上海重新开始拼接整个旅途的记忆碎片时才发现我又是何其幸运的从新疆的冬季，穿越到了新疆的春季；并且在这过程里，见证了天山以北包括伊犁地区万物开始苏醒的蓬勃生机。\n\n我在昌吉偶遇了的这家普通农户家的棉田，正赶上他们 2021 年的第一天播种，通过北斗定位、播种、安放滴灌带、覆膜一次完成，我也帮着一起干了一天的农活。\n关于这次天山环线的旅行详情，我会在接下来的文字版里再述，而至于新疆，我想当你看完这段文字时，新疆基本就已经处在最适合旅行的时节里了。\n我记得甘南这部片子的弹幕和评论里最多的就是，这不是欧洲吗？这不是阿尔卑斯山吗？不，这是中国甘肃省甘南藏族自治州的江迭公路“洛克之路”，冰川造就的远古巨兽\n这条路，自驾去过的人不算少，但从全国自驾游的尺度来看，就算是到了如今，那也算是小众中的极小众。其中风景最为精华，最为无敌的路段，集中在光盖山的囊黑卡（也叫那黑卡，纪录片里有注解）到与“车巴沟”汇合的路段。\n自从 2020 年 12 月纪录片发布以来，很多朋友先后前往了，尤其在今年的五一长假大家都给我发来了“远方回声”，可惜那时囊黑卡以西积雪覆盖无法通行。…",
          "link": "https://daily.zhihu.com/story/9737601",
          "publishedOn": "2021-06-30T23:06:27.000Z",
          "wordCount": null,
          "title": "旅行中的哪一刻令你感到「祖国的山河美如画」？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737608",
          "author": null,
          "description": "ASICS亚瑟士，Sound Mind, Sound Body\n阅读原文\n\n只要非病理性的出汗，那运动中的大量出汗是一种正常的生理现象。\n并没有“好”与“坏”的说法。\n附上 30 条关于运动出汗和补水的真相。相信看完这些，对运动中的出汗就能有一定认知：\n\n关于运动中的出汗\n运动中大量出汗意味着什么\n畅快流汗同时的补水策略\n\n2019 年多哈世锦赛马拉松决赛，尽管比赛放在夜间，起跑时的气温高达 31℃，对所有选手都是很严峻的考验，完赛率不到 60%。一场马拉松下来选手的体重降低都达到 2 公斤以上多哈世锦赛马拉松，川内优辉以 2 小时 17 分 59 秒的成绩完赛\n\n关于运动中的出汗\n1.除非是病理性的原因导致出汗不正常，不必过于紧张运动时大量出汗；\n2.运动中的出汗，本质上是人体调节体温的一种方式。在运动过程中，人会不断产生大量热量，而出汗能让身体维持在一个适合的体温中，继续运动下去；\n3.人平均有 200-400 万个汗腺，每个腺体释放多少汗水取决于许多因素，包括遗传、年龄、健康水平等。体重增加，出汗率也会明显提升。通常情况下，男性的出汗量往往比女性更大；\n4.随着汗液一起排出的，还有钠、钾、钙、氯以及少量尿素氮等，不过最大量的还是水分；\n5.成年人的最大出汗量，每小时有人是 2 升，有人能达到 4 升，个体差异极大；\n6.需要辟谣的是，很多裹着保鲜膜、刻意焐热增加出汗等方式，非但没有宣传效果，还容易增加虚脱、皮肤炎症等的附带问题；\n7.迄今没有任何医学研究表明，出汗有所谓的“排毒”效果；\n8.人类在某种程度上具备如今的运动能力，尤其是有氧运动（耐力）能力，很大程度上就是拜强大的出汗能力所赐 ^^\n9.2014 年的一个实验数据，对照 16 名长跑选手和 20 名办公室久坐选手，即便是日常情况下，长跑选手的出汗量、活跃汗腺数量、单位汗腺汗液输出量等都远高于久坐的人，他们的…",
          "link": "https://daily.zhihu.com/story/9737608",
          "publishedOn": "2021-06-30T23:06:21.000Z",
          "wordCount": null,
          "title": "运动大量出汗对身体好吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737633",
          "author": null,
          "description": "为什么说「21 世纪是生物的世纪」，但生物工程专业却被称为「天坑」？\n\n知乎用户，温和的沙文主义者\n阅读原文\n\n为什么说 21 世纪是生物的世纪？\n因为学生物的转行到了各行各业。\n阅读原文\n\n飞行生物为什么没有演化出像暴龙狮子老虎那样的顶级掠食者？\n\n婷婷，二次元大龄剩女，前来给宁看脸来了@！@\n阅读原文\n\n\n\n\n阅读原文\n\n为什么上海人那么好辨认?\n\nHarriet\n阅读原文\n\n因为宿舍里面只有上海人桌上会有卡西欧 991\n阅读原文\n\n如何看待Steam开始遣返国人阿根廷区账户回到国区？\n\n冬马要努力变强，克莱登大学阴阳怪气学研究生在读\n阅读原文\n\n我是一个来自浙江杭州的玩家，前几天我在西溪湿地边上发现一个很深很深的洞，于是我跳了进去，没想到这个洞是穿过地心直通地球另一端的洞，那个国家的国旗是蓝白的中间还有个太阳。我觉得很神奇，于是我找了个网吧注册了一个 Steam 账号，过了几天又顺着洞跳了回来。\n我不知道什么阿根廷，也不知道什么低价区，就是希望 G 胖你别封我的号，这一切都是误会。\n阅读原文\n\n长得太美是一种什么样的感觉？\n\nScarlett，靡不有初 鲜克有终\n阅读原文\n\n其实也没有特别的感受\n长得美也是平平淡淡的普通人生活而已\n那些纸醉金迷烈火烹油\n也只存在于别人的臆想\n非常感谢爸爸妈妈给我这样的基因\n可以靠一张嘴在这叭叭叭叭\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737633",
          "publishedOn": "2021-06-30T23:06:17.000Z",
          "wordCount": null,
          "title": "瞎扯 · 如何正确地吐槽",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737588",
          "author": null,
          "description": "运动分子，体育科普/运动知识/装备测评/赛事报道/选手故事/\n阅读原文\n\n题目里，姚明、刘翔和李娜放整个中国体育史上，都是各自领域独一无二、甚至完全没有接近者的存在。\n放更大的范围，他们也都是世界级（world-class）的选手，全世界、整个人类历史上都不多见——用这一类运动员作为分析样本，其实意义并不大。\n不过还是以其中的一位，刘翔为例，稍微展开说说。\n\n伤病伴随了刘翔的整个职业生涯，最主要两个部位，大腿和跟腱 / 脚跟。其中跟腱 / 脚跟部位的伤堪称是他生涯的“阿基里斯之踵”，因为本身脚跟骨比别人更突出，只要有高强度训练，就一定会出状况，没法根治，只能缓解。\n——可能很多人不知道，刘翔后跟 / 跟腱部位的伤病在 2004 年雅典奥运会前就已经出现，也被确诊会反反复复、困扰其整个职业生涯。\n\n即便如此，刘翔在自己职业生涯依然创造了两次巅峰，且这两次巅峰持续的时间都非常之长——几乎抛开两次严重受伤（都有各自代表性的赛事，2008 北京奥运会和 2012 伦敦奥运会），刘翔都很快恢复到曾经的水准。\n2004 年刘翔雅典夺冠，也带乱了杜库雷的节奏2012 年伦敦奥运会，刘翔跟腱断裂，在第一个栏架意外摔倒，以这样一种未完成的方式结束了自己的最后一场比赛\n刘翔生涯中段大家都很了解了，回顾一下他的起点与终点——\n刘翔 1999 年、不到 16 岁正式跟着孙海平练跨栏，3 年后（2002 年）就创造了 110 米栏世界青年纪录 + 亚洲纪录（13 秒 12），同年釜山亚运会（13 秒 27）摘金。\n——所以从 19 岁开始，刘翔就已经是全世界最顶级的 110 米栏选手。第二年圣但尼田径世锦赛 13 秒 23 摘铜，也是含金量极高的一块奖牌。\n2003 圣但尼世锦赛，20 岁的刘翔 13 秒 23 仅次于特拉梅尔和偶像阿兰约翰逊，拿到含金量极高的铜牌\n刘翔最后一场正式比赛完赛，是 20…",
          "link": "https://daily.zhihu.com/story/9737588",
          "publishedOn": "2021-06-29T23:08:07.000Z",
          "wordCount": null,
          "title": "为什么中国运动员运动寿命短？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737564",
          "author": null,
          "description": "常爸-黄任，传播科学育儿理念，提供优质教育资源。公号：常青藤爸爸\n阅读原文\n\n先提醒一下大家：\n■ 用内疚来控制孩子的父母真的很多，甚至可以说绝大多数中国父母都在孩子身上实践过这一招，只是或轻或重，自己意识得到意识不到了。\n■ 内疚是一种负性情绪，但让孩子内疚并不全然是坏事，反之适合的内疚是一个人道德水平最好的检验官，但是过度内疚就是妥妥的有害情绪。\n接下来，详细说一下什么是“内疚式教育”以及这种教育方式对孩子的影响。\n01内疚，是道德的“晴雨表”\n先来看看什么是内疚？\n它是一个人真的做错了事情，或者想象中做错了事情，因为违背良心而对他人产生的一种惭愧、不安的心情，它是道德情绪中的一种。\n为了不受到道德惩罚，消除内疚感，人们往往会积极努力地做出弥补，比如道歉、关心别人，或者满足别人的愿望等。\n就像一个小孩子推倒了另一个小孩子，看到对方哇哇大哭，这个小孩就会觉得很内疚，进而安慰对方、把对方扶起来。\n\n所以，有适当内疚感，就证明这个人有道德要求，是一个心理健康的人，在这个层面上，内疚可以和“自省”划等号。反之，没有内疚感或内疚感比较低的人，则更可能做出不道德的事情。\n曾经有一个研究显示：\n低内疚感的人更容易撒谎或做出不诚实的行为，比如不买门票就进入电影院、公园等。而高内疚感的人，则更少撒谎或做出不道德的事情，在商务谈判、做出决策时也会表现得更诚实。\n试想，你身边有这样两个人：\nA、诚实友善，关注别人的感受\nB、撒谎投机，只考虑自己的感受\n你会选择和谁做朋友呢？\n毫无疑问，一定是 A 更受欢迎。\n因此，有高内疚感的人，也更容易交到朋友，融入集体，团队合作和协作能力也更强，人生幸福度也更高。\n一般情况下，很多父母认为让一个孩子产生“内疚感”，是为了让他成为一个更好的人。\n比如说爸妈挣钱不容易，让孩子知道勤俭节约；\n说爸妈为了孩子上学付出很多，让孩子知道奋发向上；\n说爸妈工作的辛酸，…",
          "link": "https://daily.zhihu.com/story/9737564",
          "publishedOn": "2021-06-29T23:07:58.000Z",
          "wordCount": null,
          "title": "父母的内疚式教育，对孩子影响有多大？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737574",
          "author": null,
          "description": "ag獭，好奇而无用的獭獭\n阅读原文\n\n回答这个问题之前，先要明确一下，什么是科学技术？中国文化有哪些独到特色？\n科学，是人类认识世界的一种实践方法。英语中的科学 Science，来源于拉丁文中的 Scientia，意思是“知识””学问“，而在中文里，科学又可以理解成“分科的学术研究”。归根结底，科学是我们认识世界的一种方式，但不是唯一的认识方式，随着社会的发展，在不同时代、不同领域，科学的范畴自然也有所不同。\n汉代刘歆编著的《七略》，是中国最古老的藏书目录之一，现代意义上的科学书籍，在七略中，大约属于术数、方技、诸子等略，和今日之学科分类大不相同。（中国大百科全书，图书馆学情报学档案学卷）\n现代意义上的科学，大约形成于文艺复兴后的西欧，此前，古希腊人发展出了公理体系，但没有形成现代科学，中国古人重视实践和记录，也没有形成现代科学。在现代科学形成的过程中，古希腊人和中国古人都贡献出了自己的一份力量，但古人自有其认识世界的方法，也自有其对学术体系、自然世界的分类方式。在不同社会背景之下，每一种分类和认识方式，只要适合，就是合理的。\n与之相似，所谓文化，自然也是不断变化的。清末的相片上，许多人看起来都麻木呆滞、死气沉沉，几十年后的新中国，人们的精神面貌却与之大不相同。不过几十年工夫，孕育中国国民的文化却发生了巨大改变。西汉的中国文化、南宋的中国文化以及 21 世纪的中国文化，显然是不同的。但总有一些藏在深处的文化基因，能够历经时间的筛选，世代流传。这大概也是中华文明能历经数千年而不断的原因所在。\n那么有哪些中国文化，能够历经千年，并对科技发展产生促进作用呢？\n重视教育\n中国是世界第一个以考试作为官僚选拔机制的国家。科举制度的诞生，为国家选拔了大批文化水准过关的可靠官员，促进了阶层流动，打破了世家大族对高层职位的垄断。日积月累，社会上形成了重视教育和学历的文化氛围。大多数中国人相信…",
          "link": "https://daily.zhihu.com/story/9737574",
          "publishedOn": "2021-06-29T23:07:54.000Z",
          "wordCount": null,
          "title": "哪些中国文化对科技发展有促进作用？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737582",
          "author": null,
          "description": "汪靖豪，专心做一个点赞的知乎用户。\n阅读原文\n\n摸着良心说话，以下每款游戏玩个几十小时上百小时都不过分，对于一些特殊类型的游戏上千小时也是很正常的。\n我想最早关注这个问题应该很多都是喜欢打游戏，比如玩玩动视暴雪、腾讯、网易这三家的游戏，但是对 steam 接触不深的玩家，或者说以前玩了些盗版，毕竟现在 steam 上有几万款游戏，从茫茫多的游戏中找到自己所爱还是要花费些许时间的，\n没错我就是那个 steam 萌新，在一群骨灰级单机玩家朋友的安利下带着慢慢成为新司机。\n既然是必买，就推荐几个贴吧&黑盒&NGA&知乎呼声都比较高的游戏，萝卜青菜各有所爱，喜欢玩的人多的游戏你不一定喜欢，但不代表是游戏不好，可能某一天你再去回味回味就会有另一番风味。\n其实大家买东西看哪家公司出的，玩游戏也看是哪个公司开发，哪个公司发行，下面以各大公司为主题安利。比较厉害的公司主要有\nV 社(steam 创立)、ubi(旅游模拟公司)、CDPR(不赚钱的公司)、R 星(永远在新建文件夹)、\nB 社(捡垃圾废土开放世界)、P 社(如何看待 P 社玩家群体)、Capcom(动作天尊冷饭王)、\nSE(游戏是好游戏但公司要不得)、SEGA(街机年代老公司)、KOEI(活在情怀里的公司)、\nEA(美国腾讯)、万代南梦宫(你喜欢的动漫他都能给你做成游戏)、WB(IP 游戏)\n2020 年 3 月 14 日 update 精品篇\n2020 年 4 月 4 日 update 主播学习篇\n为什么想更这个呢，一来是方便大家玩的时候卡关了可以找视频看看，二来是一些游戏真的很难可以看视频攻略来学习，三来我自己也是看视频学习来的，吃水不忘挖井人既然有这么多 hxd 在看就当流量入口推荐给大家，第四就是大家如果没有打主意买可以云一会，再决定买不买\n游戏都买了，为什么还要我花时间玩。什么，还要我废脑袋去学习，你肯定是疯了。\n20…",
          "link": "https://daily.zhihu.com/story/9737582",
          "publishedOn": "2021-06-29T23:07:46.000Z",
          "wordCount": null,
          "title": "Steam 上有哪些必买游戏？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737587",
          "author": null,
          "description": "知乎用户，化妆品配方师；美妆科普人；公众号：凡可美肤实验室\n阅读原文\n\n一、先说结论吧\n题主的两个问题跨度其实都挺大，但是可以肯定的告诉大家，皮肤越黑的人确实的越容易晒黑，尤其是天生黑或者从小皮肤比较偏黑的；皮肤白的通常更容易晒红晒伤。\n至于涂了防晒还会晒黑这个问题，大概率是实际操作方法有问题：例如防晒产品的选择，防晒产品的使用场景，也就是所处的环境紫外线有多强，防晒霜的量有没有涂足够，防晒霜时间长失效后没有及时的补涂，就是操作上的细节都会影响实际使用效果。\n我以前回答的内容里，写过关于防晒品的选用\n真的需要每天涂防晒吗，防晒霜对皮肤有害处吗？\n还有防晒霜指数的问题，量涂得不够，效果会很打折扣的\n防晒霜涂不够量，是没有防晒作用？还是防晒作用比起其标注指数会打折扣？\n二、基因决定了你肤色最白的“天花板”\n我们皮肤的肤色受很多因素的影响，我们先来了解一下你最白的肤色是怎么构成的，也就是你皮肤最白的天花板。\n这点可能大家都知道，都是基因决定的，目前已知超过有 125 种基因可以调节肤色。皮肤黑的人和皮肤白的人在黑色素细胞（也就是黑色素的生产工厂）的数量上并没有太大的区别。但是却造就了形形色色的肤色，就是因为有很多基因以及后天的因素在影响着肤色的组成。\n\n三、皮肤越黑意味着黑色素的“生产能力”更强\n黑色素的合成是非常复杂的反应，从皮肤受到紫外线以及损伤的刺激，启动相应的黑色素合成流产，把黑色素生产出来并逐步转运到皮肤的表面，呈现更深的肤色，中间的反应环节，涉及的信号路径、调控等很复杂。\n不过总的来说，皮肤越黑也就意味着你本身皮肤的黑色素生产和转运的能力更强，而且黑色素的代谢速度更慢。\n\n这一点我自己深有体会，小时候有长时间的暴晒史，肤色天生也比较黑。虽然自己很长时间在研究美白淡斑化妆品，在防晒方面也注意的很到位，还经常使用美白产品。不过一旦出去无防护地晒一圈回来，不是很快就黑好几个度，而且后期需要很长时间的维护才能逐渐的白下来。\n有些朋友是肤色天生比较白的，尽管大家的生活环境和防晒习惯差不多。一起出去玩一圈，接受相近的紫外线暴露，晒一圈回来后，皮肤发红几天，不过很快又会白下来。\n四、哪些坑可能导致涂了防晒还会晒黑？\n防晒，对于皮肤保养，抗衰老和美白都是很重要的措施，要做好防晒需要注意的细节还真不少。但是防晒没注意好的话，足够可以让你养了一个秋冬季节才白下来的肤色，晒半天时间可以毁于一旦。\n为什么涂了防晒还会晒黑？不排除有很多极端案例，我认为原因有以下方面：\n第一，防晒指数选的不够。这个非常好理解，例如大中午的非常强的紫外线，去沙滩游玩什么的，却选个 spf35 的防晒，不黑才怪。\n第二，防晒指数选择没问题，但是没涂够。防晒产品的数值是在标准用量（2.00±0.05）mg/ 平方厘米的情况下测试出来的，如果你的用量低于标准用量，也就是没用够，那可能是涂了个寂寞。\n第三，可能是错误的使用场景。例如去海边游玩，却选择了抗水性非常差的防晒产品。大多数的防晒都是油包水或者硅油包水的体系，肤感会相对油腻，水包油的防晒优点是清爽，但是抗水性很差。天气热出汗很多，或者漂流玩水等等都会冲掉水包油的防晒，这种场景当然也会晒黑。\n第四，没有及时的补涂。这种场景其实不多，假如你是在户外长时间（4 小时以上）的暴露，才需要多次的涂抹防晒产品。化学防晒剂吸收紫外线会不停损耗，越来越少甚至失效；在玩耍过程中会不停的碰擦，也会蹭掉皮肤的防晒成分。所以长时间在户外的话，需要注意及时的补涂。\n最后要补充的一点是，防晒不能仅仅指望防晒霜，有时候加一件品质不错的防晒衣，帽子、墨镜、遮阳伞等，或者能够尽量避开在强紫外线时候外出，往往能够实现更好的防晒效果。\n要知道，紫外线带来的不仅仅是肤色变黑，也会加速皮肤的衰老，以及引发起来更多的皮肤问题。皮肤受到紫外线的刺激，合成出更多的黑色素，其实是人体免疫系统自我保护的一种行为。我觉得晒黑背后的问题还更值得引起注意的。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737587",
          "publishedOn": "2021-06-29T23:07:40.000Z",
          "wordCount": null,
          "title": "为什么涂了防晒还会晒黑？「皮肤越黑越容易晒黑」是真的吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737597",
          "author": null,
          "description": "第一次带女朋友回家让她做饭结果她大发雷霆，我真错了吗？\n\n粥六，只接玫瑰的梗\n阅读原文\n\n这是厨子应聘？交面试作品？\n下面是我的建议：\n高情商：考试之前你不一定要划重点，但请务必给考生自主报名的权利。\n低情商：在你通知她去你家做饭挣表现分之前，你先问问她要不要挣这个分，愿不愿意去你家做饭。\n阅读原文\n\n恋爱时给女朋友钱让她给我代买了70元的物品，分手后物品还没给我，我能够提起民事诉讼吗？\n\n方舟，触不到的总是最好的，如风，如你。wechat：law_fz\n阅读原文\n\n可以的，但是得先交诉讼费 50……\n\n \n\n\n阅读原文\n\n假如在古代你当御厨给皇帝泡一碗方便面会发生什么？\n\n阿撒托斯乐队总指，从来没有什么天经地义，只有习以为常！\n阅读原文\n\n面还好说\n估计你放调料包的时候，会被大内侍卫一刀捅死。\n毕竟太像下毒了。\n \n阅读原文\n\n你对空姐提出过最奇怪的要求是什么?\n\n背离，碰到傻子会预防性拉黑的。\n阅读原文\n\n并不是对空姐提出的奇奇怪怪的要求，就是坐飞机的一个比较好玩的事。\n有一次出差，头一天晚上打了半宿的麻将，第二天感觉要升仙了。\n上飞机的时候，空姐可能看我一脸迷茫觉得我找不到自己的位置，于是——\n“先生您好，请问您是哪个座？”\n我可能也是没睡醒，愣了一下，“射手座……？”\n我明显看到空姐脸部肌肉不自然的抽动了一下……\n阅读原文\n\n为什么平常穿汉服就会让路人觉得很奇怪？\n\n痴情蛊灬DOM，一个发言都要谨小慎微的平台，退了\n阅读原文\n\n你穿的汉服，放古代出门路人也看你\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737597",
          "publishedOn": "2021-06-29T23:07:34.000Z",
          "wordCount": null,
          "title": "瞎扯 · 如何正确地吐槽",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737540",
          "author": null,
          "description": "菲利普医生，野生外科医生/美短饲养者\n阅读原文\n\n请务必珍惜那些整齐切面在一定角度下呈现金属光泽的肉类。\n因为这说明肉是超级新鲜的（无论是生肉还是熟肉），而不是加了什么不可告人的添加剂。\n这就得从肌肉结构说起了。\n脊椎动物的肌肉大多具有典型的肌节结构：\n\n最上方圆柱形的就是一根肌纤维，肌肉就是由无数个这样的纤维构成的，众多肌纤维的收缩在宏观上就体现为肌肉的收缩。当我们进一步放大肌纤维就会发现它呈现一节一节的典型构造，这个结构就叫肌节。\n这种肌节是由粗细两种肌丝构成的，当肌肉细胞中的钙离子水平发生改变时，在 ATP 提供的能量驱动下，肌肉中的肌动蛋白结构发生变化，从而拉动肌丝滑行，肌肉就动起来了。\n这一部分肌肉收缩的原理与本问题关联度不大，感兴趣的朋友欢迎移步：\n人的肌肉力量可以有多大？\n好的，说回肌节这个微观结构。当一把锋利的刀以某个角度（最好是几乎垂直于肌纤维走向）切割肌纤维的时候，那么断面上就会留下很多被切开的肌节。这些肌节形成阶梯状结构，就像：\n\n当可见光照射到这种平面上时，不同波长的可见光照射在这个平面上导致出射角发生改变，所以不同颜色的可见光就会被分开[1]：\n\n也就无怪乎我们在整齐的肌肉切面上看到彩虹色（muscle Iridescence）。我去年钓的一条鱼被我带回家的时候还活着，所以新鲜度非常高，我专门垂直于肌肉的长轴垂直线用快刀切开，果然发现了彩虹色。但是因为拍摄器材和光源的因素，导致成片中彩虹色不明显，倒是不同区域呈现出明显的粉红色金属光泽：\n\n如果肉不够新鲜，在腐败菌和细胞自溶酶的作用下，肌节结构可能会出现溶解，这样再切下去就很难看到彩虹光泽了。\n这种会引起光的干涉的结构被称为光栅\n自然界中还有很多此类现象，比如蝴蝶翅膀上闪耀着金属光泽的颜色也大多来自于细小鳞片对太阳光的干涉作用，而不是某种色素[2]。\n\n另一个例子就是翠鸟，它们背部的蓝色金属光泽羽毛也是得益于特殊的羽毛微观结构，对光造成了干涉作用，让蓝光进入我们的眼睛。\n\n然而这种造物主不大不小的奇迹却给翠鸟招来了灭顶之灾——点翠。一只凤冠要用上百只翠鸟的羽毛才能制成。\n圣旨博物馆藏清代凤冠\n\n\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737540",
          "publishedOn": "2021-06-28T23:08:00.000Z",
          "wordCount": null,
          "title": "熟牛肉切片后呈彩虹色是什么原因？有毒吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737526",
          "author": null,
          "description": "地平线HOA，简单、有趣、认真的科普。『公众号同名』\n阅读原文\n\n在深海，很少有生物的长相可以被人接受。\n吞噬鳗，就是典型。\n\n在深海，很少有生物完全没有发光器官。\n吞噬鳗，就是…\n诶？\n\n据说造物主设计吞噬鳗的时候多喝了几杯，给它整得过于特立独行了。\n事后一看，哎呀这个后悔呀！\n于是，吞噬鳗尾巴的最尖尖上，就多了一个“附赠的”发光器。\n\n它要“打个哈欠”，就像吹起来个乌漆嘛黑的气球一样...\n毫不夸张地说，吞噬鳗整个身体几乎只有两个部分：一张大嘴，一根尾巴。\n\n吞噬鳗的上半身就接在后面那根 1 米多长“管子”上。\n在俯视角下，吞噬鳗仿佛一枚梳了长辫子的贝壳。\n\n水下 2000 米，能在这个深度活下来的个个都是狠人……额，狠鱼。\n不说别的，光食物就是个大问题。\n说出来你可能不信，吞噬鳗长了个血盆大口，却主要小生物为食，比如浮游性甲壳类生物。偶尔运气好，也能吃到小鱼或一些无脊椎动物。\n血盆大口，难道白长了？\n\n当然不会，“吞噬”可不是白叫的！\n要说胃口，它甚至能吞下比自身更大的生物——相应的，它还配了一个很有“弹性”的胃，确保自己不会被吞下的东西给撑爆。\n但是，吞噬鳗的牙齿其实很小：这表示它们没法以大型动物为主食。\n\n事实上，吞噬鳗的大嘴更像一个“渔网”——想在深海活下去可不兴挑食，只要是能吞下的，统统不放过。\n对吞噬鳗来说，小鱼小虾显然是更好的选择。\n\n吞噬鳗游泳的技巧只能用惨不忍睹来形容...它的胸鳍小到几乎不存在。\n因此，吞噬鳗平时只会直直地立在深水中，有东西靠近就把下颌骨张开，水流产生的吸力就会把猎物吸进去。\n\n最后，如果你想知道，\n没有人吃过它，它也不能做宠物（doge\n拓展阅读：\n1.吞噬鳗，\nhttp://www.seasky.org/deep-sea/gulper-eel.html\n2.Deep-sea gulper eel，http://bioweb.uwlax.edu/bio203/s2007/rattray_mari/3.Gulper eels look like real-life sea monsters (and here’s why you should love them)，https://oceanconservancy.org/blog/2019/12/09/gulper-eels/\n©版权所有，转载请后台留言申请\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737526",
          "publishedOn": "2021-06-28T23:07:56.000Z",
          "wordCount": null,
          "title": "有哪些看起来不像地球生物，但又确实生在地球的动物？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737550",
          "author": null,
          "description": "空白白白白，可以去公众号：空白女侠 认识我 不接商业广告&amp;付费咨询勿扰\n阅读原文\n\n这个问题很有趣，看到大家都在“教育”这位刚入职的校招生：“没人教你，就自学。不要奢望领导教你，你还处于学生思维。”这些话都没有错，但这位校招生的问题刚好反映了一个社会职场问题，一个深层的，未被我们思考过的问题。那就是我们这一代人正在遗失一种职场文化：传承。\n现在的就业市场越来越激烈，不管是刚刚踏出校园的职场小白，还是已经工作多年职场老鸟，很多人内心都产生各种不安、浮躁、甚至焦虑。已经找不到一块心灵的净土。表面原因是商业社会竞争激烈，导致企业招聘的时候“只拣现成的”、招立马创造价值的人员。而”打工人“也有一种感受，企业只想压榨自己，却没有想过好好培养自己。这种不对等的预期效果，让企业和工作者产生了严重隔阂。\n以上我让认为表面原因，我认为更深层的思考其实是 .......（卖个关子，我花了一周时间专门思考这个问题才动笔，欢迎大家耐心阅读）\n去年年底述职，我团队内一名 19 年入职的校招生在述职材料里写了这样一段话：“……在这半年的工作里，我努力让自己成为一名合格的‘工具人’……”。结合述职材料的上下文，他可能只是想用一种诙谐的语言来表达自己努力工作的态度。然而即便如此，“工具人”三个字还是深深刺动了我的神经，一种莫名的“悲伤”开始旋绕在我的脑海之中。\n我是从外企开启自己职业生涯的。还记得自己刚刚加入公司时，就深深感受到公司对企业文化的重视。在为期一年的时间里，我参加了大量针对校招生的培训，学习这家公司的历史、文化和价值观。\n其余时间，公司为我分配了一名有着 10+ 年工作经验的“纯红”经理。所谓“纯红”（pure red ）是这家外企对于校招生（ campus hire）的昵称，也就是说这名经理自毕业后一直在这家公司工作了 10 多年。我一直跟随自己的 Mentor 工作、出差，就连平时…",
          "link": "https://daily.zhihu.com/story/9737550",
          "publishedOn": "2021-06-28T23:07:47.000Z",
          "wordCount": null,
          "title": "进入大厂之后，领导不怎么愿意带我，只希望我立马创造价值，该怎么办？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737560",
          "author": null,
          "description": "禾果妈妈暖心说，英国曼大硕士|原外企MKT|90后二胎宝妈|育儿自媒体\n阅读原文\n\n 2021 年全国父亲执业资格证考试\n 笔试部分\n姓名： 考号：\n一、判断题\n1. 你是自愿想要并且喜欢孩子的吗？\n是 否\n2. 陪产假期间你会悉心照顾老婆吗？\n是 否\n3. 你的工资水平目前能满足全家开销吗？\n是 否\n4. 你是否支持老婆进行“无痛分娩“？\n是 否\n5. 你是否会干预老婆对宝宝的喂养方式？\n是 否\n6. 你能每天抽出至少 1 小时陪伴孩子吗？\n是 否\n7. 你和老婆就带娃、做家务方面有明确分工吗？\n是 否\n8. 老婆和亲妈之间因为育儿问题产生矛盾你会维护老婆的立场吗？\n是 否\n9. 有娃后和老婆之间有难以调和的矛盾时，你会寻求专业心理机构的帮助吗？\n是 否\n10. 你是否为家庭做了理财计划（保险、投资、储蓄等）？\n是 否\n二、单项选择题\n1. 以下哪一项为老婆孕期非常规体检项目？\nA. 超声波检查 B. 糖耐 C. 唐筛 D. 羊水穿刺\n2. 以下哪种情况不是老婆实施剖宫产的绝对指标？\nA. 骨盆畸形 B. 子宫破裂\nC. 绒毛膜羊膜炎 D. 脐绕颈\n3. 以下哪一项为老婆哺乳期堵奶时的正确做法？\nA. 停止哺乳 B. 马上热敷\nC. 大力按摩乳房 D. 吃布洛芬镇痛\n4. 针对有母乳性黄疸的宝宝，以下哪一项为正确做法？\nA. 长时间晒太阳褪黄 B. 停止接种疫苗\nC. 喂葡萄糖水 D. 坚持母乳喂养\n5. 以下哪种物品不可以给 1 岁以下宝宝使用？\nA. 安抚奶嘴 B. 腰凳\nC. 糖皮质激素软膏 D. 定型枕\n6. 关于婴幼儿早期教育，以下哪种说法是错误的？\nA. 0-3 岁是宝宝大脑发育黄金期\nB. 2 岁左右是宝宝的秩序敏感期\nC. 幼儿以自我为中心、不愿意分享是正常的\nD. 阅读对于 0-3 岁宝宝来说不重要\n7. 以下哪种行为对于孩子来说是不安全的？\nA. 0-…",
          "link": "https://daily.zhihu.com/story/9737560",
          "publishedOn": "2021-06-28T23:07:42.000Z",
          "wordCount": null,
          "title": "如果为人父母也需要考试，应该有哪些科目？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737563",
          "author": null,
          "description": "如何激怒一位文学爱好者？\n\n秋起舜华，怀抱炽热的梦想，赴拥温柔的灼烧。\n阅读原文\n\n「你那么喜欢文学为啥作文分那么低。」\n阅读原文\n\n如何以「驸马，公主已被杖毙，她身上掉下一块玉，是您找了十年的那块」为开头，写一篇小说？\n\n像少年拉菲迟，万茜给我点过赞\n阅读原文\n\n「驸马，公主已被杖毙，她身上掉下一块玉，是您找了十年的那块」\n驸马捡起来一看，喊了一句\n「打这么半天，就打出了个这装备」\n驸马踏上了前往奎尔丹纳斯岛的路上。\n阅读原文\n\n为什么老球迷普遍认为，20 多年前的足球比现在好看？\n\n卞卡，一个保守的人，一个怕麻烦的人。\n阅读原文\n\n因为当时没有别的东西看\n阅读原文\n\n第一次养猫闹过笑话吗？\n\n般遮丽妈妈\n阅读原文\n\n猫嘴巴上长了黑斑，连忙送到医院，结果医生说她三花的花色恰好长到了嘴巴上\n阅读原文\n\n养一只很丑的布偶猫是种什么样的体验？\n\n玩味的口红\n阅读原文\n\n我觉得我最有发言权！你们怕是对丑有什么误解\n\n丑出天际！当初被猫贩子骗了……\n\n这还是只猫迈？\n\n\n\n\n绝育后\n\n\n\n\n\n\n\n\n\n\n\n各种躺尸，你说丑就算了脾气还不好，摸也不能摸！观赏吗？ \n\n\n\n\n\n躺！！！\nhttps://www.zhihu.com/video/1174080062671548416\n我妈心血来潮给它买了件衣，穿上走路都不会了………笑死我\n\n\n\n\n\n\n\n\n\n\n\n\n今天才看到大家的评论我也要被笑死了哈哈哈哈哈哈……丑是真的…不过我都看习惯了哈…\nhttps://www.zhihu.com/video/1174822273763315712\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2020 更新 肥成猪了\n\n\n\n\n丑家伙\n更新……真丑长胖了\nhttps://www.zhihu.com/video/1190411482624647168\n2020 祝大家新年快乐哦\n我妈发给我的视频，和猪一样了，真想快点回家揉揉它嘻嘻\nhttps://www.zhihu.com/video/1204081551988043776\n更新2020年3月\n\n\n\n\n\n每天在阳台摸爬滚打脏脏的～\n\n\n\n2021打卡\n\n还是很丑\n\n\n\n\n\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737563",
          "publishedOn": "2021-06-28T23:07:33.000Z",
          "wordCount": null,
          "title": "瞎扯 · 如何正确地吐槽",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737444",
          "author": null,
          "description": "ASICS亚瑟士，Sound Mind, Sound Body\n阅读原文\n\n朝九晚五的上班族，能坚持晨跑、且不影响生活工作，几乎个个都是“时间管理大师”。他们确实有非常令人羡慕的自律能力和毅力。\n想把跑步安排在工作日的早晨——\n\n如何规划合理的工作日晨跑\n工作日晨跑常见的错误\n让晨跑更加「省时」的小贴士\n\n\n如何规划合理的工作日晨跑\n不管跑步的目的是什么，最适合工作日晨跑，都是低强度有氧慢跑 / 恢复跑。\n跑步的时间因人而异，从 15-60 分钟不等——虽然有氧慢跑是个相对讲究运动时长的跑步类别，即便是以提升马拉松成绩为目标的系统训练中，30-40 分钟的慢跑对有氧能力的巩固和提升依然是有帮助的。而对以健身锻炼和减脂为目标的人来说，20-30 分钟的有氧跑依然是很值得推崇的「日常项目」。\n运动前后的热身是必不可少的环节，哪怕只是强度很低的有氧慢跑。工作日的晨跑，热身可选择两种形式：\n\n在慢跑 3-10 分钟后，进行简单的放松和拉伸，而后开始匀速的慢跑；\n将开始的 3-10 分钟作为热身，在这个时段内让心率逐步从静息提升至有氧心率区间，而后维持。\n\n如果住在高层，也可选择楼梯、而非电梯下楼，来作为身体肌肉关节和心肺的初步“唤醒”。\n完成慢跑后，同样需要安排 3-10 分钟的冷身，逐渐让身体回到放松状态，并进行静态拉伸（3-5 个动作，每个动作持续 15-30 秒，循环 2-3 次）。\n晨跑强度需要的完整拉伸动作一般在 5-10 分钟时间。\n——这样算下来，一次完整且合理的工作日晨跑，需要 25-70 分钟不等。\n具体时长、距离和强度因人而异，但其中的热身、有氧慢跑、冷身 / 拉伸等关键词，都不可忽略。\n\n以有氧慢跑为强度的晨跑，并不需要在运动前的饮食中，对能量摄入有过高的要求。不过迄今很多关于晨跑的困扰里，依然常见低血糖、过饱、运动时肠胃不适……等问题。\n晨跑前饮食的几个要点…",
          "link": "https://daily.zhihu.com/story/9737444",
          "publishedOn": "2021-06-27T23:07:11.000Z",
          "wordCount": null,
          "title": "那些早上起来做饭、跑步、冲澡后去上班的人都是几点起床、几点上班的？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737496",
          "author": null,
          "description": "混乱博物馆，一档满足百科知识好奇心的短视频节目，都是些你不知道的。\n阅读原文\n\n让男人拥有乳头，是我们进化上的策略。\n\n这个问题最直接的答案是，人类拥有以 Y 染色体为中心的性别决定机制：我们都知道人有两条性染色体，女性带有两条 X 染色体，男性带有一条 X 染色体和一条 Y 染色体。经过减数分裂和受精作用，分别来自双亲的两条性染色体也将继续决定胎儿的性别。\n但是我们要明白，染色体本身说明不了什么问题，关键在于它们携带着的基因——Y 染色体的短臂上有一个 SRY 基因，就是我们唯一的性别决定基因，只要表达了这个基因，胚胎就会发育成雄性，否则就会发育成雌性。\n\n但是这个基因要到胚胎发育的第 6 到 8 周才从性腺开始逐渐表达，胚胎早已按照雌性的构造发育出了乳头和乳腺，再也无法撤销了。所以不妨说，在哺乳动物的 XY 性别决定机制里，雌性是默认性别，而 SRY 基因的功能就是将一部分雌性胚胎逆转成雄性。\n因此不难想象，由于相同的性别决定机制，所有后兽亚纲的雄性哺乳动物实际上都有乳头和乳腺。\n但是在其它动物身上，我们就会发现五花八门各式各样的性别决定机制。比如鸟类就与我们刚好相反，雄性有两条 Z 染色体，雌性有一条 Z 染色体和一条 W 染色体，那条 W 染色体上携带着决定雌性的 DMRT1 基因，所以鸟类的默认性别就是雄性。\n\n而鸭嘴兽有着介于两者之间的性别决定机制，它们有 10 条性染色体，其中雌性有 5 对 X 染色体，雄性有 5 条 X 染色体和 5 条 Y 染色体，但其中的某些 X 染色体与鸟类的 W 染色体关系很近，这给我们重建进化历程提供了重要线索。\n性染色体机制也以不同的方式出现在谱系更古老的脊椎动物身上，爬行动物更普遍地用温度决定性别，它们在某个温度范围之内孵出雄性，其余就都是雌性，只有蛇完全采 ZW 性染色体机制，这是一条性别分化越来越精确的进化之路。\n\n如果说鸭嘴兽和爬行动物揭示了性染色体的过去，节肢动物就可能暗示了性染色体的未来。比如大部分昆虫都有 XY 性染色体，果蝇是其中研究最充分的。但我们发现果蝇没有专门的性别基因，而是用 X 染色体相对于常染色体的倍数决定性别，1 倍就是雌性，1 半就是雄性，而 Y 染色体浓缩失活，没什么作用。甚至某些果蝇干脆就没有 Y 染色体，雌性有两条 X 染色体，雄性有一条 X 染色体，称为 X0 染色体机制——这在其它昆虫身上更加普遍，比如蜻蜓、蝗虫、螳螂、白蚁。\n我们对此有一个浅显的推测：有性生殖的一大意义，就是在减数分裂的联会过程中，同源染色体可以交换一部分片段，这提供了修复有害突变的宝贵机会。但是在 XY 染色体之中，那条 Y 染色体与 X 染色体差异太大，失去了这样的修复机会，因此在世代积累中变得脆弱，最终完全丢失了，它的功能则由其它染色体或者其它机制接替。\n由于昆虫繁殖更快，所以先我们一步实现了 X0 机制，某些繁殖迅速的啮齿动物也已经达到这种境地，比如琉球特产的几种裔属就已经没有了 Y 染色体——或许经过漫长的岁月，其它哺乳动物也会达到这一步吧。\n\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737496",
          "publishedOn": "2021-06-27T23:07:04.000Z",
          "wordCount": null,
          "title": "男生的胸部有什么作用？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737508",
          "author": null,
          "description": "作者无敌AA，KSP官方简中志愿者，ACGNV，IT也行，航空航天相关杂学\n阅读原文\n\n谢邀。\n航天史是怎么开始的！这个问题问得好，我们得倒转一下时间，去拜访三位伟大的先人。\n以下解答基于真正的“航天”概念出现，也就是在短时间内不再需要落回地面的情况，不包括连来源都很可疑的万户飞天这样的故事。部分引用资料来自 Wikipedia。\n\n牛顿的地球大炮\n\n说到第一个阐述扔出去的物体能不落回地面或者落到什么地方的人，那当然就是我们著名的艾萨克·牛顿爵士了。谁如果不认识下面这个人请自行去百度或者去翻初中物理书。\n\n虽然在此之前就有不少人阐述过天体的运动，但是牛顿是第一个用引力的观点去解释它们的人——当然了万有引力这玩意都是这位先生因为看到苹果落地发现的，之前哪里还来的先人呢。\n牛顿在 1686 年写成了足以让他名垂青史的《自然哲学的数学原理》一书，在书中的第三卷“论宇宙的系统”（英语：On the system of the world），他提出了这样的一个思想实验：\n设想有一门加农炮架在一座非常高的山的山顶上。如果在没有任何引力和空气阻力条件下，炮弹应该沿着发射的方向以一条直线的轨迹远离地球。如果有一个吸引力存在的话，炮弹会沿着一条不同的轨道运动，轨道的形状取决于炮弹的初始速度。如果速度低的话，炮弹就会直接掉在地球上。如下图所示的运行轨迹的初始水平速度分别在 0 到 7000 米 / 秒之间。\n0m/s 初速度6000m/s 初速度\n如果速度达到了所在海拔的第一宇宙速度，即约 7300 米 / 秒，炮弹将会沿着一个固定的环形轨道环绕地球，就像月球一样。（图片过大无法上传，下同）\n如果速度大于轨道速度，但小于第二宇宙速度的话，炮弹会沿着一个椭圆轨道环绕地球。如果速度非常快，炮弹将会沿着一个抛物线（当速度恰好为第二宇宙速度）或者双曲线（当速度大于第二宇宙速度）轨道逃离地球。\n牛顿大炮…",
          "link": "https://daily.zhihu.com/story/9737508",
          "publishedOn": "2021-06-27T23:06:57.000Z",
          "wordCount": null,
          "title": "人类航天史是怎么开始的？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737501",
          "author": null,
          "description": "娃娃鱼\n阅读原文\n\n二败高俅与鄱阳湖大战\n“二败高俅”火烧战船的故事，并非出自《水浒传》编写者的凭空想像，而是借鉴了元末明初一场真实的大型水战。\n相隔两百年的两次水战\n侯会先生在《从“山贼”到“水寇”：水浒传的前世今生》中，曾经全面地对比了水浒故事，与南宋初年钟相、杨幺起义的相同之处，认为是借宋江之名，写钟、杨之实。\n在书中，侯先生特别指出，《水浒传》第十九回晁盖、三阮在蓼儿洼大败官军，和第七十九、八十回三败高俅中的几次水战，都借鉴了杨幺起义中的阳武口之战[1]（南宋绍兴三年，1133 年）。\n\n但是，二败高俅时，吴用使用了火攻战术，却与阳武口大战有明显不同，对此，侯会先生没有论及，只是笼统地提到两处：\n\n小说中公孙胜祭风助火，是另从“三国”中借来的情节；\n高俅手下的两员水军将领刘梦龙、牛邦喜被李俊、张横捉住后，直接杀死的情节，与阳武口大捷中，朝廷的水军正副统帅崔曾、吴全皆死，极为相似。\n\n事实上，二败高俅一战，借鉴的不是南宋初年的钟、杨起义，而是 230 年后，元末明初的另一场水上大战：\n1363 年，陈友谅与朱元璋的鄱阳湖大战\n\n历史上的鄱阳湖之战\n这一战实在太有名了，关于它的评价是：\n鄱阳湖大战是中国历史上继赤壁之战后的又一个以少胜多的典型战例。\n这场战役有几个关键词：\n大船连锁、小船火攻、最终以弱胜强\n《明史》中对这一战的记载如下：\n友谅集巨舰，连锁为阵，太祖兵不能仰攻，连战三日，几殆。\n已，东北风起，乃纵火焚友谅舟，其弟友仁等皆烧死。\n1363 年的七月，陈友谅带领号称六十万的军队，与朱元璋在鄱阳湖的康郎山相遇。此时，陈军战舰巨大，气势非凡：\n友谅兵号六十万，联巨舟为阵，楼橹高十余丈，绵亘数十里，旌旗戈盾，望之如山。\n这些巨大的楼船涂着红色的漆，高三层，楼上楼下说话声音不相闻，橹箱都用铁裹住：\n楼船数百艘，皆高数丈，饰以丹漆，每船三重，置走马棚，上下人语声不相闻，舻箱皆裹以铁。\n而朱元璋的船太小，无法仰攻，兵力也差太多，接连三天都吃了败仗。\n图片来自网络\n这时，部将郭兴建议用“火攻”：\n陈友谅连巨舰以进，我师屡却，兴献计以火攻之。\n朱元璋采纳了这个建议。\n当天傍晚，恰好刮起了东北风，于是朱军一方派出七艘小船，装载火药柴薪，顺风放火，火势迅速蔓延，整个湖面都烧得通红：\n会日晡，大风起东北，乃命敢死士操七舟，实火药芦苇中，纵火焚友谅舟。风烈火炽，烟焰涨天，湖水尽赤。\n陈军一时大乱，陈友谅的兄弟陈友仁也战死。\n友谅兵大乱，诸将鼓噪乘之，斩首二千余级，焚溺死者无算，友谅气夺。\n《明史》后来总结这次胜利说：\n是战也，太祖舟虽小，然轻驶，友谅军俱艨艟巨舰，不利进退，以是败。\n（以上引文，均出自《明史》）\n\n与水浒故事的对比\n《水浒传》第七十九回《刘唐放火烧战船 宋江两败高太尉》中写到“火攻”的情景：\n刘梦龙急教棹船时，只见芦苇丛中，藕花深处，小港狭汊，都棹出小船来，钻入大船队里，鼓声响处，一齐点着火把。\n原来这小船上，都是吴用主意授计与刘唐，尽使水军头领，装载芦苇干柴硫黄焰硝，杂以油薪。霎时间大火竟起，烈焰飞天，四分五落，都穿在大船内，前后官船，一齐烧着。\n以小船穿梭在大船中间放火，是鄱阳湖之战的特点，是以小胜大的成功案例。\n而高俅这边，在船只上用板铺、用铁环锁定的做法，也是陈友谅军队的实际情况：\n（高俅）便传号令，教把船都放入阔港，每三只一排钉住，上用板铺，船尾用铁环锁定；尽数拨步军上船，其余马军，近水护送船只。\n\n这么做其实是有好处的。\n高大的楼船连缀起来，非常稳固，可以运送大量步兵甚至马军，同时也对小战船形成了大山压顶的气势。\n鄱阳湖一战中，朱元璋前几天的失败就是证明。\n当然，有利则必有弊，缺点就是容易被火攻。\n不过，火攻也需要条件，那就是风向。\n鄱阳湖之战中，傍晚时分突然刮起的东北风帮了朱元璋的大忙，而在《水浒传》中，则直接由大法师公孙胜施法祭风，想往哪里刮，就往哪里刮，取胜容易多了。\n小结：\n《水浒传》的成书时间，目前有两个说法，一是元末明初，洪武初年；二是明嘉靖年间，1533 年左右。\n关于编著者施耐庵的生平，流传较广的看法，是他曾担任过张士诚的谋士。《施耐庵墓志》上说他：“生于元贞丙申岁……殁于明洪武庚戌岁”，也就是 1296 年 -1370 年，享年 74 岁，是陈友谅、朱元璋的同时代人。\n不过，无论是哪一种说法，《水浒》的编著者对于大明开国皇帝用火攻的方式，以小船胜连锁大船，取得鄱阳湖水战决定性胜利的辉煌战绩肯定都了然于心，拿来作为写作素材自然也很顺手。\n如果你问，陈友谅知道赤壁之战的事吗？肯定是知道的。\n那他为什么还会把船钉起来呢？\n因为历史有时候就是会一再重演。\n2021.6.23\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737501",
          "publishedOn": "2021-06-27T23:06:50.000Z",
          "wordCount": null,
          "title": "水浒传中，高俅为何将大小船只钉住，铺板相连，难道他不知道火烧赤壁？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737515",
          "author": null,
          "description": "菜妈和钱爸，复旦大学营养学硕士，丁香妈妈签约作者，三年抱俩高知妈妈！\n阅读原文\n\n记得有句网评曾说：“一想到为人父母不经过考试就可以上岗，真的是太可怕了。”近年来国内外一些虐待儿童的事件频发，而很多虐童案件的施暴者就是孩子的亲生父母。\n本应该是孩子最亲近的人却给孩子带来了最大的伤害，而这种伤害不仅仅是肉体上的，更是伴随着孩子一生的成长，难以抚平。为人父母是一件看似简单而自然的事，但是成为合格的父母，并不容易，需要学习更需要在养育孩子的过程中不断和孩子一同成长。\n长城上面合个照\n育儿知识\n让新手爸妈崩溃，手足无措的，一定是娃的各种状况。夜醒、哭闹、生病……如果在娃出生前，能够系统的学习育儿知识，那么在孩子出生后就会轻松应很多，也会少走弯路，创造和谐的家庭氛围。\n比如，娃又哭了，是不是饿了？娃总醒，是不是母乳不够没吃饱？总觉得孩子的一举一动都是没吃饱，一哭就喂奶。其实很多小月零宝宝存在胀气问题，才会哭闹，如果一直喂奶，会造成更严重的胀气，这时候给宝宝做一下排气操，飞机抱，就会缓解很多。\n排气操\n这一点都不是危言耸听，因为无法安抚宝宝，妈妈一度自责抑郁，爸爸无所适从，加上婆婆妈妈各种错误的指导，可能会陷入一个恶性循环的怪圈。所以多学习科学育儿知识，对孩子进行健康正确的喂养护理，这是为人父母需要必修的第一课，也是至关重要的一课。对于孩子的健康长大，家庭的关系，还有产后妈妈的情绪恢复都是十分必要的。\n德育知识\n育儿先育己，那么为人父母一定要有良好的品德，担当起为人父母的职责，给孩子树立起正确的学习生活习惯。很多虐童事件的缘由都很很简单，父母因为生活压力，情绪失控，所以把心中怒火发在孩子身上。因为不想负责，只想自己快活，把孩子仍在一边不管不顾，造成孩子各种伤害甚至是死亡。\n比如，孩子出生后就丢给老人带，不管不问，周末偶尔来吃个饭就走。还像没结婚之前那般自由。在小区楼下散步，经常会听到一…",
          "link": "https://daily.zhihu.com/story/9737515",
          "publishedOn": "2021-06-27T23:06:42.000Z",
          "wordCount": null,
          "title": "如果为人父母也需要考试，应该有哪些科目？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737524",
          "author": null,
          "description": "哪个瞬间你觉得自己很蠢？\n\n悟空，已多年不走路，靠丁丁曲伸前行，远看像一豆虫…\n阅读原文\n\n“老师，你忘了布置作业！”\n——来自诺基亚 560 客户端，北京市植物人医疗保障中心二楼重症监护室\n舌头打字不易，请您多一点关爱。\n阅读原文\n\n有没有人装逼正好撞到你擅长的领域上的？\n\nV-Hohenheim，交通工程\n阅读原文\n\n某次春节在家参加一个亲朋聚会，当时到晚了，就听见有个号称来自北京的专家（后面了解是长辈朋友）在解读近期刚出台的某个交通领域很火的政策文件。说到某个点的时候，专家分析了很多说国家应该是怎么怎么考虑的，下一步可能是什么意思。我顺口接了一局，应该不是吧。专家立马开始说教，意思说自己在行业内地位多高，多少多少朋友，年轻人不要乱说话...然后我弱弱的回了一句，这文件我起草的，当时确实没这么考虑....场面一度无比尴尬。\n阅读原文\n\n世界首款 AI 仿生猫 MarsCat 通过解析能做出类似真猫的动作，技术含量如何？你会选择仿生猫吗？\n\n财哥家铲屎官，9只猫的铲屎官\n阅读原文\n\n我觉得可以买一只回家逗猫。\n阅读原文\n\n有哪些让人眼前一亮的「老段子翻新」？\n\n孙凯三，在任何话题下均没有回答经验\n阅读原文\n\n在某快餐店正点餐呢，一大姐窜到我前面，就像没排过队一样对着服务员喊：两个红豆派，快点，我赶时间！\n服务员提醒道：不好意思，是这位先生先来的，请您排队！\n这位大姐很不情愿的排在了我后面。\n我怒从心中起，恶向胆边生，大声问了一句：红豆派还有几个？\n服务员：九十五个。\n我转过头：\n听见没有，急什么？\n\n\n\n阅读原文\n\n法学专业都有哪些梗？\n\n匿名用户\n阅读原文\n\n北大某教授，外号是中国民法。原因很简单，他爸是中国民法之父。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737524",
          "publishedOn": "2021-06-27T23:06:39.000Z",
          "wordCount": null,
          "title": "瞎扯 · 如何正确地吐槽",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737481",
          "author": null,
          "description": "深刻如此，二级心理咨询师，《非暴力沟通两性篇》《非暴力沟通情绪篇》译者\n阅读原文\n\n病了的原生家庭，自己才是解药！\n病了的原生家庭，畸形的亲子关系，往往不是我们有能力改变的，但是就像一句话说的那样：“你可以选择不原谅，但也可以选择放下”。\n这里的放下，既是一种对过去的谅解，也是一种对原生家庭造成伤口的自我疗愈。你首先要看见伤口的存在，才能试图去医治它，也才能避免让这种伤痛，继续反射到下一代身上。\n高晓松曾在《奇葩大会》上分享过自己年轻时与父亲不和谐的亲子关系，从而导致他年轻时的叛逆、爱较劲、不喜欢被干预的性格，但是中年时他靠自己的力量走了出来。\n对于自己的成长故事，他的感悟是“你靠自己的感觉，无论是对还是错，把它淋漓尽致地展现在这个世界上，在这个过程中你被看见了，经历过这么多斗争痛苦，最后走到这里来，这是英雄”。\n所以，逃开原生家庭的牢笼，成为你自己的关键是：\n\n1、看见你自己，然后爱并尊重你自己\n即使父母说他们那么爱你，行动上也的确是很爱很爱，但你的感受如果是伤害，是不被爱，那么你就要看见自己的这种感受和愤怒。\n举个例子，父母觉得他们好吃好喝的供养你，让你长大成人，为你结婚生子，但从始至终他们都只看到了他们的付出，却忽略你内心的所求，这个时候，你就要为自己争取和改变。\n因为当某种情绪一再压抑，那种力量就会反噬，要么是像明玉般与父母反目成仇，要么是如苏母般一味的宣泄在儿女身上。最可怕的情况是，我恨你却最终变成了你。\n所以“看见”自己的伤痛，理解自己的需求，做出自己的争取。当父母不断指责你，说你做的不对的时候，你遵从内心，保护那个你认为对的自我；当你试图证明自己，却被父母不断否定的时候，放弃证明，告诉自己就是最好的。\n要知道，在成为别人之前，你一定要成为你自己。\n2、看见他们的伤口，然后学会释然和放下\n有心理学家指出，80%儿童的心里想问题来源于他们的父母，而父母的问题又来源…",
          "link": "https://daily.zhihu.com/story/9737481",
          "publishedOn": "2021-06-26T23:07:31.000Z",
          "wordCount": null,
          "title": "童年不够幸福的人，如何通过自己的努力获得前进的力量？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737486",
          "author": null,
          "description": "司马懿，三国英雄士，四朝经济臣\n阅读原文\n\n多谢 @倩文 邀请。\n其实『经济学的逻辑基础』和题主在补充说明里面说的，我感觉是两个问题。因为『逻辑基础』可能是想表达某种学科自洽的观念，而一般均衡和局部均衡的推导是另外一个事情。前者更像是一个科学哲学的问题，暂且放在一边，在这里简单的谈谈第二个问题，就是为什么从一般均衡推导出局部均衡是困难的。\n我认为最根本的原因，是因为『一般均衡』并不是『局部均衡』的一般形式，而是两种在不同假设下的均衡形式。两者的关系并不像牛顿力学和相对论力学那样，前者是后者的在某种状态下的近似。但是一般均衡和局部均衡无论是中英文，都似乎在暗示着这一点。\n举个例子，假设全世界有很多城市，每个城市里面有一个被高度规制的公司，也就是说这个公司是 price taker. 每家公司都生产同样的面包。然后呢，每个城市都有固定数量的人，每个人提供固定数量的劳动力。个人的劳动力供给无弹性，但是人可以在不同城市自由迁移。\n因为人是自由迁移的，每个城市的公司又是一样的，那么我们可以认为均衡的时候，每个城市的工资必然是一样的，假定这个工资是 W0。\n现在问题来了，如果其中突然有一个城市，增加了一点工资税 T，会造成什么影响?\n在局部均衡分析的时候，逻辑是这样的：因为人口是自由流动的，所以均衡的时候，人们的税后工资必然还是和其他地方的工资一样都是 W0，否则所有人都会迁移到其他的城市去。那么也就是说，这个税虽然表面上加在劳动者的工资上，但是其实是加在了公司的身上，公司会发给劳动者 W0+T 的税前工资。\n这个就跟之前讨论的美国对奖学金加税一样，因为奖学金其实基本上就是学生能够接受的底线了，所以如果加税的话，是学校会为每个学生多出一些钱来弥补因为税来的损失，表面上是学生的负担增加了，但是其实真正负担的是学校。\n但是在一般均衡的框架下，某一个城市的工资税，不仅仅对本城市有影响，还可能会对其他城市的工资有一个间接的影响。所以局部均衡的假设“其他城市还是 W0”就要被推翻掉。这里我就不写计算过程了，直观上，最终的结果就是所有城市的工资都下降了一点点，计算结果也确实如此。当城市很多的时候，下降的工资从绝对比例上几乎可以忽略不计。\n但是，就这么一点点对单个城市来说，看起来可以忽略不计的工资下降，加起来之后，恰恰就等于税收的总额！也就是说在这种情况下，公司的利润其实是不变的，反而是所有城市的劳动者共同承担了某一个城市的工资税（还记得假设吧，劳动力供给毫无弹性^_^）。\n上面这个小例子已经可以说明，在同样的一个设定下，用一般均衡和局部均衡的方法甚至可以得出完全相反的结果了。在经济学的框架下，一般并不是由很多个局部组成的，而是通过内生化局部均衡中某些的外生变量所产生的，双方的设定不同，互相推导有困难也是正常的。即便是将来通过数学技巧，可以找出在某些巧妙的假设下，双方能够互相推导，但是这样的一篇 ECMA 更多的是一种智力上的挑战，而非对经济学这两个概念的颠覆。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737486",
          "publishedOn": "2021-06-26T23:07:22.000Z",
          "wordCount": null,
          "title": "经济学有逻辑基础吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737494",
          "author": null,
          "description": "托比章，游戏制作人/科幻评论\n阅读原文\n\n奥斯卡，也就是学院奖，之所以叫学院奖是因为主办单位是美国电影艺术与科学学会，看这个名字就知道，艺术是在科学之前的。在 2014 年的时候洛杉矶时报做了一项调查， 6028 名学院奖评委中，94%是白人，76%是男性，评委的平均年龄是 63 岁。就是说这些评委大多是在 1940-1960 年代出生的, 这方面的因素可能对评委的意识形态还是有很大约束力的。\n科幻片第一次被提名最佳影片奖是 1978 年的星球大战，那是当年让全世界所有青年都激动不已的票房冠军，收 7 亿 7 千 5 百万美元，但是最后获奖的是票房只有三千八百万美元的生活片《安妮·霍尔》。捶胸顿足吧。 但是当时，科幻片已经成为美国票房的重要组成部分，不可忽视。但是学院是很不情愿把包括最佳影片，最佳导演，最佳摄影这些重要项目办法给这种小青年才喜欢看的东西，在那些老一辈艺术家眼里面这些东西都是不入流的。 但学院又要给资本家们有所交代，那还是要办事，但是最佳影片和最佳导演是老前辈的底线。\n【第三类接触就在星战同一届上得了最佳摄影奖。】\n在这之前，科幻片通常都是在最佳视觉效果这个奖项上，比如 1968 年的《2001：太空奥德赛》可以说是和星战一样属于科幻史上的里程碑作品，但不管你怎么觉得，对于奥斯卡评委来说这就算不上电影艺术，给一个视觉效果安慰一下， 。还不要提最佳视觉效果是 1964 年才独立出来成为一个单独的奖项的，之前是叫做最佳特效，这个奖项是包含了音效和特效两部分。1950 年的《目标月球》Destination Moon 以及 1953 年的《世界大战》都获得了这个奖项，不过很多都是以特别成就奖的形式办法，都还不算做正式奖项。\n科幻片这种电影想要在奥斯卡拿个奖真是很难，尽都是最佳特效， 偶尔一个最佳摄影，音效，还有就是像希斯莱杰，追认。不光是科幻， 奇幻片恐怖片， 都是属于这个区间里面，一直被提名，一个正规奖项没有。直到 04 年的指环王获得最佳影片奖，不光是奇幻粉丝喜极而泣，也让让那些在星战，ET，侏罗纪公园，黑客帝国一路臭骂学院奖的科幻迷感受到了莫大的安慰。2016 年的《降临》，独树一帜，可能是近十年以来最有深度的科幻片，包括最佳影片奖，最佳导演奖在内 8 项提名，最后就拿走一个视觉特效（勘误: 此处应是 89 界的最佳音效剪辑）。所以我觉得，指环王得奖是奇幻片一个安慰奖，在那之后应该还要给科幻片也颁发一个安慰奖。\n安德烈塔克夫斯基是苏联以及全世界电影历史上的一个殿堂级人物，在他拍摄的为数不多的几部影片中就有两部科幻片， 比起《追踪者》来说我更喜欢他的另一部科幻片《索拉里斯》。当年莫斯科也是把这部电影作为对抗西方资本主义科幻电影太空奥德赛的强有力反击。塔克夫斯基本人也不喜欢 Kubrik 的史诗科幻电影，他的评价是：“这是一部毫无生气，充满心机和虚荣做作的电影。” 。但塔克夫斯基也不喜欢自己拍的索拉里斯，其实他就不喜欢幻片，甚至类型电影的概念。 在 1970 年的一次采访中， 安德烈塔克夫斯基对记者谈到“出于某种原因，现在所有的科幻电影中，导演都想要强迫观众去仔细鉴赏未来的物质世界。更有一些，比如 Kubrik 之流，他们把自己的电影称作预言。这简直让人难以置信！ 2001 太空奥德赛在很多地方都太假了，对于真正的电影艺术，这些虚假的东西必须要被消灭。” 我认为这是非常有思考意义，我们今天的科幻片展现给观众的，就是各种应接不暇的特技，只求痛快，但是影片的意义却无从寻找，或者根本就没有人关心。在《雕刻时间》一书中，塔可夫斯基评价自己的科幻电影时这么写到 “不幸的是，索拉里斯中的科幻元素太强烈了，对于观众来说已经是一种干扰………… 史坦尼斯劳·莱姆（Stanisław Lem）笔下的那些空间站，火箭，制作展现出来确实都是非常有趣的东西；但是对于我来说，现在看来，我觉得如果我们能这些东西都去除掉，电影的本意和要传达的信息应该更加鲜明地凸现出来。”\n另外还有一个就是导演或者据本身的有会员属性。《指环王：王者归来》确实是非常罕见的组合了。这篇文章实际上是《水形物语》得奥斯卡奖之前写的，因为觉得 Arival 也没有得奥斯卡奖，你一个吃鸡蛋的橡皮怪，就算导演有路子………………\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737494",
          "publishedOn": "2021-06-26T23:07:13.000Z",
          "wordCount": null,
          "title": "为什么科幻电影不受奥斯卡青睐？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737492",
          "author": null,
          "description": "Nantan，天降陨石于斯人。\n阅读原文\n\n不完全是。\n按照常规的理解，铁陨石中能被称为“纹理”的结构有维斯台登构造（Widmanstätten pattern）和纽曼线（Neumann lines）。前者无法人工制造，但后者可以。\n找了一圈没找着同时拍到维斯台登纹和纽曼线的陨石照片，只能拿自己的开刀了，原谅我的渣渣拍照技术。。\n条带状的交错纹理是维斯台登构造。颜色稍亮的斑块是铁纹石，上面发丝般的纹理就是纽曼线。拍摄材料是南丹（Nantan）铁陨石。\n维斯台登构造的形成取决于铁陨石的化学成分和陨石母体中 Fe-Ni 熔体的冷却速率。是铁陨石母体在冷却过程中，铁纹石（α- 铁，铁的同素异形体之一，体心立方点阵）沿着镍纹石（γ- 铁）的特定晶面生长形成的。一般长这样：\n\n1- 铁纹石；2- 镍纹石；3- 合纹石（铁纹石和镍纹石的混合物）；4- 氧化物和其他陨石矿物。\n铁陨石那样厘米级尺寸的维斯台登构造确实无法在实验室制造，原因在于形成这种金相需要铁陨石的母体以极其缓慢的速率冷却。虽然不同铁陨石的冷却速率相差甚远，但通常在 1~100℃/ 百万年的区间内。人类发明时光机之前可没寿命在实验室里等这么一块玩意儿冷却。\n研究人员模拟铁陨石冷却时使用了 6.88wt%Ni 和 0.49wt%P 的铁合金，并以 5℃/ 天的冷却速率从 790℃降到 650℃，结果形成的维斯台登构造中的铁纹石晶体（下图的 K）只有几微米宽。远达不到铁陨石里肉眼可见的大尺寸铁纹石晶体的水平。[1]\n6.88wt%Ni 和 0.49wt%P 的模拟铁陨石以 5℃/ 天的速率冷却，透射电镜图。9.8wt%Ni-0.3wt%P 的铁合金冷却至 650℃的实验，形成的维斯台登构造。反射光显微图。\n下图为 Gibeon 铁陨石的维斯台登构造，可以对比一下晶体尺寸差距。\n（Gibeon 铁陨石在结构分类上属于细粒八面体铁陨石，维斯台登纹比刚才拍的粗粒八面体 Nantan 要细得多，铁纹石晶体很窄，不能直接肉眼观察纽曼线。）\nhttps://doi.org/10.1016/j.actamat.2005.11.008\nK：铁纹石；T：镍纹石；P：合纹石；N：纽曼线。\n也许你能在某购物平台上看到个别有怪异“维斯台登纹”的“铁陨石”，那些大多只是在铁块表面磨砂或者部分哑光处理的玩意，用砂纸磨去就没了，而且做工十分蹩脚，甚至不能称之为仿造。（铁陨石的维斯台登纹用砂纸磨去后，重新酸洗就能重现）\n图片来自某宝。\n至于纽曼线，它的形成条件就没有维斯台登纹那么苛刻了。纽曼线是铁纹石受到冲击形成的，代表了机械双晶的 Fe-Ni 微薄页理，体心铁纹石中双晶面为（112）。[2]而小行星之间偶尔也会“撞车”，冲击变质也是陨石中的常见现象。\n人为制造的纽曼线在夏比冲击试验就能做到。\n夏比冲击试验是用以测定金属材料抗缺口敏感性(韧性)的试验。制备有一定形状和尺寸的金属试样，使其具有 U 形缺口或 V 形缺口，在夏比冲击试验机上处于简支梁状态，以试验机举起的摆锤作一次冲击，使试样沿缺口冲断，用折断时摆锤重新升起高度差计算试样的吸收功。\n纽曼线只在样品与试验设备支架接触的区域产生，而此区域在冲击过程中压缩应力最高。\n所以铁陨石的纹理，无论是维斯台登纹还是纽曼线，都是可以人工制造的。但前提是有足够的寿命，所以要研究怎么制作假陨石，最好先研究如何长生不老。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737492",
          "publishedOn": "2021-06-26T23:07:05.000Z",
          "wordCount": null,
          "title": "铁陨石的纹理真的无法人造吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737476",
          "author": null,
          "description": "知乎用户，建筑 职场提升 设计留学 媒体合作｜咨询微信：hurmus\n阅读原文\n\n画那么好，给谁看？\n带国外的建筑绘图课题的老师，一般都是知名艺术家或是有独特风格的设计师；而不是理论博士或者熟练型绘图员，教学目标和配置不同也很难比较谁更厉害。\n刚好，2021 春季学期参加了 Syracuse 大三建筑系 Drawing Architecture Studio 的终期评图，是客座教授李涵和胡妍（绘造社）带的课题；下文从课题的出发点、方法论和最终成果实现这三个维度描述，希望对你有所启发。\n©2021 Beijing VC Studio/ 绘造社 DAS, Syracuse Architecture\n这次的建筑绘图课题结束，所有作业都被艺术机构展览并收藏了；不得不说，这确实有点厉害了。\n策展人是知名大佬崔灿灿，目前正在北京 798 展览中，一直到 9 月初结束，有兴趣的知友可以过去看看。（报李乐贤享受 200%票价）\n展览海报展览现场合影\n绘图教学出发点，是给专业顾问和施工队看？还是给公众和客户看？\n常规本土建筑院校里开设的绘图课题，是以培训技术图纸绘制为导向。比如说，在大一学会简单的画法几何、工程制图和阴影透视、大二跟着设计课题学绘制平立剖和大样等施工图技术、大三之后基本上不会有人来教绘图了。所以，从教学目的上是教学生画一套扎实的，并且可以拿来盖房子的专业技术图纸。\n画法几何\n而国外的绘图课题，走得是另外一条路线，在行业高度成熟细分的状态下，越是有名的院校，越会去追求“高级”的绘图表现技法。这些绘图作业大部分都会被“展”出来，在学院内部展览或公共艺术展览等场所；因此，作品完成度也需要达到相应的要求。从课题层面，也必须是根据特定和话题与主题进行创作，一方面是减少学生纠结于选择概念的时间，另一方面易于控制表现技法和出图深度；简而言之就是定向性绘图表达技法创作。\n©2021 Beij…",
          "link": "https://daily.zhihu.com/story/9737476",
          "publishedOn": "2021-06-26T23:06:55.000Z",
          "wordCount": null,
          "title": "国外为什么建筑绘图这么厉害？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737474",
          "author": null,
          "description": "菲利普医生，野生外科医生/美短饲养者\n阅读原文\n\n谢邀，\n其实不需要特种兵，也不必用脚踹，没受过训练的普通人如果不注意也可能把人打死。\n而这种有可能致死的打击有个医学的学术专用词汇——心脏震荡（Cardiac Concussion）\n先来看一个病例：\n患者，男，39 岁，工人，2012 年 3 月 25 日，在砖厂搬运砖时因琐事与同班工人刘某发生口角，被同事劝开后刘某突然冲向王某猛击胸部两拳使其倒地，随即出现面色苍白，呼吸急促，手足抽搐，口吐白沫，约 20min 后在送往医院途中死亡。死后第 2 日对王某尸体进行了全面检验。体表见胸骨体中部及其左侧在 11.5cm×7.5cm 范围内有两处大小相近不规则皮肤出血。解剖见其下方对应处第 3、4 肋骨横行线状骨折，双肺表面散在性出血，心脏胸肋面和膈面以及心尖部心外膜均见散在大小不等出血点，最大 0.2cm×0.1cm，最小似针尖大。病理学诊断：（1）心外膜散在点片状出血；（2）双肺淤血、水肿，散在灶状出血。余未见明显异常。\n从法医的病理学解剖方面来看，软组织挫伤、肋骨骨折、包括心包膜的点状出血都算不上很严重的损伤。但病人最终死于心脏骤停。\n最后的法医诊断为心脏震荡引起的心脏骤停。\n心脏震荡有以下几个特点：\n1.心前区或前胸被打击过，伤后很快出现心前区疼痛、心律不齐甚至心脏骤停。\n2.被打击后很快晕厥、丧失意识，并在不超过 2 分钟内死亡。\n3.解剖发现心肌无损伤、仅见心外膜下少量点状出血。\n4.排除其他可导致心脏骤停的心脏基础疾病。\n那么我们回头看看《战狼 2》中，主角冷锋猛踹拆迁恶霸的那个镜头可见，恰好就是踹在前胸。\n\n虽然恶霸死前也口吐鲜血，应该有消化道或呼吸道的损伤（当然了也可能是为了艺术表现的需要），但显然这一脚引发的心脏震荡才更有可能是致死的主因。因为严重的呼吸道和消化道损伤不太可能短时间丧命。\n可能有些人也遭遇过心前…",
          "link": "https://daily.zhihu.com/story/9737474",
          "publishedOn": "2021-06-25T23:07:39.000Z",
          "wordCount": null,
          "title": "特种兵能一脚踹死一个人吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737458",
          "author": null,
          "description": "ag獭，好奇而无用的獭獭\n阅读原文\n\n历史上，中华文明曾有过许多领先世界的成就，定性分析其影响并不容易，不如定量列举先祖创造的重大成就和发明，看看如果没有这些成就，当下生活将会变得如何不同。\n\n*.全文约 3 万字，简略形式见图表。\n*.入选标准是具有区域性影响，或有足够独创性，处于领先水平的成就，为避免争议，仅选取古代，也就是鸦片战争之前的文明成就。\n*.中国古代很多发明是基于经验的，从 0 到 1 或者到 5 的发明，近现代西方则基于理论和应用需求，从 1 发展到了 100。同一个发明，在不同社会下起到的作用是不同的，但是不能就因此否定发明本身的重要性。人类史上许多看似简单的发明都是走了很多弯路才出现的，从 0 到 1，还真不那么简单。\n*.美国人罗伯特·坦普尔写过一本 The Genius of China: 3,000 Years of Science, Discovery, and Invention，中译名为《中国：发明与发现的国度》，总结了中国古代 100 项领先世界的发明发现。这本书内容有点老，部分事例有些牵强附会。下面列出的，都是比较之后确定的中国文明成就，一些成就属于中外分别独自产生，或者有争议，都会在介绍中注明。\n政经军事科层制政府\n明清时代传教士白晋绘制的中国官员\n随着国家规模的扩大，为了管理日益增长的人口，许多国家出现了专业的文士阶层，也就是官僚的前身。战国时期，君主为了扩大权力，更有效地掌控国家资源，任用法家变法，逐渐建立中央集权的政府。秦汉时期，中国的科层制集权政府走向成熟，现代官僚制的几大特点，如专业分工、层级体制、依法行政、非人性化、量才用人、长期任用，在当时的中国就已基本实现。\n可以说，在近代民族国家出现以前，中国的官僚制度远远领先同时代的任何国家，某种程度上，已经颇具现代国家官僚制度的格局。启蒙时代，随着儒家典籍的传来，西方知识界流行起…",
          "link": "https://daily.zhihu.com/story/9737458",
          "publishedOn": "2021-06-25T23:07:36.000Z",
          "wordCount": null,
          "title": "中华文明对人类有哪些主要贡献？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737404",
          "author": null,
          "description": "李铁夫，干货不在回答里，在个人文章里。\n阅读原文\n\n冰火世界是一个庞大的世界，冰火的剧情线也是复杂交错的。 剧集相比于原著，已经进行了大幅度的精简，可是即使在精简的情况下，其人物关系、家族矛盾、历史恩怨仍旧让一些人理不出头绪。在这里，我就尽我所能说一说血色婚礼之后的北境线吧。\n首先带大家回忆一下这个时间点的情况。\n五件标志性事件\n第一.泰温之死。兰尼斯特家族在君临城外战胜了史坦尼斯，可是他们没笑多久，就发生了小恶魔弑父逃亡的事件。 泰温死后，瑟曦就作为摄政太后，开始了一系列作死行为。\n第二.血色婚礼。罗柏在孪河城遭受了人生中最后一次背叛，他和他手下的几千名北境士兵被杀害。卢斯·波顿因为参与了血婚，被兰尼斯特奖励成为新的北境守护。\n第三.铁民肆虐。在罗柏南下作战期间，铁民袭击了北境，占领了包括临冬城在内地多座城堡。此时铁民仍未离去，卢斯·波顿回到北境的第一件大事，就是要肃清铁民。\n第四.席恩受虐。席恩在临冬城穷途末路以后，被卢斯·波顿的私生子拉姆斯俘虏并虐待，这时候还作为臭佬被关在恐怖堡。\n第五.长城战役。长城外，曼斯雷德已经大军压境，守夜人给南方的五个国王都发送了信鸦，可是还没有收到任何回应。\n这几个重要事件剧集和原著是一致的，但是细节上有着些许的不同。尤其是这五件大事在剧集中被分为三、四两季，给人一种时隔很久的感觉。 但事实上，五件大事几乎是发生在同一时间段。 下面就说说具体的不同之处：\n最重要的一点！铁群岛的巴隆·葛雷乔伊这时已经死亡。在罗柏从奔流城前往孪河城参加血色婚礼的路上，就已经和身边的人谈及了巴隆的死亡。 而剧集里巴隆大王第六季才死，事实上第三季就应该死了。\n而巴隆大王死后，铁群岛立刻就举行了选王会，巴隆的二弟攸伦战胜了巴隆的女儿阿莎（剧集里叫 Yara）和巴隆的三弟维克塔利昂，成了新的铁群岛之王。 他一上位，第一件举措就是将铁民的主力部队撤离北境，转而去劫掠河…",
          "link": "https://daily.zhihu.com/story/9737404",
          "publishedOn": "2021-06-25T23:07:31.000Z",
          "wordCount": null,
          "title": "美剧《权力的游戏》和小说《冰与火之歌》的剧情发展有哪些明显不同？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737467",
          "author": null,
          "description": "Changkai Zhang，Theoretical Physicist\n阅读原文\n\n其实这是一个很好的问题，它背后所蕴含的逻辑和哲学远没有它表面看上去那么简单。诚然，你可以认为这是一个定义问题，因为你完全可以说这个”悖论“出现的原因是”谷堆“这个概念定义不清。但是，这样的说法其实有些过于简单了。\n我不知道有多少人小时候看到超市里的散装大米会有种想要把玩的冲动。不过如果你注意观察这些散装大米，你会发现它们的表面往往有很多不同的形状：\n散装大米的表面往往可以有各种不同的形状。图片源自网络，侵删。\n所以一个自然的定义“谷堆”的办法就是根据它的表面是否能形成特殊形状。这也是最符合我们常识的一种定义。所以你再想想看，是从第几粒米开始，这些散装大米的表面就开始出现这些形状了？是不是就没那么好解释了？\n当然，谷堆和大米在这里并不是一个非常好说明的例子。所以让我们换几个类似的问题，比如：\n\n一个水分子不算湖泊，若  个水分子不算湖泊，加一个也不能算。所以，究竟多少水才能形成湖泊呢？\n一个像素不算图片，若  个像素不算图片，加一个大概也无济于事。所以，从第几个像素起，我们可以将之称为图片了呢？\n\n我们来看湖泊的问题。沿用我们刚才分析谷堆的方式。湖泊表面是会形成浪的，而几个水分子或哪怕是几滴水（已经有\n\n这么多的水分子了）都是无法形成浪的。所以，我们的问题就变成了：从第几个水分子开始，这些水可以形成浪呢？\n可能令很多人意外的是，对这个问题我们至今都没有一个非常完善的理论解释，而对类似的问题的研究依然是物理学前沿的热点之一。物理学中我们叫它尺度问题或复杂度问题，核心就在于，很多系统在能标降低或尺度增加 (复杂度增加) 后，会有新的自由度出现。湖泊上的浪就是一个例子。湖泊里的每一个水分子都有自己的运动自由度。这些自由度通过互相的耦合，在有足够多的水分子的情况下，在大尺度上产生新的长波 (long-wavelength) 自由度。物理学中这样的例子很多。另一个例子是：如果你只有几个原子，那么它们大概是不能传递声音的，但是如果你有\n\n个原子，那么声波大概就可以在它们之间传播了。所以，声波也是在大尺度上一些介质产生的长波自由度。\n这种在不同的能标和尺度下存在不同的主导自由度 (dominant degrees of freedom) 的现象是现代物理学的研究重点之一。这种现象的重要特点是，当能标充分降低或尺度充分增加后，高能标和小尺度的细节会被屏蔽，只留下低能标大尺度的等效自由度。目前理论上能够使用的分析工具仅有基于路径积分的重整化群方法 (计算上倒是还有那么些)，该方法可以将高能标自由度给积分掉，只余下低能标的自由度。\n说回到这个悖论问题。这个悖论本质上表明了分析学的局限性。当我们研究的系统尺度发生明显变化时，有可能出现的大尺度结构是无法被分析学方法所捕获的。而如何通过理论或计算方法去连接相邻尺度下的主导自由度也是目前理论物理学家的工作重点之一。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737467",
          "publishedOn": "2021-06-25T23:07:26.000Z",
          "wordCount": null,
          "title": "一粒谷子不算谷堆，再加一点也不算，以此类推加到一万粒也不算，该如何解决这样的谷堆悖论？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737423",
          "author": null,
          "description": "张小北，编剧、导演\n阅读原文\n\n这是我在 2018 年给《如何聊电影》这本书写的书评，但正好也可以回答这个问题。\n\n在一个所有人都可以在网络上聊电影的时代，我们为什么还要去看一本教你“如何聊电影”的书呢？因为当我们在聊一部电影时，如果我们没有一些共同的标准，那么我们说的其实并不是同一部电影。如果没有这些共同的标准，绝大部分在网络上聊电影的行为，最后都会变成无谓的口水之争。如何去了解一部电影，如何去建立看电影的基本标准，这是一个可以复杂也可以简单的问题。而我今天之所以愿意在这里认真推荐《如何聊电影》这本书，是因为我觉得这本书能够切实有效地帮助到那些严肃的电影爱好者。\n本书作者安·霍纳迪（Ann Hornaday 《华盛顿邮报》首席电影评论家）和中国的大部分“影评人”不同之处在于，她是一个“职业影评人”。在职业生涯的起点，安·霍纳迪先是为《首映》杂志和《纽约时报》做电影相关板块的撰稿人，随后受邀担任了《奥斯汀美国政治家报》的特约影评人，并由此建立了行业声誉，然后又陆续在《巴尔的摩太阳报》和《华盛顿邮报》担任专职影评人，并于 2008 年荣获普利策新闻奖 “最佳评论人”提名。从业三十多年以来，安·霍纳迪采访过李安、马丁·斯科塞斯、史蒂文·斯皮尔伯格、加里·奥德曼、卡西·阿弗莱克、蒂尔达·温斯顿等众多影视界知名人士。亚马逊读者评价她是“继罗杰·伊伯特之后可相信、跟随”的影评人。\n对于不太了解美国新闻出版行业的朋友们来说，安·霍纳迪任职的前两家报纸可能都没有听说过，但《华盛顿邮报》对于所有新闻专业或相关背景的中国读者来说，一定不会陌生。（如果有朋友想要了解《华盛顿邮报》的相关背景，可关注一下由史蒂文·斯皮尔伯格导演的同名电影《华盛顿邮报》。它在 2018 年获得了第 90 届奥斯卡金像奖最佳影片和最佳女主角提名，以及一系列相关的年度电影奖项，是一部非常优秀的电影。）之所以要花费一点笔…",
          "link": "https://daily.zhihu.com/story/9737423",
          "publishedOn": "2021-06-24T23:07:37.000Z",
          "wordCount": null,
          "title": "影评到底有什么用？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737418",
          "author": null,
          "description": "沈世钧，骨灰级程序员｜软件架构｜人工智能\n阅读原文\n\n员工的离职成本非常高，尤其在软件行业。\n除了和传统企业一样，在员工离职时，会付出招聘、交接、培训成本外。离职率太高，对软件企业，还有一个极度恶劣的后果，那就是：\n极大的加速软件系统的腐败。\n因为软件是纯粹脑力劳动的结果，极度依赖软件工程师本人。因此，软件的交接就不简单是生产工具的交接，更是知识的传递。而只要有知识的传递就必然有丢失，有变形。因此一个离职频繁的团队，知识的反复交接，必然会丢失大量的细节，以致于到最后，接手的程序员对系统的理解是面目全非。\n而且最严重的不仅是知识的丢失，更有责任心的丢失。\n如果一个模块是由某个软件工程师一手开发并维护。在感情上，他自然的倾向于爱惜羽毛，认真对待。在责任上，他也无可推卸，因为这一切都源于他。但是，在一个离职率高的团队，一个软件反复转手，后来者除了感情不深外。出了问题，也自然的会把所有的缺陷归罪于前人，包括设计和开发。\n一个反复转手的软件，必定会出现经典的“破窗效应”：\n“反正系统已经这么烂了，而且也不是我的责任，我既没有能力，也没有必要去矫正它。”\n于是，有了 bug，接手者自不会去认真研究问题的根源，而是倾向于用快速且肮脏的“打补丁”方式来解决。反正是先把问题摁住，至于整个系统是否会越来越腐败，管它呢？\n因此，整个软件系统最终呈现的就是补丁摞补丁的“垃圾场”。\n而我在软件圈所见所闻，也正有力的验证着该理论。\n我一好友，在某在线旅游网站工作，去年（2018）年初告我，连着两个星期，他每天中午都要吃“散伙饭”，以至于 20 人的团队，过了年，领了年终奖，一个月的时间竟走掉了 70%的人，最后只剩下区区 5 人。\n因为机缘巧合，我也读过他们的代码。老实说，肮脏不堪，典型的“金玉其外败絮其中”。\n我认真的和朋友讨论他们的代码，为什么明明是一些低级的错误（例如不规范的变量命名，冗余的变量定义），随手就能改的东西，就生生的横在哪里，没人管。朋友沉默一会，坦诚一个重要的原因就是员工的频繁流动。\n也许你今天还和某个同事讨论开发细节，明天他就会通知你他要离职了。甚至于朋友的入职导师，一个月时间不到，竟也要离职。于是，本来需要辅导的朋友，反过身来却要和导师交接工作，你说荒唐不荒唐？\n而这种现象，对一个团队的软件质量来说，简直就是绝症。每个人在工作的时候，脑子里想的最多就是自己的跳槽和别人的跳槽。所有的工作都倾向于“将就”，反正 “我走后那管他洪水滔天，也和我无关！”。\n而且，据我所知，在软件行业，离职率高是一种普遍现象，即使是一些行业巨头，离职率也达到惊人的 20%。这也就意味着，每过 5 年，整个团队就会被清洗一遍，这种情况下，再谈知识传承和软件质量，该是多么的不现实！\n而这一切的根本，员工固然有责任，但更应该反思的是管理层：为什么员工的离职率这么高？是因为待遇不公？还是工作量不合理？或者只是态度不好？\n这篇问答不仅是写给别人，更是写给我自己，我需要时刻诫勉自己：务必善待同事，因为在软件行业，人真的就是一切！\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737418",
          "publishedOn": "2021-06-24T23:07:32.000Z",
          "wordCount": null,
          "title": "一个员工的离职成本到底有多高？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737426",
          "author": null,
          "description": "胖博士，懂你皮肤问题的清华胖师兄\n阅读原文\n\n题主举了几个化腐朽为神奇的化妆品成品例子，其实化妆品里的成分更神奇，因为成品的功效都来自成分的组合啊！\n这些神奇的成分，我能给你聊三天三夜，因为我在欧莱雅中国研发中心的工作就是研究各种神奇的成分推荐给实验室。在这里，我就举几个你没怎么听过的例子，和好奇宝宝们分享一下。\nPMMA（聚甲基丙烯酸甲酯）\n相信你看到这个成分名字，第一反应是“这是什么鬼？”那我换个说法，叫它“柔焦因子”，是不是觉得眼熟多了？\n不少化妆品里会加入 PMMA 的微球，它能带来清爽的肤感，提供哑光雾面效果，所以在营销的时候，会把它叫做柔焦因子。\nPMMA 微球（图片来自网络）\n它哑光柔焦的原理在于把照射到脸上的光线从镜面反射变成漫反射。于是脸上看起来显得非常柔和，自带柔焦效果。\n因为微球颗粒小，比表面积大，它还可以吸附一部分油脂。所以对于大油皮来说，它还有控油的效果。\n把 PMMA 微球添加到配方里，使用产品的时候，PMMA 小颗粒在皮肤上滚动，带来非常特殊的爽滑肤感。\n所以 PMMA 是一种非常神奇的柔焦因子 + 肤感调节剂 + 吸油成分。\n卡波姆\n去年年初新冠疫情爆发的时候，卡波姆曾经供不应求，因为它不仅仅在化妆品里广泛应用，也是免洗洗手液的核心成分。它最神奇的地方在于能把清水变成啫喱状的凝胶。给某些化妆品带来“质感”，当然，也给某些奸商提供了以次充好的可乘之机。\n卡波姆把水变成凝胶（图片来自网络）\n卡波是超大分子的丙烯酸聚合物。因此超大分子量和内部交联聚合，形成了一个个直径在微米级别的聚丙烯酸分子。遇水中和之后，聚丙烯酸变成钠盐，内部互相排斥，整个分子骨架展开。其中的羰基因为氢键作用，牢牢的抓住水。于是变成一个个小小的像果冻一样的微凝胶。这些小果冻堆积在一起，让整个溶液变得粘稠，变得有质感。所以在化妆品里，我们把卡波姆和类似的成分叫做“增稠剂”。\n卡波姆…",
          "link": "https://daily.zhihu.com/story/9737426",
          "publishedOn": "2021-06-24T23:07:25.000Z",
          "wordCount": null,
          "title": "化妆品里面最神奇的都有哪些东西？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737434",
          "author": null,
          "description": "庄周座下的大头鱼，心理学咨询的宝藏男人\n阅读原文\n\n谢邀。\n作为一个专注于职场心理学的老咸鱼，这个问题非常好，必须要来答一波！\n《大明王朝 1566》作为一部高分的历史权谋剧，其草蛇灰线，伏脉千里的布局形式，让剧情铺设更为徐缓，人物之间的冲突变得晦涩难明。\n这就让剧中很多关于职场生活的”智慧“会在不经意之间被我们给忽视掉，而单纯醉心于政治权谋的搏杀。\n这其实是一个小遗憾，官场生活其实也是职场生活的一部分，对于职场来说，斗争智慧只是职场生活的一个小部分，甚至可以说占了很小一个比例。\n因为斗争它并不是职场生活中的常态，那什么才是职场生活的常态？\n为人处世！\n那么回到题主的核心问题，这部剧对于职场人发展有何借鉴的地方？\n老实说，这部剧中有太多可以为当今职业人所借鉴的智慧，但这里大头鱼想重点说一下自我保护。\n什么样的自我保护呢？\n就是洞察领导是真心看重你，栽培你，还是只是想压榨你？\n在《大明王朝 1566》中有很多场领导与员工的情景组合：\n胡宗宪与马宁远、杨金水与李玄、严世藩与高翰文、吕芳与冯保、嘉靖与陈洪、裕王与谭纶.......\n在这众多组合中，我们会看到每一个打工人在领导带领下，走上了天差地别的结局。\n他们有些人被砍了头、被顶了罪、被罢官入诏狱、被降为潜邸的大伴........\n对于职场个人来说，对比于自身素质所造成危险而言，组织框架所造成的危险更难让人控制，尤其是对于一个员工来说！\n那么在这当中如何判断自己的领导才是一个”好“领导？\n那么结合《大明王朝 1566》我们来看看剧中所给我们的提示与借鉴：\n01.边缘性 VS 重要性\n在职场生活中，工作内容永远是我们职业人的首选，但事有轻重缓急，每一个工作内容的安排与性质都体现了领导对你是否上心，是否在意。\n在初入职场生活的时候，我们都会被安排一些较为无关紧要的工作，这是为了方便我们熟悉工作环境，但如果你所做的工作内容一直是含金量…",
          "link": "https://daily.zhihu.com/story/9737434",
          "publishedOn": "2021-06-24T23:07:22.000Z",
          "wordCount": null,
          "title": "《大明王朝1566》对职场中人的发展有何借鉴的地方？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737436",
          "author": null,
          "description": "长的好看的人真的是三百六十度无死角吗？\n\n王昔\n阅读原文\n\n360 度无死角的那是球体\n阅读原文\n\n一个会计的水平能差到什么程度？\n\n冯志胜，十年的ERP顾问；FIRE；极简主义\n阅读原文\n\n制造车间工人的工资是制造费用，销售人员的工资是销售费用，管理人员的工资是管理费用，财务人员的工资是财务费用。\n再写个听来的：一张凭证是关于销售费用的，那个摘要写的是：给 XXX 公司 XXX 业务招待费 100000 元。财务经理骂他：你摘要直接写行贿得了。\n阅读原文\n\n可以分享一个最见不得人的秘密吗？\n\n匿名用户\n阅读原文\n\n我想嫁给病入膏肓的有钱的老男人 他死了我继承他的遗产 做个快乐的寡妇\n阅读原文\n\n连麦睡觉是一种什么样的感受？\n\njust\n阅读原文\n\n第一次和人连麦睡觉，虽然平时这个点我还没醒，但心情还是照样的忐忑与紧张，我还是想保留自己矜持的一面，所以闭了麦，听着他讲话就好，我能睡得很安心。\n谢谢你，有你陪伴我的睡眠真好，网课老师。\n阅读原文\n\n你有哪些特殊癖好？\n\n匿名用户\n阅读原文\n\n小学时候的事了……去我姥姥姥爷家玩，吃完辣条找不着洗手间，余光瞥见院子里午睡的欢欢（养的狗），然后把手上的辣油抹到了狗毛上……\n之后我发现这个手感还挺爽的，于是我平时吃完零食或者干什么事把手弄脏了，我都会\n用狗擦手\n事后被我妈发现打了一顿，狗也给洗了……\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737436",
          "publishedOn": "2021-06-24T23:07:17.000Z",
          "wordCount": null,
          "title": "瞎扯 · 如何正确地吐槽",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737383",
          "author": null,
          "description": "钱程，微信公众号，微博ID：技术型吃货\n阅读原文\n\n在之前神舟十号载人飞船的食品中，已经出现了「鱼香肉丝」和「宫保鸡丁」这两道菜。因此之前已经有研发基础了。此外，神舟九号的航天食品已经快到 100 种之多了，「天舟二号」带上去的绝对不止这两道菜。\n目前还没看到这两个菜式具体是以什么形式提供的。根据之前的资料，真空包装的「软罐头」食品的可能性比较大。\n\n1. 为啥选这两个菜？\n「鱼香肉丝」和「宫保鸡丁」能被选中，好吃当然是重要因素，但其实还有更重要的考虑。\n比如说，这两者都没有渣。\n太空中没有重力，带骨头、掉渣、掉粉的食物很容易在舱内漂得到处都是，对于航天员来说会非常难处理，还有可能损坏精密仪器。所以糖醋排骨、驴打滚之类的食物就不是很适合。鱼香肉丝和宫保鸡丁没这个问题。\n还有，这两者都很方便做成「软罐头（常温料理包）」的形式常温保存，风味和质构不会变化太大，目前这样的产品也比较成熟。\n航天食品很大一部分都是以「软罐头」的形式实现常温、长时间保存的。但有些食物，比如新鲜蔬菜，鱼肉之类，如果长时间加热，会失去原来的口感。风味、质构变化都很大。导致最后做出来的不好吃。鱼香肉丝和宫保鸡丁也没这个问题。\n还有，这两者都属于荤素搭配，用料比较丰富，从营养价值上来看相对比较均衡一些。\n\n2. 航天食品一般都会有哪些分类？\n说到航天食品，很多人可能受一些「年代久远」的科普书影响，认为都是牙膏状的半固体食物，直接挤到嘴里那种。其实那只是加加林时代的航天食品。现在航天食品早就百花齐放了，基本你在地面能吃到的食物类别，都有办法给你弄上太空。\n目前的太空食品可以分为如下几类[1]：\n1）脱水干燥食品\n通常是采用冷冻干燥的方式进行脱水的食品。各种蔬菜，水果，再到泡面，冰淇淋，万物皆可冻干。冻干食品由于水分含量太低，微生物无法存活，可以保存很久，复水起来非常快，航天员只要在飞船或空间站里将这些冻干食品复…",
          "link": "https://daily.zhihu.com/story/9737383",
          "publishedOn": "2021-06-23T23:08:02.000Z",
          "wordCount": null,
          "title": "为什么「鱼香肉丝」和「宫保鸡丁」这两道菜会被「天舟二号」选中带到太空中？这两道菜的国民度有多高？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737387",
          "author": null,
          "description": "2001室的库布里克，导演/编剧/DP b站/公号：电影视与听\n阅读原文\n\n我更倾向于这样看，电影是对演员的呈现，这和戏剧对演员的依赖不同。\n从我自己的创作角度，作为编剧和导演，我尽量不让演员处在一个完全需要她 / 他来虚构一段电影时间的内容的境地。\n我在【读戏】这个节目里区分了【表演图像】和【动作】，在我看来【表演图像】几乎都是要演的，【动作】则不需要演。\n所以我想可以这样理解题主的问题：好的表演未必是“演”出来的。\n我在《吉祥如意》的这篇影评中讨论过虚构和纪录，真实与表演，以及二者如何并非完全对立。\n影片中的真实人物，在面对一个虚构人物时，他们的反应或者表演，是否具有真实性，或者具有多大的真实性呢？\n在表演中有一个说法，叫做“moment of truth”，演员的【至真时刻】。简单说就是在完美的表演时刻中，演员真的成为了 ta 所塑造的人物，演员的身份以及电影拍摄的情景对演员的干扰暂时接近于零。也就是说“真实”，或者更为准确地说，「观感上真实的表演」，是可以与虚构创作共存的。\n我们很容易忽略一点：即便是客观地拍摄真实的人物，他们在摄影机前的一举一动，本来就无可避免地带有一种【表演性】。甚至有人认为，纪录片的魔力恰恰在于人在镜头前潜意识里的表演性。\n一切在镜头前的行为都是表演，反过来，所有影像都是对表演的如实记录。\n如果我们把【表演】理解成电影中演员在镜头前的一切行为，那么【表演】本身是中性的，有好的表演也有差的表演。\n经验丰富的演员可以通过技巧贡献真实的表演，让我们相信，让我们感动；同样没有表演经验的非专业演员也可以贡献让人惊叹的【表演】。\n所以其实好的表演真正的敌人是【假装】。\n【假装的表演】=“演”=不好的、让人出戏的【表演】\n专业演员有可能让表演看不出假装，好的剧本和导演可以让非专业演员不必假装。但无论是专业还是非专业演员，都能够从【非假装】的剧本和导演指导下获益。\n如果一定要修正一下问题中的说法：好的表演可能来源于不必假装。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737387",
          "publishedOn": "2021-06-23T23:07:57.000Z",
          "wordCount": null,
          "title": "「最好的演员不必表演」，这句话是真的吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737398",
          "author": null,
          "description": "徐小疼，小说作者，编剧\n阅读原文\n\n很可惜没能赶上题主放弃之前看到这个问题。但是，即使在现在，题主你如果愿意再看下我的回答，或许会对你有一些帮助。\n作为一个写小说的，你很难说自己是个完全的“外行人”。我自己也是最初写小说，后来转而从事编剧工作的。虽然小说和剧本的确不是同一种文学形式（甚至有的教剧作的老师拒绝把剧本看作一种“文学形式”），但是，你已经有了长期的文字工作积累，如果你的小说写得不算差的话，起码对文字是有感受的，你想要做编剧，是有基础的。\n我所在的北电文学系，核心理念是“故事为王”，认为电影的核心就是剧作故事，无论是视听也好，技术也罢，都是为了故事来服务的。所以，无论你是想做编剧，还是未来有做导演的想法，讲故事的能力都是基础中的基础。相比较完全没有文字工作经验的人，你写过小说，起码是知道故事是个什么东西，知道通过小说讲故事的一些方法的，你想要转行做编剧，本身就比那些什么都不会的人要基础高。\n但是，你现在为什么会处处碰壁呢？我来帮你分析一下。\n从小说转行剧本，不是简单地将你的故事写成剧本格式就可以的。首先你要明白，剧本和小说最大的不同在哪里。\n根据我自己的经验，两者最大的不同，就是你的文字，直接读者的不同，以及最终呈现的不同。\n剧本的直接读者是制片人，是导演，是演员，是摄录美，是剧组的工作人员；小说的直接读者，就是纯粹的读者（或者说是消费者）。\n剧本的最终呈现，是以电影 / 电视剧 / 戏剧的方式，也就是说，剧本会转化成一个具象的视听；而小说，是不会转化的，读者看到的就是你最初写下来的文字。\n你在写小说的时候，你考虑的是我怎么样通过我的文字，直接向读者传递我想表达的信息。这其中不可避免地会产生描述，描写，大段的对话，用以表达你想要传递的氛围啊，环境啊，人物啊，前史啊……这是完全没有问题的，好的描写，会让读者产生画面感，更好地跟着你的思路去走。写小说的人也时常会有一种误…",
          "link": "https://daily.zhihu.com/story/9737398",
          "publishedOn": "2021-06-23T23:07:51.000Z",
          "wordCount": null,
          "title": "外行人想做编剧是不是没有希望？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737374",
          "author": null,
          "description": "中科院物理所，没错，我就是那个物理所。\n阅读原文\n\n冰糖的摩擦荧光确有其事。想见证奇迹的童鞋可以做一个小实验：找来一个透明的内部干燥（一定要干燥，越干燥现象越明显）的矿泉水瓶，用其四分之一的空间装上大块冰糖。在一个月黑风高的夜晚，拉上窗帘，关上灯，让室内伸手不见五指，然后迅速地摇晃塑料瓶，你就可以看到瓶中的冰糖一下下地发着蓝紫色的闪光。摇得越快，现象越明显！\n（图片来源：FPSoutback 分享的 youtube 视频）\n你可能不知道，摩擦荧光（Triboluminescece）的研究历史已经有几百年了，早在 17 世纪就有人发现摩擦糖块会发出亮光。其机理在 Halliday 的《Fundamentals of Physics》里面有所叙述。由于冰糖晶体的非对称性，冰糖在断裂过程中断面会带上正负电荷，相当于把震动摩擦的机械能转化为了电势能。而电荷中和的放电过程激发了空气中的氮分子，氮分子退激发将能量以荧光形式放出。相似机理引起摩擦发光的晶体还有 LiF、NaCl、SiC 等。\n虽然多种晶体都有相似的发光现象，但是背后蕴含的机理问题有很多。比如，晶体的压电效应、扭曲和位错都能引起发光；还有些晶体不像冰糖这样靠激发氮分子来发光，而是由晶体本身被激发所致。除此之外，摩擦荧光也不仅限于非对称晶体，在某些对称晶体上也能观察到该现象。这些问题都有待人们去研究。这么看来，一个不起眼的小现象说不定蕴含着很多大学问呢！\nBY 中科院物理所 问答专栏\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737374",
          "publishedOn": "2021-06-23T23:07:46.000Z",
          "wordCount": null,
          "title": "用钳子夹冰糖为什么会发光？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737397",
          "author": null,
          "description": "转子磁场定向，十年FOC电控开发经验，B站/闲鱼/公众号”转子磁场定向“\n阅读原文\n\n刚开始玩电机的时候也不喜欢 MATLAB，每次都是直接码代码，然后去转电机。\n效果不好就在代码里改来改去，晕晕乎乎调了一周进展也不大。这种情况就是陷入了调参数的怪圈，恶性循环进而打击自信，进步也很缓慢。\n后来学会了 simulink，才明白学习 FOC 一定要配合 MATLAB，进步快很多。\n1、理解离散系统：在 FOC 中经常涉及到上个开关周期的角度，电压，或者预测下个周期的角度，电流，一般都是通过延时模块实现。\ndelay 延时模块\n为什么要使用这个模块呢？比如一般 PWM 比较值寄存器被改写后都是使能了预装载，采样后触发计算到比较值生效可以延时 0.5 个开关周期 Ts，也可以延时 1 个开关周期 Ts，或者 1.5 个 Ts。不同的延时对于控制效果有什么区别呢？只需要在 simulink 定义延时时间即可，非常方便对比不同的方案下的区别。这种调试在实物上实现要复杂很多！\n2、实现参数自整定：把所有的环路参数放在 m 文件里，在运行工程前，修改电机参数，环路参数等等，先运行 m 文件，可以实现参数自整定。要修改参数也只用改 m 文件，类似宏定义一样，环路的参数自整定和这个也差不多了。\nm 文件实现参数自整定\n3、强大示波器功能：simulink 的示波器功能非常强大，可以不限制查看任意波形，这在实物调试中也很难做到，除非去开发上位机配合查看，但是也有通道和数据量的限制。一般 ARM M0 的平台也没有资源去开发上位机。\n示波器显示电流电压\n尤其是现在比较通用的直流侧单电阻采样波形，可以清晰看到每个扇区对应的电流波形和单电阻波形的对应关系：\n单电阻采样波形\n4、模块化的平台，缩短开发周期：一般开发一种新的观测器，阅读文献之后，经过 simulink 验证。在搭建好平台之后，把观测器，速…",
          "link": "https://daily.zhihu.com/story/9737397",
          "publishedOn": "2021-06-23T23:07:38.000Z",
          "wordCount": null,
          "title": "MATLAB 到底有多厉害？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737409",
          "author": null,
          "description": "2021 年的夏天，国内有哪些「避暑胜地」推荐？\n\n螺旋真理，说一点文物考古博物馆的基础知识\n阅读原文\n\n各博物馆。\n因为文物保护的需要，一般博物馆展厅的温度会保持在 20 到 25 度，而且每天温度波动不能超过 5 度，毫无疑问是盛夏旅游最佳的避暑场地。\n\n评论区\n\n@阿峰 ：但不能去热门的博物馆…上次去陕西博物馆那个人多哦，空调基本没用\n\n作者回复：中国人口博物馆啊……那真是没什么办法了……\n\n \n\n\n阅读原文\n\n假如地球上所有体重超过 20kg 的生物都拥有人类的智商，会碰撞出怎样的文明火花？\n\n星空\n阅读原文\n\n你想象一下有一个 19.9 公斤的动物突然吃个口东西突然会说话了，拉了个屎又突然不会了\n阅读原文\n\n你的家人或亲戚怎样看待你化妆？\n\n青牡丹，Homo sapiens\n阅读原文\n\n我：姨妈色口红\n我爸：你的嘴巴涂的好红啊像要吃人一样\n我：复古红\n我爸：你的嘴巴涂的好红啊像要吃人一样\n我：枫叶色\n我爸：你的嘴巴涂的好红啊像要吃人一样\n我：水红色\n我爸：你的嘴巴涂的好红啊像要吃人一样\n我：豆沙色\n我爸：你的口红太红啦（已经有质的变化了，终于停止了复读行为）\n我：吃土色\n我爸：你怎么没涂嘴巴啊？\n阅读原文\n\n带着鼠标去网吧上网正常吗？\n\n红豆包麻糬，白痴\n阅读原文\n\n正常，不过玩完要记得带走，我已经丢了两个鼠标了。\n阅读原文\n\n柯南大结局灰原哀会被判刑吗?\n\n牧青绎，柯学无党派研究者-名柯全员伪粉\n阅读原文\n\n不会。\n题外话，要说到「违法犯罪」可不止灰原哀：\n少侦和阿笠博士，日常超载；\n江户川柯南，开滑板上街，人行道、公路、高速公路等等都走过，而且经常超速；\n工藤有希子，日常飙车；\n毛利兰，用武力胁迫他人，损毁公物，还用空手道制伏（误伤）和犯罪毫无关系的路人；\nFBI，非法在日本境内活动、持有枪支，等等；\n工藤一家和阿笠博士，藏FBI（易容、变声、提供住处）；\n降谷零（安室透），和工藤一家同理：作为公安警察，明知赤井秀一等FBI等探员在日本活动也不汇报上级，有故意包庇的嫌疑；\n毛利小五郎，乱指证犯人，对刑案指手画脚，妨碍警察侦查；\n铃木园子，与怪盗基德合谋偷自家东西；\n京极真，故意伤害（令我印象最深刻的就是「怪盗基德VS京极真」那里，把铃木家那十几个护卫全部打飞）；\n还有，柯南射毛利小五郎、铃木园子、山村警部等人，冒用他们的身份讲话；赤柯合伙焚烧楠田陆道的尸体，等等。\n就不知道日本法律怎么判了。\nPS：以上都是抖机灵瞎说，不要当真！\n另一个回答：\n假如，毛利小五郎一直都知道柯南的真实身份，你怎么看待他这样一个父亲？\n\n\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737409",
          "publishedOn": "2021-06-23T23:07:29.000Z",
          "wordCount": null,
          "title": "瞎扯 · 如何正确地吐槽",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737346",
          "author": null,
          "description": "壹心理，专业而有趣的心理服务平台，为大众心理健康提供解决方案。\n阅读原文\n\n没被夸大，只是被用错了。\n原生家庭的影响，就像一个人，一直觉得自己不舒服，很难受，却不知道是哪里痛，哪里有伤口，哪里曾经被人狠狠地打了几下，捅了几刀。\n我们本能的会去探究为什么会痛、会难过，问题究竟出在了哪里？\n有些人探索原生家庭的影响没用、甚至更颓废，是因为他们的探索是为了推责、开批判大会、找到人生问题的罪魁祸首。\n他们需要给自己一个理由：因为我原生家庭的 XX 问题，导致了我现在生活的不如意。\n进而，他们可以不为当下的生活与人生负责，不去努力和改变。\n毕竟对有些人来说，承担人生的责任与压力、努力改变，比忍受创伤和痛苦更可怕。 \n\n但如果探索原生家庭的影响不是为了逃避，而是直面过去的痛苦和创伤，进而理顺一团乱麻的、从未处理的各种情绪和故事，我们就能更好地面对未来的生活。\n那么，探索原生家庭的影响，具体都可以给我们带来怎样的改变呢？\n1.放下“不爱父母”自责和内疚\n在我们从小接受的教育下，孝顺和爱父母像是一个准则和道理，我们必须要做到。可对于很多人来说，这真的很难。\n我曾经有一个来访者小 J，她和父母的关系都一般，小时候父母常常争吵，重男轻女，也常常打骂身为女儿的她。\n现在她自己做点生意，经济状况是家里几个姐妹里最好的。\n父亲望子成龙却养出了一个没什么出息的儿子，还要求这个女儿能够对弟弟负起责任，带他做生意上路，以后可以自谋出路衣食无忧。\n来访者小 J 说，自己一和父亲说话就觉得父亲的情绪让她难以忍受。\n父亲就像个婴儿，他提的要求无论是什么总是要求别人必须去满足他：\n“我就算做一百件事，如果有一件事，没有做好，没有满足他的要求，他就会对我生很大的气，否定我、斥责我。”\n她和父亲不在一个城市，她不想给父亲打电话。因为一打电话，她就会觉得很难受。\n可是不打电话，父亲会责怪她不孝顺，家里亲戚也会对她有看法…",
          "link": "https://daily.zhihu.com/story/9737346",
          "publishedOn": "2021-06-22T23:07:17.000Z",
          "wordCount": null,
          "title": "这些年来，原生家庭的影响是否被过度夸大了？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737355",
          "author": null,
          "description": "邹钰莹，成都室内设计师Wechat：qiuku0512\n阅读原文\n\n有许多人都准备买房或者已经买了房子，对自己未来的家有一个大致的轮廓。第一次装修的朋友对装修更是一窍不通，装修需要注意的地方有很多，需要耐心的跟进装修进度。装修质量也直接关乎到今后的生活质量，所以我们在装修的过程中需要把好质量关，做好前期准备工作。那么装修前应该做好哪些准备工作?\n一．了解装修方式\n装修方式分为全包、半包、清包和套餐四种。\n1.全包是包工包料装修，所有材料采购和施工全部由施工方负责。是很省时省力的一种装修方式，但也是装修利润最大的一种装修方式。\n优缺点：全包相比于半包更贵一点。对于忙碌的上班族来说，是个省心的方法。设计、施工、选材都由一家公司负责，装修效果会更统一。不用管设计，也不用选购材料，但是有很多弊端。收费不合理，收费多，以次充好，偷工减料等。大多数上班族对装修材料价格、种类不了解，就算报多也不知道。所以，全包合同很重要，一定要看清楚。\n2.半包介于全包和清包之间，只负责施工和辅料，业主提供主料。\n优缺点：装修材料自己购买不用担心材料质量问题，但是要花时间跑材料市场，个人精力投入很多。主材提供不及时，有可能会延期施工时间。对装修材料不了解，也容易被建材商欺骗。\n3.清包是包工不包料装修，装修用的材料自己负责。\n优缺点：业主掌握主动权，施工环节自己把握。这种方式需要对装修材料和施工方面很熟悉，也需要了解材料市场行情。相当于整个装修必须亲力亲为。\n4.套餐装修就是套餐价格乘以建筑面积，得出最好装修费用。（含主材）\n优缺点：最大的亮点就是便宜，但很容易被套住，施工时有许多东西都不在套餐内，业主要拿钱贴上，隐形消费很多。\n二．协调好邻里关系\n开工之前通知邻居，楼上楼下，也好有个准备。因为装修的周期长，噪声大，对邻居的影响非常大。看有什么特殊情况，对工期进行调整，避开节假日和休息时间。\n三．了解材料市场，看装饰材料\n冒着小雨看材料\n逛建材市场时候尤其重要，记录装修知识，产品的价格或是厂商的联系方式，家里的设计，装修期间的花费等等，都要认真记录下来用作参考。最好是能记录下自己每一天的装修进度，花费情况，这样可以控制预算。要多考察新装修的邻居、朋友家的情况、了解材料市场，把握市场价格动态。\n四．了解装修公司、施工队、工作室\n1.装修公司\n装修工程比较系统化，业主省心，每个环节都有专业的人来负责，不会出现出现问题找不到人。装修公司接单量大，设计师对每个单子花的心思有没的工作室多。\n2.施工队\n施工队很多，一抓一大把。便宜当然是没得说，但设计根本发看。虽然主打施工为主、设计为辅。没有规范的施工要求，后期出现问题找不到人。\n3.工作室\n工作室是设计为主，施工为辅，或者不施工。有很多比较优秀的设计师个人开设的工作室，大都有着丰富的经验，注重美观度，风格大胆独特，对装修效果也很重视。每个项目都会负责到底，避免软装环节出现差错。对于追求生活品质的人来说，选择工作室是个不错的选择。\n五．与设计师出沟通\n1.给出详细的资料；家庭成员及年龄，职业，是否有老人，是否喂养宠物；\n2.功能需求及日常生活习惯；比如是否经常做饭、喜欢听音乐、沐浴、看书等等。多向设计师描述生活需求和状态，而不是告知设计师我想怎么做。把自己的需求、想法及与设计师的沟通结果用笔记本记录，便于后面回顾和总结以求在选择方案时做出平衡。\n3.确定一个大的方向。想要装出什么样的感觉，营造什么样的氛围。（例如严肃、庄重、亲切、大方、豪华、平实或妩媚、欢快、活泼等效果）。找一些自己喜欢的参考图，很多时候业主描述与设计师的理解并不会很默契的在同一个面上，所以图片是很直观的方式。 选择你喜欢的一个色彩，并不是说大面积应用这个色彩，设计师从色彩角度分析业主隐藏的一些需求。有利于之后的硬装和软装上面的设计，更贴合业主的喜好。\n4.对整体预算要有谱，预算的高低在一定程度上影响设计师能实现多少。一个好的设计方案是业主和设计师相互沟通配合完成的。业主与设计师，不仅是甲方和乙方的关系，更是合作关系。\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737355",
          "publishedOn": "2021-06-22T23:07:12.000Z",
          "wordCount": null,
          "title": "装修前应该做好哪些准备工作？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737364",
          "author": null,
          "description": "早知鸟，公众号：早知鸟飞行日记 写故事的地方\n阅读原文\n\n经过我在社会上多年的观察，我发现一个有趣的现象：在那些成功的精英人士当中，并不缺乏内向者，甚至内向的成功人士要比外向的成功人士数量更多，也就是说，性格不是成功的关键因素。\n比如商界名人当中，有马化腾、俞敏洪、张一鸣、马斯克；学术名人当中，过去有陈景润、和现在的北大数学天才韦东奕。\n这些名人的内向是众所周知的，也就是世人所认为的不善言辞，喜欢独处。但一点都不妨碍他们取得巨大的成就，不限于任何领域。大家可以通过查阅他们的百科或传记、演讲视频去了解一下，这里就不做赘述。\n在我看来，内向者的优势是完爆外向者的，核心在于你会不会利用好你的内向优势。你不需要去刻意改变自己内向的性格，因为人的性格是与生俱来的，刻意的改变往往会弄巧成拙，明智的做法是找到自己性格中的优势，然后扬长避短。上面列举的名人，无一不是学会了「扬长避短」。\n那么，内向者的优势是什么？\n一、有极强的延迟满足能力，可以专注做好暂时看不到反馈的事\n延迟满足是一项很强的技能，这一点内向者要比外向者表现得好。因为外向者的动力来自外界，比如外向者心情差的时候，会和朋友聚会、聊天、运动、打游戏，这些行为都属于即时回馈，付出就能得到回馈。比如叫一帮朋友去 K 歌，在 K 歌的过程中就能得到多巴胺的补充。所以，外向者更倾向于做那些能即时回馈的事情。\n内向者心情差的时候，通常会向内部寻找力量，比如独自在家看电视、阅读、整理房间、冥想等。这些行为得到的反馈并不明显，甚至在外向者看来就是一份苦差（比如整理房间），或者类似于修行，但在内向者看来，就是一种很好的放松方式。\n由于长时间的固定行为模式，内向者养成了更优秀的延迟满足能力，他们可以轻松地做那些「看起来乏味无趣的事情」，并坚持较长的时间。而这些基本都不能引起外向者的兴趣。\n比如学习这件事，我们都知道著名的学习金字塔理论，学习难度跟…",
          "link": "https://daily.zhihu.com/story/9737364",
          "publishedOn": "2021-06-22T23:07:06.000Z",
          "wordCount": null,
          "title": "在这个外向者更吃香的社会里，内向者拿什么做优势？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737370",
          "author": null,
          "description": "配方师Gigi，配方师/药学硕士\n阅读原文\n\n我屡次告诉大家，防晒或者粉底液其实很好洗，用 22 元的旁氏氨基酸洗面奶差不多就全部洗掉了。但仍然有妹子不放心啊，今天我搬出来实验室的几台仪器，用数据和图片说话，让大家眼见为实。\n左边的 HIROX 已经给大家介绍过，右边两个是德国 CK 公司推出的高科技皮肤测试仪器，能够准确量化测试皮肤的各种参数，如油脂、水份、黑色素、血红素、弹性强弱等，及时发现皮肤存在的各种问题。这三台仪器，加起来也价值小 100 万人民币了。\n\n一，多合一洁面产品能够洗掉底妆产品吗？-- 能！能！能！\n现在很多洁面产品都宣称具备卸妆功能，可以有效卸除防晒产品，以及粉底液，BB 霜，隔离霜等底妆，无需二次清洁。很多知友都想知道，这些产品，价格很便宜，超市开架货，真的能把底妆卸除干净吗？\n一般来讲，粉底液里面含有大量的粉体，比隔离霜，妆前乳，BB 霜，气垫 BB 等产品难洗。也是大家最担心卸不干净有残留的。我们拿蜜丝佛陀的粉底液当样板，这款粉底液热度比较高，价格不贵。并且算是持妆相对久的，也比较难卸妆。我们用碧柔的卸妆洁面乳来洗，给大家展示一下结果。\n 皮肤看起来平整，其实充满了纹理沟壑。颜色深的地方是毛孔。涂抹粉底液之前粉底液涂抹后，填充在皮肤的沟壑纹理。虽然局部放大有点恐怖，但皮肤肉眼看起来光泽匀净用碧柔卸妆乳洗完后，沟壑里的粉底液都被洗掉了。\n我还用相宜本草的芯净自然净妆洁面两用乳做了同样测试，结果也是一样。\n\n看到了吧？用卸妆洁面多合一的洗面奶，完全可以把粉底液洗干净。\n二 ， 卸妆洁面二合一产品把安耐晒小金瓶也能洗干净\n仍然有妹子问防晒霜能不能洗干净，理由是防晒霜用量大。于是再次挑战最高难度，我们找来了 2018 版的安耐晒小金瓶，号称防水耐汗，在脸上固若金汤。实验结果如下：\n涂抹安耐晒之前之前，皮肤的沟壑纹理涂抹安耐晒后，皮肤有轻微泛白和油光用碧…",
          "link": "https://daily.zhihu.com/story/9737370",
          "publishedOn": "2021-06-22T23:07:03.000Z",
          "wordCount": null,
          "title": "洗面奶和卸妆油，如果只用一个，能把脸洗干净吗？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737328",
          "author": null,
          "description": "如果我在大专期间获得了诺贝尔奖，能被保送研究生吗？\n\n大理想家，咨询请使用值乎，接收商业合作。其他请发邮件。\n阅读原文\n\n两个农夫聊天。\n“你说你要是当上皇帝了，你要干嘛？”\n“嘿嘿，那我得用金锄头锄地！”\n阅读原文\n\n香奈儿推出 AirPods 保护套，售价约 17300 元，有什么亮点？你愿意买吗？\n\nBohnaBohna\n阅读原文\n\n为了保护一个售价 1599 的 airpods pro，买一个 17300 元的香奈儿保护套。\n我提议，给这个 17300 的香奈儿保护套再做一个保护套，一定能大卖。\n阅读原文\n\n男生看到女朋友对自己撒娇是什么感觉？\n\n楚楚楚楚，喜欢吃肉还要减肥一路变胖\n阅读原文\n\n买，吃，好，行。\n阅读原文\n\n如何激怒一位俄语学习者？\n\n一松，学生\n阅读原文\n\n激怒？哈哈哈哈哈太天真了吧！\n\n\n您觉得我学了俄语还有脾气吗？\n\n\n\n阅读原文\n\n爸爸对我的网名头像发起了进攻，家长中意的到底是什么样的？\n\n杨雨欣，一条快乐的咸鱼\n阅读原文\n\n用敌人的逻辑打败敌人：）\n\n以胡扯对胡扯，以迷信对迷信！\n让对方无言以对\n\n今天看到一个更秀的朋友！放出来给大家观摩一下，大家快拿出小本本记重点！\n\n\n\n阅读原文",
          "link": "https://daily.zhihu.com/story/9737328",
          "publishedOn": "2021-06-22T23:06:56.000Z",
          "wordCount": null,
          "title": "瞎扯 · 如何正确地吐槽",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737292",
          "author": null,
          "description": "简单心理Uni，学心理咨询，到简单心理Uni\n阅读原文\n\n在情感勒索的关系中，我们以（牺牲）自己的需要为代价，去关注别人的需要。通过对别人的让步，我们为自己制造了一个短暂的安全假象，使我们得以栖身其中聊以自慰。我们避免了冲突和对立，但同时我们也失去了一个建立健康关系的机会。\n——《情感勒索》作者苏珊·福沃德博士\n\n什么是情感勒索？\n日常生活中，我们有时难以直接向别人提出要求，也会耍一些操纵的小把戏，比如说：“哎呀，要是有人把窗子打开就好了。”而不是说：“能请你把窗子打开吗？”这些小把戏只要没给双方带来不适，其实也无伤大雅。\n而从日常的操纵转变为极其有害的行为，有一条清晰的界限。即：“以我们的意愿、健康和快乐为代价，不断地利用操纵的手段来迫使我们妥协，满足他们的要求，操纵就变成了情感勒索。”\n因为情感勒索者深知我们有多珍视我们与他们之间的关系，了解我们的弱点，甚至熟谙我们心底的秘密。一旦他们自己的需求未被满足，就会利用掌握的隐私来威胁我们，以让我们妥协和让步。\n所以你会观察到，情感勒索有 6 大典型症状：\n要求 ：勒索者根据自己的需求向勒索者提出要求。\n抗拒 ：被勒索者认为要求不合理，感觉不舒服和抗拒。\n压力 ：勒索者对被勒索者施加压力。让被勒索者感到恐惧、内疚或者认为按照勒索者说的做，是自己的义务。\n威胁 ：在遭到被勒索者拒绝后，勒索者威胁对方。如：分手。\n屈服 ：为了缓解自己内心的焦灼（可能是恐惧、内疚和义务感带来的压力），被勒索者压抑自己的需求，屈服于勒索者。\n重复 ：需求、施压、屈服的关系模式奠定下来，并一而再再而三地上演。不过，很多现实生活中的情感勒索，要比保罗对待弗雷迪的伎俩来的更加隐晦，不易察觉。这是因为“情感勒索者会释放出厚厚的迷雾（FOG），来掩盖他们的行为，因而几乎不可能看出他们是如何摆布我们的”。FOG 就是情感勒索者的勒索工具。\n\n情感勒索者的工具：F…",
          "link": "https://daily.zhihu.com/story/9737292",
          "publishedOn": "2021-06-21T23:08:46.000Z",
          "wordCount": null,
          "title": "当父母提出不合理的要求时，该如何有效地拒绝？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737302",
          "author": null,
          "description": "知乎用户，风恬浪静 吹倒南墙\n阅读原文\n\n「一个父亲能为孩子做的事情有很多，其中至关重要的，是爱孩子的母亲。」\n前段时间听了 Michael Meaney（麦吉尔大学 Professor of Psychiatry）的讲座，这句话令我印象深刻，也深以为然。\n讲讲婚姻质量和育儿的关系吧~刚好最近父亲节，所以侧重父亲的角度。先上发展心理学干货，再讲我天天发狗粮的爹妈。\n这个问题有两部分，我答前半段——充满爱的家庭能给孩子带来什么。\n至于能否通过后天获得...这个问题有点泛，说实话能写一本书。证明「孩子能不能靠自己治愈原生家庭」的长期纵向研究，其实不多。据我观察，我爸靠自己的努力治愈了原生家庭，但因为没有足够的文献支撑，所以我不敢妄言。\n充满爱的家庭能给孩子带来什么？\n一句话概括答案：婚姻的不和谐，严重影响育儿质量，育儿质量进而影响孩子多种能力的发展，语言，认知，情绪，社交，心理健康，数不胜数。\n探讨婚姻和谐和育儿质量的心理学理论有很多，篇幅所限，我只讲两个：interparental conflict spillover cascade（婚内冲突的溢出效应）和father vulnerability hypothesis（父亲脆弱假说）。\n（不清楚中文翻译准不准确，敬请同行指正）\n婚内冲突的溢出效应是指，有些父母会将婚姻里的不幸和冲突转嫁到孩子身上（当然不是所有），有时明知故犯，有时不由自主。通俗地说，就是「拿孩子撒气」。[1]\n比如，「我和你爸没离婚，都是为了你。」「要是没你，我早把你妈甩了，过得比现在好多了。」\n比如，「我打不过你爸，就打你。」「我骂不过你妈，就骂你。」\n父亲脆弱理论是指，不和谐的婚姻，对父亲育儿质量的影响，比对母亲的影响更大。[2]\n（注意：这个假说有争议，有一些数据支持，也有些实验未能重复。[3]）\n父亲为什么「脆弱」？\n原因有很多：\n1. 社会对于「母…",
          "link": "https://daily.zhihu.com/story/9737302",
          "publishedOn": "2021-06-21T23:08:40.000Z",
          "wordCount": null,
          "title": "充满爱的家庭能给孩子带来什么？这些能否通过后天获得？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737306",
          "author": null,
          "description": "空白白白白，不接商业广告不做付费咨询，勿扰。公众号：空白女侠\n阅读原文\n\n我身边的人对我的一致评价是：最会做向上管理的人。 \n我步入职场 8 年，目前是一家私募基金的投资副总监，很多人感叹于我的职业晋升如此之快，在 30 岁的年纪就已经进入管理层。但其实早在我 26 岁的时候，我就作为商业分析部门负责人，开始管理一个数据团队了。那有小伙伴可能会问，是不是我工作以及学习能力特别突出，所以即便跨越领域，还能担任管理者？\n其实不然，我个人觉得自己是曾国藩那种喜欢”打呆仗“的人，学习能力还行，工作能力过得去，再加上了点运气就到现在这样的状态。\n不过值得我骄傲的 是，我与我的每一任领导，都能相处得很好，直到现在都和他们每个人都保持着联系，他们也都愿意在我遇到瓶颈或者困境的关键时刻帮我破局。而且在职场中我从来不主动提加薪升职，基本都是我的领导帮我争取。确切的说不是我不主动，而是我会引导领导，帮我达到目标，只是我不会开这个口。我自认为我最厉害的职场竞争力之一就是向上管理能力。\n大家可以观察那些从一线员工一步一步走上高管位置的人，绝对深谙向上管理之道。原因是你做任何事，任何重要的项目无一例外都需要上头老板的支持，越是级别高的人，越是懂得这个道理。\n此次我把我这 8 年向上管理的心得，分享给大家。文章有点长，需要大家好好体会，或许这篇文章会助你开启一段全新的职场旅程。\n对每一位职场人士而言，领导都是对其职业生涯发展影响最大的人。遇到一名好的领导可能会极大的助力职业发展；如果遇到一名不好的领导，可能会对职业发展产生极大的阻塞。在现实中，我们常常会发现职场上“混的好”、”走上高层“的人并不一定都是能力超群的人。但他们一定通晓与领导的相处之道，懂得如何影响自己的领导，为自己创造最好的条件。这种影响自己领导的过程，我们称之为向上管理。\n有些不懂向上管理的小伙伴，看到这里往往会有点愤愤不平。大家会觉得…",
          "link": "https://daily.zhihu.com/story/9737306",
          "publishedOn": "2021-06-21T23:08:34.000Z",
          "wordCount": null,
          "title": "如何看待职场中的「向上管理」？",
          "itunes": {}
        },
        {
          "id": "https://daily.zhihu.com/story/9737316",
          "author": null,
          "description": "死者代言人，为死者代言，替逝者发声。\n阅读原文\n\n刚在看法医秦明，中间有提到师傅问如何检验这是鸡爪还是人手？秦明回答是查 DNA。\n但是高温油炸 DNA 不会断裂吗?\n通常来讲没啥问题的~~~~\n一方面 DNA 比想象中耐操的多，另一方面 DNA 的检验手段也和很多人想象的并不一样。\n看到有回答表示：\nDNA 在高温下只会解旋，温度降低还会复性。\n我想说，那得看这个“高温”有多高。\n要是按照对人体来讲一般意义上的高温，比如 90℃，这个温度下 DNA 确实主要是解旋变性，之后一定条件下降温就还能重新旋起来。。。。这也是 PCR 技术中重要的两个步骤。\n然而，题目问的都已经是“油炸”了。\n通常，食用油的温度可以达到 250~300℃左右，不同类型的油温度有差异，但是差不了很多，再高就要起火了。。。\n一般油炸的时候，就算不达到 300℃，那显然也要高过 100℃的。。\n那么我们就算顶格：在 300℃下油炸尸体，DNA 会怎么样？法医还能不能检验？\n\nDNA 比想象中耐操\n我们先需要一点关于 DNA 的基础知识来更好的理解这个问题，基础知识很重要：\n通常而言，提到 DNA 首先想到的都是“双螺旋结构”，这当然没错，但是这个结构仅仅是 DNA 三级分子结构中的第二级而已。\nDNA 的一级结构是脱氧核苷酸的排列顺序，因为组成脱氧核苷酸的戊糖和磷酸是一样的，区别只是在于上面所连接的碱基，也就是高中生物就会讲到的 A（腺嘌呤）、G（鸟嘌呤）、C（胞嘧啶）和 T（胸腺嘧啶）四种碱基，所以可以用碱基的顺序代表核苷酸的顺序。\n所以，DNA 的一级结构可以理解为 AGCT 四种碱基的排列组合顺序。这种顺序表现出来是一个“线性”的，类似“TCTATCTGTCTGTCTGTCTATCTATCTATCTA”这种一个大链子。\nDNA 的二级结构就是大名鼎鼎的“双螺旋结构”。也就是有互补关系的两条上面那种…",
          "link": "https://daily.zhihu.com/story/9737316",
          "publishedOn": "2021-06-21T23:08:30.000Z",
          "wordCount": null,
          "title": "高温油炸过后的尸体还能检测出 DNA 是什么原理?",
          "itunes": {}
        }
      ]
    },
    {
      "title": "DockOne.io",
      "feedUrl": "https://rsshub.app/dockone/weekly",
      "siteUrl": "http://weekly.dockone.io",
      "articles": [
        {
          "id": "http://weekly.dockone.io/article/2434397",
          "author": "阿娇",
          "description": "日常工作中在集群上的操作非常多，今天就来介绍我所使用的工具。\nkubectl-alias\n使用频率最高的工具，我自己稍微修改了一下，加入了 StatefulSet 的支持。\n这个是我的 https://github.com/addozhang/kubectl-aliases，基于 https://github.com/ahmetb/kubectl-aliases。\n比如输出某个 Pod 的 json，kgpoojson xxx 等同于 kubectl get pod xxx -o json。\n结合 jq 使用效果更好。\n语法解读：\n\nk=kubectl\nsys=--namespace kube-system\n\n\ncommands：\ng=get\nd=describe\nrm=delete\na：apply -f\nak：apply -k\nk：kustomize\nex：exec -i -t\nlo：logs -f\n\n\nresources：\n\npo=pod，dep=deployment，ing=ingress，svc=service，cm=configmap，sec=secret*，ns=namespace，no**=node\nflags：\n\n\noutput format：oyaml，ojson，owide\nall：--all or --all-namespaces depending on the command\nsl：--show-labels\n\nw=-w/--watch\nvalue flags（should be at the end）：\n\n\n•n=-n/--namespace\nf=-f/--filename\nl=-l/--selector\n\nkubectx + kubens\n安装看这里：\nkubectx 用于在不同的集群间进行快速切换。假如用 kubectl，你需要：\n# context 列表\n\n\n\n\n\nkubectx-demo\nkubens 就是在不同 namespace 间快速切换的工具。用 kubectl 的话，需要：\n# namespace 列表\n\n\n\n\n\nkubens-demo\nk9s\n没错，只比 k8s 多了个 1 。\nk9s 提供了终端 UI 与 Kubernetes 集群进行编辑交互。本人常用的比如：\nF 配置端口转发\nl 输出 Pod 日志\ne 修改资源对象\ns Pod 终端交互模式\ny yaml 方式输出资源对象\nd describe 资源对象\nctrl+d 删除 Pod\n\n启动方式：\n# 指定 namespace 运行\n\n\n\n\n\nk9s-pod\n键入问号“?” 就可以打开快捷操作指引。\n\n\n\nhelp\nstern\nstern 可以用来 tail 集群上的多个 Pod 和 Pod 中多个容器的日志。不同的 Pod 和容器以不同的颜色区分，方便 debug。\n比如使用命令 stern -l tier=control-plane -n kube-system 可以输出 kube-system 命名空间下控制平面（label 为 tier=control-plane） Pod 的日志。\n\n\n\nstern-control-plane\n命令行选项：\nTail multiple pods and containers from Kubernetes\n\nLens\nLens 是用来控制 Kubernetes 的 IDE，开源且免费。\n消除了集群操作的复杂性、提供了实时的可观察性、方便故障排查、支持多系统的桌面客户端、兼容多种集群。\n\n\n\nLens\nInfra App\nInfra App 跟 Lens 差不多，UI 较 Lens 好些，但是功能就弱很多，类似 Lens 的只读模式。\n免费版比收费版的区别只在于支持的集群数量，免费版只支持一个集群。\n\n\n\nInfra\nkubefwd\nkubefwd，这个一直有安装但是使用次数寥寥，因为应用之间的访问没有走 service，不过偶尔做些实验的时候会用的上。\n\nkubefwd 是一个用于端口转发Kubernetes中指定namespace下的全部或者部分pod的命令行工具。kubefwd 使用本地的环回IP地址转发需要访问的service，并且使用与service相同的端口。kubefwd 会临时将service的域条目添加到 /etc/hosts 文件中。\n启动kubefwd后，在本地就能像在Kubernetes集群中一样使用service名字与端口访问对应的应用程序。\n\n\n\n\nkubefwd_ani\n\n\n\n\n总结\n善用工具可以提升效率，但并不是不可或缺的。\n如果你有其他的工具，欢迎留言提出。\n原文链接：https://mp.weixin.qq.com/s/uU2zmT5yyVcKZ5XmLSRqtg",
          "link": "http://weekly.dockone.io/article/2434397",
          "publishedOn": "2021-07-05T00:20:17.319Z",
          "wordCount": 586,
          "title": "常用的几款工具让 Kubernetes 集群上的工作更容易"
        },
        {
          "id": "http://weekly.dockone.io/article/2434396",
          "author": "博云BoCloud",
          "description": "本期与大家共同探讨微服务当下最新的框架 —— ServiceMesh 。\n微服务框架\nServiceMesh的特点\n\n\n\n\n传统微服务框架以 SpringCloud 为例，开发的时候需要引入 SpringCloud 相关的所有依赖，也就是将通信部分包到了引入的依赖（SDK）里，当然这也考验开发人员的能力，需要开发人员熟悉 SpringCloud 框架才能用，并且目前只支持 Java 语言。服务网格类的框架，说来也简单，就是把上面的 SDK 拿出来，单独运行，只要能实现该 SDK 的功能，目的也就达到了，而抽出来单独运行的 SDK 称之为 Sidecar，在服务网格的管理中属于数据面的管理。\n性能是不是服务网络最大的挑战？\nSidecar->Sidecar->B 服务，这样好比是中间换乘了两次公交，这样算来延迟可增加不少，几近于原来的三倍？\nB的网络通信时间，网络畅通的情况下，不超过0.1ms；\n这样算下来，A->B的微服务调用，从 A 出口算起到 B 处理完成，粗略的估计是12.1ms，我们再来看A->Sidecar->Sidecar-B的业务处理，大概需要花费的时间：\n意料之外，情理之中\n总结\n服务网格从 2010 年就被提出，到 2017、2018 年的时候就普遍受到了技术人员的关注，2020 年也被叫做是服务网格落地的元年。了解了服务网格的原理，也就普遍能被市场所接受了，毕竟核心的技术也就在于 API 网关上，而 API 网关又是一个已经完全成熟的一个技术。所以如果现在做微服务化的转型，ServiceMesh 也是值得考虑的一种技术规范。\n在接下来的文章中，我们会将 API 网关、Mesh、Sidecar 做一个统一的介绍和对比，敬请期待~",
          "link": "http://weekly.dockone.io/article/2434396",
          "publishedOn": "2021-07-03T00:20:54.342Z",
          "wordCount": 224,
          "title": "2021值得考虑的一类新型微服务架构：ServiceMesh"
        },
        {
          "id": "http://weekly.dockone.io/article/2434387",
          "author": "阿里巴巴云原生",
          "description": "畅捷通公司是用友集团旗下的成员企业，专注于服务国内小微企业的财务和管理服务。一方面，畅捷通将自己的产品、业务、技术架构互联网化；另一方面，畅捷通推出了畅捷通一站式云服务平台，面向小微企业提供以数智财税、数智商业为核心的平台服务、应用服务、业务服务及数据增值服务，致力于建立“小微企业服务生态体系”。\n根据易观国际的报告，目前畅捷通在国内小微企业云服务市场的覆盖率保持第一。有超过 130 万家企业与机构通过使用畅捷通的软件及服务，实现降本提效、持续创新、数智化转型。\n早期，畅捷通的业务应用都是构建在公司自主研发的 CSP 平台之上，包括客户管家、易代账、好会计和好生意等，每个企业分配一个独立的虚机，资源完全隔离，初期该平台方案极大简化了开发的复杂度，提高了开发效率，满足公司向云服务发展的最初需求。\n新的需求\n​\n随着用户规模的增多，现有为每个用户分配一个独立虚机的方案产生的问题很突出。首先体现在虚机的数量日益庞大，在客户转换率不高的情况下，容易造成资源的浪费，同时运维成本也偏高；其次，不同的用户软件迭代的版本不尽相同，还需要专门设计维护多套版本的补丁更新系统；第三，产品需要停服上线，业务会出现短暂不可用的情况；最后，如果若干用户的业务出现高峰期，不能快速弹性扩容，资源的利用率不高。\n在此背景下，畅捷通研发团队决定尝试当前业界比较通用的云原生架构设计方案，利用云上的基础设施，共享计算资源和存储资源，采用容器化方案，快速弹性扩容，利用微服务架构，按应用更新产品，彻底解决当前运维成本偏高、弹性不足、资源利用不均衡的问题。\n小微企业的特点是数量多、单个企业业务量相对较小、企业 IT 能力有限。以畅捷通好生意产品为例，采用现有的云原生架构，能够方便畅捷通快速开发出一款应对大规模小型用户，支持弹性可扩展的 SaaS 应用。同时通过服务的编排，又能快速搭建出其他产品线，如智+。目前已经有超过…",
          "link": "http://weekly.dockone.io/article/2434387",
          "publishedOn": "2021-07-01T00:23:41.661Z",
          "wordCount": 619,
          "title": "深度解读畅捷通云原生架构转型实战历程"
        },
        {
          "id": "http://weekly.dockone.io/article/2434388",
          "author": "guoaaaad",
          "description": "从一个小故事开始\n你是一个高级开发工程师。\n某天，你自信地写好了 自动煮咖啡  功能的代码，并在本地调试通过。代码合并入主干分支后，你准备把服务发布到测试环境，进入提测流程。\n你熟练地打开项目协同，新建了一个发布工单给运维同学，详细备注了需要发布的代码分支，并特别强调这次需要专门新增一个开关 AUTO_MAKE_COFFIE_``ENABLED``=true。\n过了一段时间，工单处理完成，测试同学开始测试。\n突然，噩耗传来：你的项目协同里出现了几个 Bug。\n你很疑惑，为什么本地完美运行的代码，在测试环境被提了这么多 Bug ？\n你开始怀疑代码中某个地方的逻辑有问题。可仔细排查后却仍然定位不到问题。\n最后，你终于发现，是运维同学复制环境变量时少复制了一个字母：\n关 AUTO_MAKE_COFFIE_``ENABLE``=true，ENABLED 少了一个 D。\n上面这种情况是不是很熟悉？虽然不是你的锅，却拖慢了你成为十倍程序员的进度。\n那么，该怎么避免呢？  \n你一定在想：要是没有手工复制操作就好了。那就要有个地方来保存你的配置，但是你没有权限、也不想登录到运维操作平台自己粘贴配置。\n你灵光一现：要是和运维同学约定好一个配置文件，把部署配置也提交进代码里，运维同学从文件里读取应用环境配置，问题就迎刃而解了。\nIaC 是什么\n在上面的故事里，这个特殊约定好的配置文件就是这个应用基础设施的一部分（IaC 中的 I）。\n我们该怎么理解基础设施呢？一个稍微复杂点的应用，只有代码是无法运行起来的，因为它还有很多环境依赖需要被准确描述，比如需要运行环境有 make、git 等指定的命令行工具，依赖了哪些中间件等。\n因此，产品团队在实施持续交付的过程中，必须考虑将基础设施的维护纳入进来，作为支持产品运行的一部分。\n同时，技术的快速进步和演化，也使得基础设施的配置不得不频繁变化。在这种快速…",
          "link": "http://weekly.dockone.io/article/2434388",
          "publishedOn": "2021-07-01T00:23:41.165Z",
          "wordCount": 231,
          "title": "云原生时代，为什么基础设施即代码（IaC）是开发者体验的核心？"
        },
        {
          "id": "http://weekly.dockone.io/article/2434389",
          "author": "JetLee",
          "description": "背景\n随着CoreOS 、Kubernetes 、CoreDNS、Vulcand等项目在开源社区日益火热，它们所用到KV存储中间件etcd，渐渐为开发人员所关注，etcd采用Go语言开发，作为一个高可用强一致性的服务发现存储仓库，深受Gopher的喜爱。越来越多的团队使用etcd进行配置管理以及服务发现，随之而来的是安全问题，etcd中敏感配置信息，如数据库密码、PrivateKey、SecretKey、Kubernetes集群数据等，如果被攻击者窃取会造成严重影响。\n本篇文章起源于一次公司内网渗透，探测到某部门的服务器开启了etcd服务，使用etcd作为应用的配置中心，随即利用etcd配置不当的未授权安全问题，获取到库中某关系数据库地址、帐号密码，进而入侵到该关系型数据库。为什么安全漏洞、安全事件频出由此足见端倪，一小部分的开发或者运维同学，还停留在“能用”的想法，只关注可用、可运维，并没有进一步了解其安全问题，甚至官方文档中安全部分的介绍可能也都是跳过。本篇文章前半部分会以“安全开发”的视角，详细描述etcd的安全实践。后半部分会切换到“安全工程师”的视角，探究etcd安全风险检测。\n\netcd简介\netcd诞生于CoreOS公司，它最初是用于解决集群管理系统中OS升级的分布式并发控制以及配置文件的存储与分发等问题。基于此，etcd被设计为提供高可用、强一致的小型key value数据存储服务。项目当前隶属于CNCF基金会，被AWS、Google、Microsoft、Alibaba等大型互联网公司广泛使用。\netcd项目地址：https://github.com/etcd-io/etcd\n\n\n\n图1 etcd架构解析\n项目历程：\n2015年2月份，etcd发布了第一个正式的稳定版本2.0。在2.0版本中，etcd重新设计了Raft一致性算法，并为用户提供了一个简单的树形…",
          "link": "http://weekly.dockone.io/article/2434389",
          "publishedOn": "2021-07-01T00:23:40.730Z",
          "wordCount": 628,
          "title": "从安全的角度谈谈etcd"
        },
        {
          "id": "http://weekly.dockone.io/article/2434390",
          "author": "老马",
          "description": "我在 Shopee 维护一个 Service Mesh 系统，大部分的 RPC 调用要经过这个系统，这个系统每分钟要处理上千万的请求。我们在本文中就把它叫做 Oitsi 系统吧，方便描述一些。干的事情其实和 Istio 是差不多的。\nOitsi 将对 RPC 调用设置了很多错误码，类似于 HTTP 协议的 404, 502 等等。Application 报出来的错误码在一个区间，Oitsi 内部产生的错误在另一个区间，比如 0-1000，类似于 System Internal Error，监控这些错误码可以让我们知道这个系统的运行情况。\n这个系统自从接手之后就有一个问题，就是它每时每刻都在报出来很多内部错误，比如发生内部超时，路由信息找不到，等等，每分钟有上万个错误。然而，系统的运行是完全正常的。\n\n\n\nOitsi 系统在正常情况下的错误\n从这个脱敏之后的监控可以看到，经常有一些错误一下子动辄上万，除了图中几 K 的那些错误，在 1K 以下有更多密集的错误，只不过它们都被其他巨量的错误给拉平了，在这张图不明显。\n这就给我们造成了很多问题：到底是 Oitsi 真出了问题，还是属于“正常的错误”？很难判断，每次发生这种情况都费时费力。大部分情况都是排查一番，然后发现是用户“滥用”造成的问题，不需要关心。而它又掩盖了很多真实的问题，比如一个新的版本发布之后偶尔会有一些内部的错误，是不应该发生的，却被真实的问题掩盖住了。基于这样的监控数据我们也无法设置告警，因为这些噪音太多了，即使有告警，也和没有一样。\n这让我想起之前在蚂蚁的工作，我们有类似的问题。我有一年多的时间都在一个叫做“故障定位”的项目上。在蚂蚁我们也有很多告警（99%的）都是无效的，给 On Call 的同事带来很多噪音和打扰。在蚂蚁的思路是：开发一个“智能系统”（AI Ops），当告警发生的时候，自动地判断这个告警是不…",
          "link": "http://weekly.dockone.io/article/2434390",
          "publishedOn": "2021-07-01T00:23:40.626Z",
          "wordCount": 261,
          "title": "从源头解决 Service Mesh 问题最彻底！"
        },
        {
          "id": "http://weekly.dockone.io/article/2434394",
          "author": "大卫",
          "description": "记录一下笔者关于软件设计的一些相关认知。在开始之前，先引入两个概念目标和途径（这里可能会有些咬文嚼字，不过主要是为了区分主观和客观的一些细微差异）。\n目标和途径\n我们在做某一件事情的时候，总是会带有一定的目的性的：比如说一日三餐，是为了给身体补充所需的能量。那么这三餐具体如何落实呢，则会有多种多样的方式。比如你可以选择吃碳水食物、蔬菜、肉类、牛奶或者蛋类等等；也可以选择通过静脉注射一些所需的葡萄糖或者蛋白质。总之，能够为身体补充能量就可以了。\n目标\n那么在上述的小例子中，我们的目的就是给身体补充能量，用以维持正常的生命活动所需。当然也可以说是我们的目标，不过目标侧重于过程，目的则更强调结果。\n途径\n从上面的例子中可以看出有多种方式可以达成我们的上述目的。其中每一种方式都是一条达成目的的途径，当然我们为了补充均衡的能量，通常会搭配组合几种不同的食物，我把这个称之为手段或者方法。手段和方法带有一定的主观性；而途径则是在描述客观的可供选择的一种方式。\n2 软件的目的\n在开始讨论软件设计之前先问自己一个最基本的问题：我们为什么需要软件？\n笔者认为是为了解决现实中某个领域的相关问题而存在的。就好比最初的计算机是用来计算导弹的弹道的。生活中常用的QQ和微信是为了满足人们的社交通信需求的，淘宝京东等是满足了人们的买买买的需求。\n所以，软件存在的目的就是它能解决一些领域的相关问题，这是它存在的唯一理由。\n\n比如在黑客帝国这部电影中，不再被使用的程序只有一个下场，那就是被删除掉。\n3 软件设计的目标\n假如一开始就有了软件，其实要不要软件设计都不重要了。但是问题在于软件不是凭空产生的，不是从0到1没有中间过程就直接得到了想要的软件的。在软件从0到1的过程，就是软件设计的作用范围（所以在这里我用软件设计的目标这个概念）。因为软件存在的目的在于它能解决一些领域的相关问题，那么首先对软件的最低要求就…",
          "link": "http://weekly.dockone.io/article/2434394",
          "publishedOn": "2021-07-01T00:23:40.610Z",
          "wordCount": 237,
          "title": "软件设计的目标和途径"
        },
        {
          "id": "http://weekly.dockone.io/article/2434392",
          "author": "玻璃樽",
          "description": "前言\n刚看别人使用Docker的时候有很多不解，为什么要用Docker，Docker怎么用？Docker配置为什么这么难？为什么网络访问不通？等等因素阻碍了笔者学习Docker？其实笔者也很笨，有很多思考不清晰的点。顺便也分享下。\n学时疑惑：\nQ：我一套服务为什么不放在一个容器里面（Java、MySQL、Nginx、Redis等）？\nQ：Docker能放到生产环境吗？\n基本命令\n下载镜像\n# 以Redis为例子\n\n运行镜像\ndocker run \\\n\n进入容器\n第一种（不推荐，当退出容器使用exit命令时，会停止这个容器）：\ndocker attach 容器id\n\n第二种：\ndocker exec -it 容器id /bin/bash\n\n暂停容器\ndocker stop 容器id\n\n启动容器\ndocker start 容器id\n\n查询容器列表\ndocker ps -a # 查看所有容器\n\nrun和start的区别：\nrun是创建一个新的容器\nstart是把已经创建好的容器启动\n\n查看容器信息\ndocker inspect 容器id\n\n挂载\n挂载介绍\n容器里面的文件都是在容器内部，而跟你当前电脑是没有关系的，如果删除了容器怎么办？但是资料又想保存就像MySQL一样，我只是换一台电脑就要把整个容器复制过去，太麻烦了！所以需要把容器的文件跟当前主机文件作为一个映射。\n命令教程\n参数-v宿主机路径:容器路径\n# 以MySQL为例子\n\n为什么要知道这么多路径或者参数\n每个中间件或者一个数据库容器，他可能需要有很多配置，例如密码，持久化文件的路径等等。那我们怎么知道路径是什么：\n可以进hub.docker.com找到自己需要的容器然后看文档\n进容器找了（这个方法有点笨，笔者一开始就是这么找到的。）\n\n网络\n容器之间怎么进行通讯\n容器虽然是能相互通讯的，但是容器每次重启ip都跟上一次不一样，所以这样通讯会很复杂。\n示范\n# 先拉个CentOS镜像下来\n\n截取一些容器信息下来：\n[\n{\n\ndocker inspect centos2_id\n\n[\n\n\n以上centos1 ip为172.17.0.4\n以上centos2 ip为172.17.0.5\n\n解决问题\ndocker network create centos-network\n\n这样就可以解决每次容器重启后ip不一致问题。\n小结\n其实在刚使用容器的时候会很麻烦：\n不知道Docker的命令和容器需要的参数\n每次都要上官网找下有什么参数或者百度，但相比每次下载文件下来，进去配置省很多力气，并且配置一次保存好用过的命令，以后都可以用了，不需要再重复去改很多东西  \n其实在一些小型公司，没有专业的运维的话尽量不要在生产环境上使用Docker，不然真的出现问题的话会很头疼，不仅仅要维护项目，还要维护Docker\n\n原文链接：https://juejin.cn/post/6974427129748389902，作者：Kakki",
          "link": "http://weekly.dockone.io/article/2434392",
          "publishedOn": "2021-07-01T00:23:40.598Z",
          "wordCount": 333,
          "title": "Docker基本使用命令"
        },
        {
          "id": "http://weekly.dockone.io/article/2434393",
          "author": "Rancher",
          "description": "前  言\nRancher 作为一个开源的企业级 Kubernetes 集群管理平台。你可以导入现有集群，如 ACK、TKE、EKS、GKE，或者使用 RKE、RKE2、K3s 自定义部署集群。\n作为业界领先的多集群管理平台，Rancher 可以同时纳管上千个集群和上万个节点。同时，大家也不必担心运维管理大规模集群和节点会增加额外的负担，社交通讯软件LINE 5 个人就足以管理 130 个集群的 2000 个节点。\n如何在 Rancher 中管理大规模的集群和节点这次暂且不谈，之前已经介绍过很多次了。今天我们只聊如何在单个集群中管理大规模的项目、命名空间等资源。\n如何在单个集群中管理大规模的项目和命名空间\n\n命名空间：命名空间是 Kubernetes 的一个概念，它允许在一个集群中建立一个虚拟集群，这对于将集群划分为单独的“虚拟集群”很有用，每个虚拟集群都有自己的访问控制和资源配额。\n\n项目：一个项目就是一组命名空间，它是 Rancher 引入的一个概念。项目允许您将多个命名空间作为一个组进行管理并在其中执行 Kubernetes 操作。您可以使用项目来支持多租户，例如设置团队可以访问集群中的某个项目，但不能访问同一集群中的其他项目。\n\n从层次上来说，集群包含项目，项目包含命名空间。如果把公司理解成是一个集群，那么项目对应的就是部门或者团队，我们可以给某个部门或者团队针对不同的项目去划分权限来管理多个命名空间。\n每个项目内具有不同目的的环境使用命名空间去隔离，例如：生产环境和测试的环境\n为了验证在 Rancher 单集群中具有管理大规模项目和命名空间的能力，我们在一个集群中创建了 500 个项目，并且在每个项目中创建了 10 个命名空间，最后，在每个命名空间创建：1 个 Deployment、2 个 Secret、1 个 Service、2 个 ConfigMap 来模拟真实…",
          "link": "http://weekly.dockone.io/article/2434393",
          "publishedOn": "2021-07-01T00:23:40.304Z",
          "wordCount": 257,
          "title": "最佳实践丨使用Rancher轻松管理上万资源不是梦！"
        },
        {
          "id": "http://weekly.dockone.io/article/2434391",
          "author": "aoxiang",
          "description": "【编者的话】兄弟姐妹们，一定要找好自己赖以生存的老窝。南橘北枳，根正才能苗红，否则你看起来一些主流的技术，可能就会成为毒药。\n接下来我就给你讲一个技术降级的故事。怎么样由牛 x 的技术，换成老掉牙的单体应用。故事内容真实可靠，因为它来自一次真实的咨询。\n\n集中式互联网特点\n这个年头，Service Mesh 都已经在大厂开始铺开，弱一点的也已经是 Kubernetes 驱动的微服务。  \n这些花架子，全都比 Spring Cloud 这样的一代微服务框架，高了不止一个档次。  \n这很好，新技术踩在旧技术身上，不停的向前蠕动，最终成为一个有机的整体，也成为技术革新的根本。  \n注意，我这里使用了蠕动两个字，而不是前进。蠕动意味着丑陋且缓慢，而前进意味着革新和勇往直前。  \n整个基础设施，就像一条巨大的毛毛虫，升级升级边边角角，最终破茧成为新的物种。它的升级过程是缓慢的，系统关系是复杂多变的。  \n说是微服务，但它们仍然有以下特点：\n微指的是服务粒度，而不是模块独立性。缺了大部分模块中的某一个，系统就不能正常运行。\n脱离了自己公司的环境，就无法运行。\n几乎无法重建。\n\n你会发现，即使部分业务上云；或者你被某个信仰云搞怕了，想要迁云---都会花费较大的力气。  \n这么来说吧。即使把你公司里的所有代码，都给偷了出来，你还是不能把项目在你的开发机器上跑起来。  \n大家默认了这个线上环境是稳定的，各种接口和数据以及 DevOps 工具是完备的。想要数据，直接调其他部门的接口就可以了。\n\n某些公司的痛\n但是但是但是，你默认的这个前提，正是某些公司的需求！某些公司的软肋！  \n因为，除了大部分 toC 的互联网公司，除了能够集中跑在一个地方的类 SaaS 服务，还有很大比重的实施性项目，在闷头发大财。  \n不要误解，我说的发财，是说老板和销售，而不是程序员。程序员还没这个资格，因为这种公司…",
          "link": "http://weekly.dockone.io/article/2434391",
          "publishedOn": "2021-07-01T00:23:40.234Z",
          "wordCount": 178,
          "title": "为什么从微服务退回单体架构？"
        },
        {
          "id": "http://weekly.dockone.io/article/2434386",
          "author": "翔宇",
          "description": "前段时间公司的安卓打包服务出现问题，现象是在上传 360 服务器进行加固的时候，非常大概率会卡在上传阶段，长时间重试最后失败。我对这个情况进行了一些排查分析，解决了这个问题，写了这篇长文复盘了排查的经历，会涉及到下面这些内容。\nDocker 桥接模式网络模型\nNetfilter 与 NAT 原理\nSystemtap 在内核探针中的用法\n\n现象描述\n打包服务的部署结构这样的：安卓打包环境被打包为一个 Docker 镜像，部署在某台物理机上，这镜像会完成代码编译打包、加固、签名、生成渠道包的功能，如下图所示：\n\n\n\n问题就出在上传 APK 这一步，传到一部分就卡住，360 的 SDK 提示超时等异常，如下图所示：\n\n\n\n通过在宿主机和容器内分别抓包，我们发现了这样一些现象。\n宿主机的抓包如下，序号为 881 的包是一个延迟的 ACK，它的 ACK 值为 530104，比这个 ACK 号更大的序列号在 875 的那个包已经确认过了（序列号为 532704，随后宿主机发送了一个 RST 包给远程的 360 加固服务器。\n再后面就是不停重试发送数据，上传卡住也就对应这个不断重试发送数据的阶段，如下图所示：\n\n\n\n在容器侧抓包，并没有出现这个 RST，其它的包一样，如下图所示：\n\n\n\n因为容器侧没有感知到连接的异常，容器内的服务就一直在不停的重试上传，经过多次重试以后依然是失败的。\n初步的排查分析\n一开始的疑虑是，是不是因为收到了延迟到达的 ACK，所以回复 RST 呢？\n这不应该，在 TCP 协议规范中，收到延迟到达的 ACK，忽略即可，不必回复 ACK，那到底为什么会发 RST 包呢？\n那是不是这个包本来就不合法呢？经过仔细分析这个包的信息，没有发现什么异常。从已有的 TCP 原理知识，已经没法推断这个现象了。\n黔驴技穷，没有什么思路，这个时候就该用上 systemtap，来看看 …",
          "link": "http://weekly.dockone.io/article/2434386",
          "publishedOn": "2021-06-29T00:22:07.849Z",
          "wordCount": 800,
          "title": "一次有趣的 Docker 网络问题排查经历"
        },
        {
          "id": "http://weekly.dockone.io/article/2434385",
          "author": "阿娇",
          "description": "一直想写一篇介绍设计模式的文章，让读者可以很快看完，而且一看就懂，看懂就会用，同时不会将各个模式搞混。自认为本文还是写得不错的，花了不少心思来写这文章和做图，力求让读者真的能看着简单同时有所收获。\n设计模式是对大家实际工作中写的各种代码进行高层次抽象的总结，其中最出名的当属 Gang of Four（GoF）的分类了，他们将设计模式分类为 23 种经典的模式，根据用途我们又可以分为三大类，分别为创建型模式、结构型模式和行为型模式。\n有一些重要的设计原则在开篇和大家分享下，这些原则将贯通全文：\n面向接口编程，而不是面向实现。这个很重要，也是优雅的、可扩展的代码的第一步，这就不需要多说了吧。\n职责单一原则。每个类都应该只有一个单一的功能，并且该功能应该由这个类完全封装起来。\n对修改关闭，对扩展开放。对修改关闭是说，我们辛辛苦苦加班写出来的代码，该实现的功能和该修复的 bug 都完成了，别人可不能说改就改；对扩展开放就比较好理解了，也就是说在我们写好的代码基础上，很容易实现扩展。\n\n创建型模式比较简单，但是会比较没有意思，结构型和行为型比较有意思。\n创建型模式\n创建型模式的作用就是创建对象，说到创建一个对象，最熟悉的就是 new 一个对象，然后 set 相关属性。但是，在很多场景下，我们需要给客户端提供更加友好的创建对象的方式，尤其是那种我们定义了类，但是需要提供给其他开发者用的时候。\n简单工厂模式\n和名字一样简单，非常简单，直接上代码吧：\npublic class FoodFactory {\n\n其中，LanZhouNoodle 和 HuangMenChicken 都继承自 Food。\n简单地说，简单工厂模式通常就是这样，一个工厂类 XxxFactory，里面有一个静态方法，根据我们不同的参数，返回不同的派生自同一个父类（或实现同一接口）的实例对象。\n\n我们强调职责单一原则，一个…",
          "link": "http://weekly.dockone.io/article/2434385",
          "publishedOn": "2021-06-28T00:22:23.544Z",
          "wordCount": 2781,
          "title": "图文详解 23 种设计模式"
        },
        {
          "id": "http://weekly.dockone.io/article/2434384",
          "author": "Andy_Lee",
          "description": "Docker诞生于2013年，并普及了容器的概念，以至于大多数人仍然将容器的概念等同于“Docker容器”。\n作为第一个吃螃蟹的人，Docker设置了新加入者必须遵守的标准。例如，Docker有一个大型系统镜像库。所有的替代方案都必须使用相同的镜像格式，同时试图改变Docker所基于的整个堆栈的一个或多个部分。\n在此期间，出现了新的容器标准，容器生态系统朝着不同方向发展。现在除了Docker之外，还有很多方法可以使用容器。\n在本文中，我们将介绍以下内容：\n将Chroot、cgroups和命名空间作为容器的技术基础\n定义Docker所基于的软件堆栈\n说明Docker和Kubernetes需要坚持和遵守的标准\n介绍替代解决方案，这些解决方案尝试使用具有更好更安全的组件来替换原始Docker容器。\n\n容器的软件堆栈\n像Chroot 调用、 cgroups 和命名空间等 Linux 特性帮助容器在与所有其他进程隔离的情况下运行，从而保证运行时的安全性。\nChroot\n所有类似Docker的技术都起源于类似Unix操作系统（OS）的根目录。在根目录上方是根文件系统和其他目录。\n从长远来看，这是很危险的，因为根目录中任何不需要的删除都会影响整个操作系统。这就是为什么存在一个系统调用chroot()。它创建了额外的根目录，例如一个用于运行遗留软件，另一个用于包含数据库等等。\n对于所有这些环境，chroot似乎是一个真正的根目录，而是实际上，它只是将路径名添加到任何以/开头的名字上。真正的根目录仍然存在，并且任何进程都可以引用指定根目录以外的任何位置。\nLinux cgroups\n自2008年2.6.24版本以来，Control groups（cgroups）一直是Linux内核的一项功能。Cgroup将同时限制、隔离和测量多个进程的系统资源（内存、CPU、网络和I/O）使用情况。\n假设我…",
          "link": "http://weekly.dockone.io/article/2434384",
          "publishedOn": "2021-06-28T00:22:23.069Z",
          "wordCount": 184,
          "title": "不止Docker：8款容器管理开源方案"
        },
        {
          "id": "http://weekly.dockone.io/article/2434383",
          "author": "大卫",
          "description": "微服务听起来很棒，每一个团队可以彼此独立工作而不影响其他团队。你可以轻松地维护和扩展微服务。你也可以在同一项目中使用不同的技术。它们如此稳定，所以，你的产品会有极好的扩展。在 2021 年，不应该把任何应用作为单体来构建，对吧？\n很遗憾，微服务并非在每一种环境下都可以发挥作用，在盲目使用之前，你必须确定它们提供了你所需要的价值。我见过几个典型的项目，有 4~6 名开发者，基本上是一个团队。客户想要构建微服务的应用程序，因为它们非常棒。IT 经理同意了，于是团队开始设计应用程序。\n用户管理？是的，这是一个微服务。访问权限管理？也是微服务。管理和预约？同样是微服务！通过连接到几个第三方 API 来管理和发送订单？这绝对是一个微服务。不错，现在每个人都可以得到一个微服务了！有时候你可能会违反物理学法则，每个人都有多个微服务。\n恐怖开始\n当你开始这个伟大的旅程时，你的团队需要确保每一个微服务都可以独立开发。每一个微服务都有它自己的 CI/CD 管道，自己的数据库和自己的版本化 API。\n现在，在启动一个新项目时，你可能只有一个团队。将在同一个团队中构建所有这些微服务。这种情况经常发生：一个人为了实现一个新功能而承担多个微服务。让我们就叫她 Ellie 吧。Ellie 需要在任何地方进行一些调整，同时进行测试。当她遇到问题时，她可以开始对两个微服务进行并行调试，以尝试了解它们之间的通信。如果它实际上是应用程序的一部分，那么 Ellie 就拥有一个更简单的工作环境，并且可以直接在应用程序中进行调试。此外，她还不需要为这些微服务之间的分布式、可能是异步通信编写大量定义和代码。\n之后，你的应用程序的第一个版本将提供给你的客户。当你更新应用程序并尝试开始滚动更新时，你将面临在某一时间内运行微服务的多个版本。要么它们都与其他版本兼容（这也需要在开发过程中进行一些工作），要么你需要以某种方式优雅…",
          "link": "http://weekly.dockone.io/article/2434383",
          "publishedOn": "2021-06-28T00:22:22.865Z",
          "wordCount": 122,
          "title": "小团队中微服务的可怕之处"
        },
        {
          "id": "http://weekly.dockone.io/article/2434382",
          "author": "玻璃樽",
          "description": "【编者的话】本文围绕七个点来讲网关，分别是：网关的基本概念、网关设计思路、网关设计重点、流量网关、业务网关、常见网关对比，对基础概念熟悉的朋友可以根据目录查看自己感兴趣的部分。\n什么是网关\n网关，很多地方将网关比如成门，没什么问题，但是需要区分网关与网桥的区别。\n网桥工作在数据链路层，在不同或相同类型的LAN之间存储并转发数据帧，必要时进行链路层上的协议转换。可连接两个或多个网络，在其中传送信息包。\n网关是一个大概念，不具体特指一类产品，只要连接两个不同的网络都可以叫网关,网桥一般只转发信息，而网关可能进行包装。\n网关通俗理解\n根据网关的特性，举个例子：\n假如你要去找集团老板（这儿只是举个例子），大家都知道老板肯定不是谁想见就能见的，也怕坏人嘛，那么你去老板所在的办公楼，假如是集团总部，大楼这个门就充当了网关的角色，大门一般都有看门员，看门员会做哪些事情呢？\n首先所有想见老板的人肯定都得从这个门进（统一入口），这个门相当于将办公室和外界隔离了，主要为了保护里面的安全以及正常工作，来到这个门之后，门卫肯定会让你出示相关证件（鉴权检验），意思就是判断你要见老板这个请求是否合理，如果不合理直接就拒绝了，让你回家等消息，如果鉴权之后，发现你找老板其实只是为了和他谈谈两元店的生意，门卫会跟你说这个用不着找老板，你去集团投资部就行了（动态路由，将请求路由到不同的后端集群中），此时会对你进行一些包装，例如给你出具一个访问证类似的，然后告诉你路该怎么走，等等。\n你看看，网关的作用是不是就是这三个，最终目的就是减少你与集团的耦合，具体到计算机上就是减少客户端与服务端的耦合，如果没有网关意味着所有请求都会直接调用服务器上的资源，这样耦合太强了，服务器出了问题，客户端会直接报错，例如老板换工作的地方了，如果没有网关你直接去原来的地方找，肯定会被告知老板不在这儿。\n为什么需要网关\n当使用单体应用程…",
          "link": "http://weekly.dockone.io/article/2434382",
          "publishedOn": "2021-06-27T00:24:37.456Z",
          "wordCount": 332,
          "title": "亿级流量架构的网关设计思路与常见网关对比"
        },
        {
          "id": "http://weekly.dockone.io/article/2434381",
          "author": "aoxiang",
          "description": "前言\nKubernetes集群内，Pod之间可以通信，是Kubernetes网络实现的重要场景之一。\nKubernetes通过CNI提供统一的接口和协议，使得我们在使用中可以根据需求自行选择不同的网络组件以及模式。比较常见的选型，如Flannel的VXLAN或者HostGW、Calico的IPIP或者BGP等等。\n这些不同的网络组件究竟是怎么实现Pod的通信的，底层的技术原理是什么，本篇文章就带大家以Calico的BGP模式的通信模型（基于路由的纯三层模型）为例，解析其底层的实现原理。\n既然提到了容器网络，就肯定绕不开Network Namespace。Network Namespace是实现虚拟网络的核心技术（这里就不展开细说了，有兴趣的同学可以自行了解一下Linux Namespaces），已被广泛的运用在了容器相关的网络场景中。一个docker创建的容器会有一个独立的Network Namespace，一个Kubernetes的Pod里的N个容器也会共用一个独立的Network Namespace。\n那么Network Namespace之间是怎么实现通信的？\n今天就来自己动手实现基于路由模式，多个可以跨主机通信的Network Namespace（网络命名空间）。\n动手创建一个Network Namespace\n1、准备一台Linux主机（node03--100.100.198.250），检查ip命令是否有效（如果没有需要安装iproute2）\n2、执行以下命令创建一个新的net-ns demo01\nip netns add demo01 #创建demo01\n\n3、查看demo01下的网卡资源并开启lo网卡\nip netns exec demo01 ip addr #ip netns exec demo01 可以实现对demo01的相关操作，也可以通过`ip net…",
          "link": "http://weekly.dockone.io/article/2434381",
          "publishedOn": "2021-06-27T00:24:37.441Z",
          "wordCount": 528,
          "title": "Kubernetes网络技术解析之Pod基于路由模式的通信实现"
        },
        {
          "id": "http://weekly.dockone.io/article/2434380",
          "author": "老马",
          "description": "此报告主要参考了《零信任实战白皮书》，结合自己对零信任的理解，做了一个精简的总结，做参考。\n零信任认识\n零信任解决的是由于传统边界模型过度信任造成的安全问题，重点是Trust Area内过度信任的问题，零信任打破了信任和网络位置默认的绑定关系，不像传统信任关系是静态不变的，而是动态持续监测各参与对象的安全状态、并对其重建信任评估，然后进行动态调整权限、降权、阻断等强管控手段。我自己认为，动态持续监控、根据对象安全状态进行调整权限。\n这个是零信任非常重要的功能，也是传统边界模型做不到的。\n零信任实现架构\n目前有零信任实践的公司，大多都是采用SDP架构（software define perimeter），SDP架构主要包括三大组件：SDP控制器（SDP Controler）、SDP发起客户端、 SDP服务提供者。\n控制层与数据层保持分离，以便实现完全可扩展。\n\n\n\n零信任实现方案\n有两种实现方案，一是用户对资源访问的方案，如办公网访问公司应用，大多数采用此种对零信任架构进行实践摸索；二是生产服务之间相互调用的方案，由于涉及生产、及各种复杂访问关系，很少有公司对此种进行实践。\n用户对资源访问模式方案\n此种方案涉及到的对象有：用户、终端、资源、链路。\n此方案，对架构进行抽象后的架构示意图如下：\n\n\n\n认证不再只是人的认证，授权、信任不再是静态不变，而是：人（双因素、OTP）+终端（是否符合安全基线，安全状态是否符合）+软件（是否有漏洞）=认证（持续动态认证）---->认证通过----->授权（基于对各对象动态安全监测和信任评估，动态授权、降权、阻断等）---->资源\n零信任在技术实现分类上，根据零信任网关的类型总结为两种：\n反向代理/应用层Web协议网关\n应用层代理模式指的是在零信任网关实现上，通过七层应用代理方式，将对后端应用的访问通过本地应用 ，层代理配置，将应用层请求发至应…",
          "link": "http://weekly.dockone.io/article/2434380",
          "publishedOn": "2021-06-27T00:24:37.272Z",
          "wordCount": 169,
          "title": "零信任实战架构总结"
        },
        {
          "id": "http://weekly.dockone.io/article/2434379",
          "author": "JetLee",
          "description": "DDD为什么能火起来？\n我们先不讨论DDD的定义，先梳理一下DDD火起来的背景，根据我学习的套路，永远是为什么为先，再是解决什么问题，是什么东西，最后如何使用。我们都知道这些年随着设备以及技术的发展，软件架构发生了很多变化，从最初的单机（BS/CS）架构到后面的集中式架构，再到如今的微服务架构，现在基本可以说是微服务架构盛行的时代，DDD早在2004年就由埃里克·埃文斯提出，但一直处于一个不愠不火的状态，直到Martin Fowler的《Microservices》引起大家注意，也就是微服务盛行之后（这儿需要说明的是，微服务最早的提出者不是Martin Fowler，而是Fred George），DDD再次回到人们视野中间，为什么呢？\n我们先看一下三种技术架构的演进以及主要区别：\n\n\n\n第一阶段是单机架构，特征是整个开发围绕着数据库进行设计和开发。\n第二个阶段是三层式的集中式架构，采用面向对象的设计方法，业务逻辑分业务层、逻辑层、数据访问层，这种架构很容易某一层或者几层变得臃肿，扩展性较差，另外摩尔定律失效，单台机器性能有限。\n第三层阶段是微服务架构，在集中式架构中，系统分析、设计和开发往往是独立进行的，而且各个阶段负责人可能不一样，那么就涉及到交流信息丢失的问题，另外项目从分析到开发经历的流程很长，很容易最终开发设计与需求实现的不一样，微服务主要就是解决第二阶段的这些痛点，实现应用之间的解耦，解决单体应用扩展性的问题。\n微服务存在的问题\n进入微服务之后，解决了集中式架构的单体应用很多问题，但是新的问题应运而生，微服务的粒度应该多大？微服务如何设计呢？微服务如何拆分？微服务边界在哪里？\n很长时间人们都没有解决这一问题，就连Martin Fowler在提出微服务架构的时候也没有告诉我们这该如何拆分微服务。\n甚至在很长的时间里人们对微服务拆分产生了一些误解，有人认为：“微服务很…",
          "link": "http://weekly.dockone.io/article/2434379",
          "publishedOn": "2021-06-26T00:20:52.790Z",
          "wordCount": null,
          "title": "DDD兴起的原因以及与微服务的关系"
        },
        {
          "id": "http://weekly.dockone.io/article/2434366",
          "author": "Rancher",
          "description": "本文是介绍Kubernetes的基本概念的系列文章之一， 在第一篇文章中，我们简单介绍了持久卷（Persistent Volumes）。在本文中，我们将学习如何设置数据持久性，并将编写Kubernetes脚本以将我们的Pod连接到持久卷。在此示例中，将使用Azure文件存储(Azure File Storage)来存储来自我们MongoDB数据库的数据，但您可以使用任何类型的卷来实现相同的结果（例如Azure Disk，GCE持久磁盘，AWS弹性块存储等）。\n如果你想全面了解K8S其他概念的话，可以先查看此前发布的文章。\n\n请注意：本文提供的脚本不限定于某个平台，因此您可以使用其他类型的云提供商或使用具有K3S的本地集群实践本教程。本文建议使用K3S，因为它非常轻，所有的依赖项被打包在单个二进制中包装大小小于100MB。它也是一种高可用的认证的Kubernetes发行版，用于在资源受限环境中的生产工作负载。想了解更多信息，请查看官方文档：\nhttps://docs.rancher.cn/k3s/\n前期准备\n在开始本教程之前，请确保已安装Docker。同时安装Kubectl（如果没有，请访问以下链接安装：\nhttps://kubernetes.io/docs/tas ... ndows\n在kubectl Cheat Sheet.中可以找到整个本教程中使用的kubectl命令：\nhttps://kubernetes.io/docs/ref ... heet/\n本教程中，我们将使用Visual Studio Code，您也可以使用其他的编辑器。\nKubernetes持久卷可以解决什么问题？\n\n请记住，我们有一个节点（硬件设备或虚拟机）和在节点内部，我们有一个Pod（或多个Pod），在Pod中，我们有容器。Pod的状态是暂时的，所以他们神出鬼没（时常会被删除或重新调度等）。在这种情…",
          "link": "http://weekly.dockone.io/article/2434366",
          "publishedOn": "2021-06-24T13:59:52.630Z",
          "wordCount": 392,
          "title": "从入门到上手：什么是K8S持久卷？"
        },
        {
          "id": "http://weekly.dockone.io/article/2434363",
          "author": "尼古拉斯",
          "description": "在2019年8月推出etcd 3.4时，我们主要关注存储后端改进、非投票成员与预投票等功能。在接下来的近两年中，etcd被越来越广泛地应用于各类关键任务集群及数据库程序当中，其功能集也随之变得愈发广泛且复杂。因此，提高项目稳定性与可靠性成为近期规划工作的重中之重。\n今天，我们正式发布etcd 3.5。过去两年以来，我们完成了多轮迭代、修复了大量bug、确定了新的优化方向并着力培养相关生态系统。在此期间，etcd项目也成为云原生计算基金会（CNCF）的毕业项目。而此次发布的3.5版本，正是etcd社区不断进化以及众多艰难探索的集大成结果。\n在本文中，我们将共同了解etcd 3.5中最为显著的变化，并展示项目的未来发展路线图。关于详尽的变更清单，请参阅CHANGELOG 3.5。若需了解更多更新内容，请在Twitter @etcdio上关注我们。最后，你可以点击此处获取etcd。\n安全性\n考虑到不少用户在使用etcd处理敏感数据，改善并维护安全水平自然成为我们的首要任务。为了全面了解etcd的安全态势，我们完成了一轮第三方安全审计：首份报告发布于2020年2月，我们借此发现并修复了多种极端案例及高严重性问题。关于更多详细信息，请参阅安全审计报告。\n为了遵循最高级别的安全最佳实践，etcd现采取一套安全发布流程，并使用静态分析工具运行自动化测试，包括errcheck，ineffassign等。\n功能拓展\netcd面向结构化日志记录的迁移工作已经完成。现在etcd默认使用zap记录器，其中采用一项无反射、零分配JSON编码器。我们已经正式弃用基于反射的capnslog序列化记录工具。\netcd现可支持内置日志轮替，允许你配置轮替阈值、压缩算法等细则。关于更多详细信息，请参阅hexfusion@ of Red Hat’s code change。\netcd现可针对高资源需求量请求发出…",
          "link": "http://weekly.dockone.io/article/2434363",
          "publishedOn": "2021-06-24T13:59:52.440Z",
          "wordCount": 289,
          "title": "etcd 3.5正式发布"
        },
        {
          "id": "http://weekly.dockone.io/article/2434365",
          "author": "老马",
          "description": "背景\n近几年，容器技术非常火爆，且日趋成熟，众多企业慢慢开始容器化建设，并在云原生技术方向上不断的探索和实践。基于这个大的趋势， 2020 年底 Qunar 也向云原生迈出了第一步——容器化。为了完成容器化这个目标，我们基础平台、TCDEV、Ops、数据组、业务线等多个团队一起协作配合，终于在公司内部把容器化成功落地。截止到今年六月初，我们生产环境已经接入了 150 多个应用，其余应用也在陆续接入中，这个成果还是蛮让人惊喜的。回顾整个容器化落地过程其实有不少技术难点的，在这篇文章中我会分享下我们遇到的几个问题和解决思路，希望对还在云原生路上探索的同学有些借鉴意义。\n容器化方案架构简介\nQunar 在做容器化过程中，各个系统 Portal 平台、中间件、Ops 基础设施、监控等都做了相应的适配改造，改造后的架构矩阵如下图所示：\n\n\n\n\nPortal：Qunar 的 PaaS 平台入口，提供 CI/CD 能力、资源管理、自助运维、应用画像、应用授权（db 授权、支付授权、应用间授权）等功能\n运维工具：提供应用的可观测性工具, 包括 Watcher（监控和报警）、Bistoury（Java 应用在线 debug）、QTrace（Tracing 系统）、Loki/ELK（提供实时日志/离线日志查看）\n中间件：应用用到的所有中间件，MQ、配置中心、分布式调度系统 QSchedule、Dubbo 、MySQL SDK等  \n虚拟化集群：底层的 Kubernetes 和 OpenStack 集群  \nNoah：测试环境管理平台，支持应用 KVM/容器混合部署  \n\n在 Portal PaaS 平台中，一个应用的容器发布流具体程如下：\n\n\n\n容器化落地过程中碰到的问题\n如何兼容过去 KVM 的使用方式，并支持 preStart、preOnline hook 自定义脚本\nKVM 场景中 ho…",
          "link": "http://weekly.dockone.io/article/2434365",
          "publishedOn": "2021-06-24T13:59:52.369Z",
          "wordCount": 444,
          "title": "Qunar 容器化落地过程踩过的那些坑"
        },
        {
          "id": "http://weekly.dockone.io/article/2434375",
          "author": "阿里巴巴云原生",
          "description": "作者｜李小平\n前天我参加了信通院的云原生产业大会，参加会议的企业非常多，并且来自于各行各业，我在会场上非常感慨。我想起 2019 年的时候，我在搜索引擎上搜索“云原生”这个词，那时的搜索频率还比较低，而 2019 年又是云原生在国内开始飞速发展的一年。而今年的云原生会场上，已经有非常多的企业来参加，这些企业在技术、产品、生态中都在应用云原生，所以说，整个云原生已经从最开始的技术变成了行业，现在发展成了比较大的产业，并且这个产业的规模每年以非常快的速度在增长。\n在今天，可能有很多咨询机构、企业，或者是个人开发者都在解读云原生，也许很多人对云原生都有比较深入的认识了。大家都可以认同的是，云原生肯定与云有关，但是它改变了什么，为企业带来什么价值呢？最核心的点应该是可以改变企业的应用架构；还有一种可能是不改变应用架构，只是把整个运维体系基于云原生进行重塑。但所有的这些，背后的目的都是为了加速企业的价值创造过程，简单的说，和制造企业改良生产线是一样的，核心点就是改良我们作为软件企业的生产线。\n阿里在云原生的实践从 2006 年就开始了。我们在做云原生的过程中积累了很多经验，我们认为，今天云原生对于企业数字创新主要提供了多个价值：\n一是资源弹性。弹性这个词大家很容易理解，实际上弹性有不同的层面。比如说基于虚拟机的弹性，提供的弹性能力是分钟级的。如果基于这些技术的应用是毫秒级的，那么分钟级只解决了资源弹性问题，整个应用高可用问题还需要进一步解决。如果说弹性到了应用的层面，到了毫秒级，高可用问题也得到一定程度的解决。\n除此以外，系统的稳定性也是大家非常关注的方面。云原生就是把整个软件构造过程中非功能性特性拉出来放到云原生产品上去，帮助应用开发从非功能性处理过程中解脱出来，更多的专注在功能性。同样的，云原生有很多工具理念，可以让我们变得更好，整个软件开发从代码到上线的时间大幅缩短。同样的，今…",
          "link": "http://weekly.dockone.io/article/2434375",
          "publishedOn": "2021-06-24T13:59:52.341Z",
          "wordCount": 229,
          "title": "阿里云中间件首席架构师李小平：企业为什么需要云原生？"
        },
        {
          "id": "http://weekly.dockone.io/article/2434371",
          "author": "阿娇",
          "description": "【编者的话】本文阐述了 Netflix 的系统监控实践：自研 Telltale，成功运行并监控着 Netflix 100 多个生产应用程序的运行状况。\n\n难忘的经历\n相信很多运维人都有过这样的经历：监控系统某个指标超过阈值，触发告警。大半夜里，你被紧急召唤。  \n半睁着眼，你满脸疑惑：“系统真出问题了吗，还是仅仅需要调整下告警？上一次有人调整我们的告警阈值是在什么时候？有没有可能是上游或者下游的服务出现了问题？”  \n鉴于这是一次非常重要的应用告警，因此你不得不从床上爬起来，迅速打开电脑，然后浏览监控仪表盘来追踪问题源头。  \n忙了半天，你还没确认这个告警是来自于系统的问题，但也意识到，从海量数据中寻找线索时，时间正在流逝。你必须尽快定位告警的原因，并祈祷系统稳定运行。\n对我们的用户来讲，稳健的 Netflix 服务至关重要。当你坐下来看《养虎为患》时，你肯定希望它能顺利播放。\n多年来，我们从经常在深夜被召唤的工程师那里了解到应用程序监控的痛点：\n\n\n过多的告警\n太多滚动浏览的仪表盘  \n太多的配置  \n过多的维护\n\nTelltale\n我们的流媒体团队需要一个全新的监控系统，可以让团队成员快速地诊断和修复问题；因为在系统告警的紧急情况下，每一秒都至关重要！  \n我们的 Node 团队 需要一个仅需一小撮人就能运维大型集群的系统。因此，我们构建了 Telltale。\n\n\n\n\n\nTelltale 监控时间轴\nTelltale 的特性如下：\n汇集监控数据源，创建整体监控视图：Telltale 汇集了各种监控数据源，从而能创建关于应用程序运行状况的整体监控视图。\n多维度判断应用程序的健康状况：Telltale 可以通过多个维度判断一个应用程序的健康情况，而无需根据单一指标频繁调整告警阈值。\n及时告警：因为我们知道应用程序在什么情况下是正常的，所以能在应用程序有异常趋势时及时通知应用…",
          "link": "http://weekly.dockone.io/article/2434371",
          "publishedOn": "2021-06-24T13:59:52.334Z",
          "wordCount": 254,
          "title": "Telltale：看 Netflix 如何简化应用程序监控体系"
        },
        {
          "id": "http://weekly.dockone.io/article/2434376",
          "author": "k3s中文社区",
          "description": "在本文中，我们将使用Flask和JavaScript编写的、带有MongoDB数据库的TODO应用程序，并学习如何将其部署到Kubernetes上。这篇文章是针对初学者的，如果你之前没有深度接触过Kubernetes集群，也不要担心！\n我们将使用K3s，这是一个轻量级的Kubernetes发行版，非常适合快速入门。但首先让我们谈谈我们想要实现的目标。\n首先，我将介绍示例应用程序。这其实已经简化了许多细节，但它说明了常见的用例。然后我们将熟悉了解容器化应用程序的过程。在我们继续之前，我会讨论我们如何使用容器来让我们的开发更加轻松，特别是如果我们在一个团队中工作，或者是当我们在一个新的环境中工作时，希望减轻开发人员的负担。\n一旦我们将应用程序容器化，下一步就是将它们部署到Kubernetes上。虽然我们可以手动创建服务、Ingress和网关，但我们可以使用Knative以在任何时候都支持我们的应用程序。\n设置应用程序\n我们将使用一个简单的TODO应用程序来演示前端、REST API后端和MongoDB协同工作。这要归功于Prashant Shahi提出的这个例子。我做了一些小改动，纯粹是为了教学的目的：\nhttps://github.com/prashant-shahi\n首先，git clone代码库：\ngit clone https://github.com/benjamintanweihao/Flask-MongoDB-K3s-KNative-TodoApp\n\n接下来，我们将检查目录，了解情况：\ncd Flask-MongoDB-K3s-KNative-TodoApp\n\n该文件夹结构是一个典型的Flask应用程序。Entry point是app.py，它还包含REST APIs。Templates文件夹包含了将被渲染成HTML的文件：\n打开 app.py，我们可以看到所有的…",
          "link": "http://weekly.dockone.io/article/2434376",
          "publishedOn": "2021-06-24T13:59:52.097Z",
          "wordCount": 921,
          "title": "入门实践丨如何在K3s上部署Web应用程序"
        },
        {
          "id": "http://weekly.dockone.io/article/2434367",
          "author": "Andy_Lee",
          "description": "在微服务架构中，需要调用很多服务才能完成一项功能。服务之间如何互相调用就变成微服务架构中的一个关键问题。服务调用有两种方式，一种是RPC方式，另一种是事件驱动（Event-driven）方式，也就是发消息方式。消息方式是松耦合方式，比紧耦合的RPC方式要优越，但RPC方式如果用在适合的场景也有它的一席之地。\n耦合的种类\n我们总在谈耦合，那么耦合到底意味着什么呢？\n时间耦合：客户端和服务端必须同时上线才能工作。发消息时，接受消息队列必须运行，但后台处理程序暂时不工作也不影响。\n容量耦合：客户端和服务端的处理容量必须匹配。发消息时，如果后台处理能力不足也不要紧，消息队列会起到缓冲的作用。\n接口耦合：RPC调用有函数标签，而消息队列只是一个消息。例如买了商品之后要调用发货服务，如果是发消息，那么就只需发送一个商品被买消息。\n发送方式耦合：RPC是点对点方式，需要知道对方是谁，它的好处是能够传回返回值。消息既可以点对点，也可以用广播的方式，这样减少了耦合，但也使返回值比较困难。\n\n下面我们来逐一分析这些耦合的影响。 第一，时间耦合，对于多数应用来讲，你希望能马上得到回答，因此即使使用消息队列，后台也需要一直工作。第二，容量耦合，如果你对回复有时间要求，那么消息队列的缓冲功能作用不大，因为你希望及时响应。真正需要的是自动伸缩（Auto-scaling），它能自动调整服务端处理能力去匹配请求数量。第三和第四，接口耦合和发送方式耦合，这两个确实是RPC方式的软肋。\n事件驱动（Event-Driven）方式\nMartin Fowler把事件驱动分成四种方式（What do you mean by “Event-Driven”），简化之后本质上只有两种方式。 一种就是我们熟悉的的事件通知（Event Notification），另一种是事件溯源（Event Sourcing）。事件通知就是微…",
          "link": "http://weekly.dockone.io/article/2434367",
          "publishedOn": "2021-06-24T13:59:52.089Z",
          "wordCount": 192,
          "title": "微服务之间的最佳调用方式"
        },
        {
          "id": "http://weekly.dockone.io/article/2434373",
          "author": "阿里巴巴云原生",
          "description": "作者｜ 修冶\n背 景\n​\n微服务在最近几年大行其道，很多公司的研发人员都在考虑微服务架构，同时，随着 Docker 容器技术和自动化运维等相关技术发展，微服务变得更容易管理，这给了微服务架构良好的发展机会。\n拆分目的是什么？\n​\n在介绍如何拆分之前，我们需要了解下拆分的目的是什么，这样才不会在后续的拆分过程中忘了最初的目的。\n但是随着功能越来越多，开发团队的规模越来越大，单体架构的缺陷慢慢体现出来，主要有以下几个方面：\n\n\n拆分时机应该如何决策？\n​\n产品初期，应该以单体架构优先。因为面对一个新的领域，对业务的理解很难在开始阶段就比较清晰，往往是经过一段时间之后，才能逐步稳定，如果拆分过早，导致边界拆分不合理或者拆的过细，反而会影响生产力。很多时候，从一个已有的单体架构中逐步划分服务，要比一开始就构建微服务简单得多。同时公司的产品并没有被市场验证过，有可能会失败，所以这个投入的风险也会比较高。\n\n随着公司的商业模式逐渐得到验证，且产品获得了市场的认可，为了能加快产品的迭代效率快速占领市场，公司开始引进更多的开发同学，这时系统的复杂度会变得越来越高，就出现单体应用和团队规模之间出现矛盾，研发效率不升反降。上图中的交叉点表明，业务已经达到了一定的复杂度，单体应用已经无法满足业务增长的需求，研发效率开始下降，而这时就是需要考虑进行服务拆分的时机点。这个点需要架构师去权衡。笔者所在的公司，是当团队规模达到百人的时候，才考虑进行服务化。\n微服务不仅仅是技术的升级，更是开发方式、组织架构、开发观念的转变。\n至此，何时进行微服务的拆分，整体总结如下：\n拆分时应该坚守哪些指导原则？\n1. 单一服务内部功能高内聚低耦合\n也就是说每个服务只完成自己职责内的任务，对于不是自己职责的功能交给其它服务来完成。\n2. 闭包原则（ CCP ）\n3. 服务自治、接口隔离原则\n4. 持续演进原则\n5. 拆分…",
          "link": "http://weekly.dockone.io/article/2434373",
          "publishedOn": "2021-06-24T13:59:51.985Z",
          "wordCount": 314,
          "title": "微服务拆分之道"
        },
        {
          "id": "http://weekly.dockone.io/article/2434370",
          "author": "阿里巴巴云原生",
          "description": "作者：清弦\n背景\n​\n近期 Cilium 社区发布了 Cilium 1.10 正式版本，在这个版本中正式支持阿里云 ENI 模式，阿里云也是国内首家支持 Cilium 的云厂商。\n\nCilium 是一个基于 eBPF 的高性能容器网络项目，提供网络、可观测性、安全三方面的解决方案。\n\nCilium 本身支持 Overlay 网络模式部署在各种云平台或者自建的集群上，但是这种非云原生的网络模式会带来不小的性能损耗。阿里巴巴云原生容器服务团队向 Cilium 社区贡献了阿里云 ENI 模式，使得在阿里云上可以以云原生方式运行 Cilium 。\nhttps://github.com/cilium/cilium/pull/15160_\nhttps://github.com/cilium/cilium/pull/15512_\n架构\n​\nAlibabaCloud Operator 是集群内的网络资源控制器，承担对网络资源（ENI、ENIIP）统一管理、分配工作。\n\nCilium agent 通过 list-watch 机制、CNI 请求对 Operator 分配的地址资源进行配置、管理。\n\n\n基于 Cilium 1.10 + 阿里云 ENI 的高性能云原生网络\n​\nCilium 使用了 EBPF 内核技术对传统数据链路进行了优化，绕过了Conntrack 模块，对容器场景下网络性能有了非常大的提高。在阿里云上使用 Cilium 1.10 + 阿里云 ENI 模式有多种按照方式，请阅读 Cilium 社区的安装文档[1]。\n使用 Terway IPvlan\n使用 Terway 模式非常简单，在阿里云容器服务控制台，创建集群中选择网络插件  Terway ，并勾选 IPvlan 即可启用。\n\n\nIPvlan + eBPF 性能对比：\n​\n测试环境：\n2 节点 ecs . g5ne . 4xlarge 机型\n对比测试\n\nTerway 独占 ENI ( ipvs )\nNetperf 性能对比 TCP_CRR\n测试场景：使用 netperf 测试 Pod 间通讯\n\n上图数字越大性能越好\nwrk + nginx 性能对比\n测试场景：采用 wrk 压测 nginx 的 Service 的方式，采用 100 字节的小页面模拟常见的集群中微服务通信。\n​\n上图数字越小性能越好\n\n上图数字越大性能越好\nTerway IPvlan 模式在 wrk- nginx 的短连接测试中相对于传统的 Terway veth 策略路由方式：\nClusterIP 吞吐增加 277% , 延迟降低 50%。\n\n总结\n​\n随着 Kubernetes 已经成为容器调度的事实标准，企业上云的首选。容器网络做为应用的底层基础资源，得到越来越多的关注。\nhttps://docs.cilium.io/en/v1.1 ... -eni_\nTerway:  _https://www.alibabacloud.com/h ... .htm_\nhttps://help.aliyun.com/docume ... html_",
          "link": "http://weekly.dockone.io/article/2434370",
          "publishedOn": "2021-06-24T13:59:51.858Z",
          "wordCount": 347,
          "title": "Cilium 首次集成国内云服务，阿里云 ENI 被纳入新版本特性"
        },
        {
          "id": "http://weekly.dockone.io/article/2434377",
          "author": "博云BoCloud",
          "description": "在正文开始之前，我们来看一个日常生活场景，咖啡自动售卖机：   \n  \n第一排，是四个选项：美式、拿铁、摩卡、白咖啡；\n第二排，单位是ml，代表产出咖啡的量；\n第三排，是否加糖；\n第四排，是否加奶。\n输入以上这四个参数后，自动售卖的咖啡机便会按照要求提供所需的咖啡。当然售卖机还是会根据操作者的人脸或扫码确定其身份信息，做出相应的扣款，或是先付款后操作等处理。这就是一台咖啡机所提供的服务，机身上提供了操作的说明，根据提示输入类型、口味等信息，制造出对应的咖啡。\n微服务与 API\n咖啡机提供的是生活服务，而我们一直以来的话题：“微服务”，则提供的是软件服务。一个软件服务的使用，需要输入参数：如第一个参数代表了类型，第二个参数代表了返回的数量，第三个、第四个参数代表了是否需要加某些规则；同时也需要身份信息：如报头加入消费者名称，加入认证信息等；当然还需要有返回，也就是计算或者处理的结果返回。这就是软件服务提供的能力，也是软件服务的API。\n在微服务的架构提出之前，行业内首先提出的是服务化，毕竟服务能力的封装、自运行，可比自己编码实现要快捷、低廉很多。在服务化的基础上才有了微服务，微服务就是其基于服务化将应用程序构造为一组松散耦合的服务。\n因此，微服务基于 API 作为服务能力的提供，也是服务间消费的规则和方式。信息标识认证的方式、参数传递的类型，格式返回的方式，这都是API定义的。\nAPI\nAPI 的定义是应用程序编程接口，而在服务化的场景中，API 是应用程序间的访问接口，即服务提供的行为合同。那么在微服务的场景中，API就是微服务间获取信息的契约。\n微服务架构中服务间调用关系错综复杂，程序提供的服务能力可以被其他任意服务消费和使用，这也是建设微服务的一个优势。服务能力的复用，可以在某个业务领域内被消费，也可以被网络区域外的服务所依赖，也可以是整体企业对外的能力开放，其本质归根…",
          "link": "http://weekly.dockone.io/article/2434377",
          "publishedOn": "2021-06-24T13:59:51.560Z",
          "wordCount": 178,
          "title": "想要做好微服务化，这个核心对象要管好"
        }
      ]
    },
    {
      "title": "Hacker News",
      "feedUrl": "https://news.ycombinator.com/rss",
      "siteUrl": "https://news.ycombinator.com/",
      "articles": [
        {
          "id": "https://stockfishchess.org/blog/2021/stockfish-14/",
          "author": null,
          "description": "Comments",
          "link": "https://stockfishchess.org/blog/2021/stockfish-14/",
          "publishedOn": "2021-07-04T23:29:14.000Z",
          "wordCount": 397,
          "title": "Stockfish 14 Released"
        },
        {
          "id": "https://github.com/geohot/corona",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/geohot/corona",
          "publishedOn": "2021-07-04T22:35:40.000Z",
          "wordCount": 1514,
          "title": "Reverse engineering SARS-CoV-2"
        },
        {
          "id": "https://www.nytimes.com/2021/07/03/us/florida-condo-collapse-steel-rebar.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.nytimes.com/2021/07/03/us/florida-condo-collapse-steel-rebar.html",
          "publishedOn": "2021-07-04T21:40:29.000Z",
          "wordCount": 2567,
          "title": "Condo Wreckage Hints at Less Steel in Columns Than Design Drawings"
        },
        {
          "id": "https://gist.github.com/pushpendre/359706010c20bc1d18123510749f5da5",
          "author": null,
          "description": "Comments",
          "link": "https://gist.github.com/pushpendre/359706010c20bc1d18123510749f5da5",
          "publishedOn": "2021-07-04T20:07:51.000Z",
          "wordCount": 215,
          "title": "PID Controller for controlling the number of servers in a data-center"
        },
        {
          "id": "https://cprimozic.net/blog/speeding-up-webcola-with-webassembly/",
          "author": null,
          "description": "Comments",
          "link": "https://cprimozic.net/blog/speeding-up-webcola-with-webassembly/",
          "publishedOn": "2021-07-04T19:53:02.000Z",
          "wordCount": 18,
          "title": "Speeding Up the Webcola Graph Viz Library with Rust and WebAssembly"
        },
        {
          "id": "https://cstack.github.io/db_tutorial/",
          "author": null,
          "description": "Comments",
          "link": "https://cstack.github.io/db_tutorial/",
          "publishedOn": "2021-07-04T19:22:47.000Z",
          "wordCount": 261,
          "title": "Writing a SQLite clone from scratch in C (2017)"
        },
        {
          "id": "https://github.com/Jason2Brownlee/QuakeBotArchive",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/Jason2Brownlee/QuakeBotArchive",
          "publishedOn": "2021-07-04T19:14:24.000Z",
          "wordCount": 2128,
          "title": "Archive and genealogy of all Quake 1 bots"
        },
        {
          "id": "https://github.com/jdhayford/acid-tabs-extension",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/jdhayford/acid-tabs-extension",
          "publishedOn": "2021-07-04T18:54:58.000Z",
          "wordCount": 732,
          "title": "Show HN: Open-Source Chrome Extension for auto-grouping tabs by URL patterns"
        },
        {
          "id": "https://bedrockapp.org/2021/07/04/devlog-converting-this-wordpress-site-to-bedrock-itself/",
          "author": null,
          "description": "Comments",
          "link": "https://bedrockapp.org/2021/07/04/devlog-converting-this-wordpress-site-to-bedrock-itself/",
          "publishedOn": "2021-07-04T18:54:25.000Z",
          "wordCount": 2515,
          "title": "Devlog – converting this WordPress site to Bedrock itself"
        },
        {
          "id": "https://labs.sentinelone.com/bypassing-macos-tcc-user-privacy-protections-by-accident-and-design/",
          "author": null,
          "description": "Comments",
          "link": "https://labs.sentinelone.com/bypassing-macos-tcc-user-privacy-protections-by-accident-and-design/",
          "publishedOn": "2021-07-04T18:39:02.000Z",
          "wordCount": 3424,
          "title": "Bypassing macOS TCC user privacy protections by accident and design"
        },
        {
          "id": "https://appleinsider.com/articles/21/07/02/eu-antitrust-head-warns-against-apple-using-privacy-security-to-stave-off-competition",
          "author": null,
          "description": "Comments",
          "link": "https://appleinsider.com/articles/21/07/02/eu-antitrust-head-warns-against-apple-using-privacy-security-to-stave-off-competition",
          "publishedOn": "2021-07-04T18:32:43.000Z",
          "wordCount": 2866,
          "title": "EU antitrust: Apple shouldn't use privacy and security to stave off competition"
        },
        {
          "id": "https://techcrunch.com/2016/06/07/flexport/",
          "author": null,
          "description": "Comments",
          "link": "https://techcrunch.com/2016/06/07/flexport/",
          "publishedOn": "2021-07-04T17:00:16.000Z",
          "wordCount": 1264,
          "title": "Flexport (YC W14) Is Hiring"
        },
        {
          "id": "https://nakabonne.dev/posts/write-tsdb-from-scratch/",
          "author": null,
          "description": "Comments",
          "link": "https://nakabonne.dev/posts/write-tsdb-from-scratch/",
          "publishedOn": "2021-07-04T16:31:43.000Z",
          "wordCount": 3524,
          "title": "Write a time-series database engine from scratch"
        },
        {
          "id": "https://www.chronicle.com/article/is-the-pirate-queen-of-scientific-publishing-in-real-trouble-this-time",
          "author": null,
          "description": "Comments",
          "link": "https://www.chronicle.com/article/is-the-pirate-queen-of-scientific-publishing-in-real-trouble-this-time",
          "publishedOn": "2021-07-04T16:29:33.000Z",
          "wordCount": null,
          "title": "Is Alexandra Elbakyan in real trouble this time?"
        },
        {
          "id": "https://www.micahlerner.com/2021/06/27/ray-a-distributed-framework-for-emerging-ai-applications.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.micahlerner.com/2021/06/27/ray-a-distributed-framework-for-emerging-ai-applications.html",
          "publishedOn": "2021-07-04T16:24:32.000Z",
          "wordCount": 1695,
          "title": "Ray: A Distributed Framework for Emerging AI Applications"
        },
        {
          "id": "https://www.linkedin.com/pulse/8-lessons-from-20-years-hype-cycles-michael-mullany",
          "author": null,
          "description": "Comments",
          "link": "https://www.linkedin.com/pulse/8-lessons-from-20-years-hype-cycles-michael-mullany",
          "publishedOn": "2021-07-04T16:06:13.000Z",
          "wordCount": 3328,
          "title": "Lessons from 20 years of hype cycles (2016)"
        },
        {
          "id": "https://www.eff.org/deeplinks/2021/07/future-symmetrical-high-speed-internet-speeds",
          "author": null,
          "description": "Comments",
          "link": "https://www.eff.org/deeplinks/2021/07/future-symmetrical-high-speed-internet-speeds",
          "publishedOn": "2021-07-04T15:51:58.000Z",
          "wordCount": 2534,
          "title": "The future is in symmetrical, high-speed internet speeds"
        },
        {
          "id": "https://datatracker.ietf.org/doc/html/draft-ietf-httpapi-idempotency-key-header-00",
          "author": null,
          "description": "Comments",
          "link": "https://datatracker.ietf.org/doc/html/draft-ietf-httpapi-idempotency-key-header-00",
          "publishedOn": "2021-07-04T13:49:49.000Z",
          "wordCount": 2581,
          "title": "The Idempotency-Key HTTP header field"
        },
        {
          "id": "https://begriffs.com/posts/2021-07-04-shared-libraries.html?hn=2",
          "author": null,
          "description": "Comments",
          "link": "https://begriffs.com/posts/2021-07-04-shared-libraries.html?hn=2",
          "publishedOn": "2021-07-04T13:19:48.000Z",
          "wordCount": 3190,
          "title": "Dynamic Linking Best Practices"
        },
        {
          "id": "https://www.wired.com/story/how-underground-fiber-optics-spy-on-humans-moving-above/",
          "author": null,
          "description": "Comments",
          "link": "https://www.wired.com/story/how-underground-fiber-optics-spy-on-humans-moving-above/",
          "publishedOn": "2021-07-04T13:16:42.000Z",
          "wordCount": 1519,
          "title": "Underground fiber optics spy on humans moving above"
        },
        {
          "id": "https://mazzo.li/posts/c-performance-anecdote.html",
          "author": null,
          "description": "Comments",
          "link": "https://mazzo.li/posts/c-performance-anecdote.html",
          "publishedOn": "2021-07-04T13:12:39.000Z",
          "wordCount": 1111,
          "title": "When static makes your C code 10 times faster"
        },
        {
          "id": "https://www.blender.org/user-stories/blender-and-the-rabbids/",
          "author": null,
          "description": "Comments",
          "link": "https://www.blender.org/user-stories/blender-and-the-rabbids/",
          "publishedOn": "2021-07-04T13:04:55.000Z",
          "wordCount": 2343,
          "title": "Blender and the Rabbids"
        },
        {
          "id": "https://blog.bitgloss.ro/2020/10/stop-mocking-your-system/",
          "author": null,
          "description": "Comments",
          "link": "https://blog.bitgloss.ro/2020/10/stop-mocking-your-system/",
          "publishedOn": "2021-07-04T12:36:17.000Z",
          "wordCount": 704,
          "title": "Stop mocking your system"
        },
        {
          "id": "https://github.com/The-Powder-Toy/The-Powder-Toy",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/The-Powder-Toy/The-Powder-Toy",
          "publishedOn": "2021-07-04T11:42:58.000Z",
          "wordCount": 1332,
          "title": "The Powder Toy"
        },
        {
          "id": "https://ena.computer/",
          "author": null,
          "description": "Comments",
          "link": "https://ena.computer/",
          "publishedOn": "2021-07-04T09:56:39.000Z",
          "wordCount": 546,
          "title": "Electron tube New Automatic Computer"
        },
        {
          "id": "https://groups.google.com/a/chromium.org/g/ct-policy/c/PCkKU357M2Q/",
          "author": null,
          "description": "Comments",
          "link": "https://groups.google.com/a/chromium.org/g/ct-policy/c/PCkKU357M2Q/",
          "publishedOn": "2021-07-04T09:13:12.000Z",
          "wordCount": 1209,
          "title": "Single random bit flip causes error in certificate transparency log"
        },
        {
          "id": "https://www.wsj.com/articles/highly-irregular-review-an-eloquent-confusion-11625177826",
          "author": null,
          "description": "Comments",
          "link": "https://www.wsj.com/articles/highly-irregular-review-an-eloquent-confusion-11625177826",
          "publishedOn": "2021-07-04T04:31:14.000Z",
          "wordCount": 1347,
          "title": "‘Highly Irregular’ Review: An Eloquent Confusion"
        },
        {
          "id": "https://thistooshallgrow.com/blog/mindful-mobile-os",
          "author": null,
          "description": "Comments",
          "link": "https://thistooshallgrow.com/blog/mindful-mobile-os",
          "publishedOn": "2021-07-03T20:40:05.000Z",
          "wordCount": 1705,
          "title": "A Mindful Mobile OS"
        },
        {
          "id": "https://about.sourcegraph.com/blog/how-not-to-break-a-search-engine-unglamorous-engineering/",
          "author": null,
          "description": "Comments",
          "link": "https://about.sourcegraph.com/blog/how-not-to-break-a-search-engine-unglamorous-engineering/",
          "publishedOn": "2021-07-03T19:43:38.000Z",
          "wordCount": 2615,
          "title": "How not to break a search engine"
        },
        {
          "id": "https://review.firstround.com/the-right-way-to-ship-software",
          "author": null,
          "description": "Comments",
          "link": "https://review.firstround.com/the-right-way-to-ship-software",
          "publishedOn": "2021-07-03T11:01:42.000Z",
          "wordCount": 2591,
          "title": "Ways to ship software"
        },
        {
          "id": "https://www.stripes.com/theaters/middle_east/2021-07-02/pokemon-go-bagram-troop-withdrawal-2027917.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.stripes.com/theaters/middle_east/2021-07-02/pokemon-go-bagram-troop-withdrawal-2027917.html",
          "publishedOn": "2021-07-02T23:28:54.000Z",
          "wordCount": 1410,
          "title": "Soldiers watch the US withdrawal from Bagram through the lens of Pokemon Go"
        },
        {
          "id": "https://duo.com/decipher/an-oral-history-of-the-l0pht",
          "author": null,
          "description": "Comments",
          "link": "https://duo.com/decipher/an-oral-history-of-the-l0pht",
          "publishedOn": "2021-07-02T23:02:29.000Z",
          "wordCount": 3612,
          "title": "An Oral History of the L0pht (2018)"
        },
        {
          "id": "https://siberiantimes.com/other/others/news/kolyma-highway-in-yakutia-also-known-as-the-road-of-bones-is-on-fire-and-temporarily-shut/",
          "author": null,
          "description": "Comments",
          "link": "https://siberiantimes.com/other/others/news/kolyma-highway-in-yakutia-also-known-as-the-road-of-bones-is-on-fire-and-temporarily-shut/",
          "publishedOn": "2021-07-02T22:41:59.000Z",
          "wordCount": 953,
          "title": "Kolyma highway in Yakutia, also known as the Road of Bones, is on fire"
        },
        {
          "id": "https://www.workatastartup.com/jobs/29595",
          "author": null,
          "description": "Comments",
          "link": "https://www.workatastartup.com/jobs/29595",
          "publishedOn": "2021-07-02T21:01:11.000Z",
          "wordCount": 610,
          "title": "Cortex (YC W20) Is Hiring Founding Engineers"
        },
        {
          "id": "https://science.sciencemag.org/content/373/6550/11",
          "author": null,
          "description": "Comments",
          "link": "https://science.sciencemag.org/content/373/6550/11",
          "publishedOn": "2021-07-02T20:00:35.000Z",
          "wordCount": null,
          "title": "‘Dragon Man’ may be an elusive Denisovan"
        },
        {
          "id": "https://www.technologyreview.com/2021/06/29/1027290/gain-of-function-risky-bat-virus-engineering-links-america-to-wuhan/",
          "author": null,
          "description": "Comments",
          "link": "https://www.technologyreview.com/2021/06/29/1027290/gain-of-function-risky-bat-virus-engineering-links-america-to-wuhan/",
          "publishedOn": "2021-07-02T19:58:07.000Z",
          "wordCount": 3674,
          "title": "The risky bat-virus engineering that links America to Wuhan"
        },
        {
          "id": "https://rateourcops.org/",
          "author": null,
          "description": "Comments",
          "link": "https://rateourcops.org/",
          "publishedOn": "2021-07-02T19:52:32.000Z",
          "wordCount": 372,
          "title": "RateOurCops – Like Yelp, but for Cops"
        },
        {
          "id": "https://www.economist.com/science-and-technology/2021/07/01/could-miniature-forests-help-air-condition-cities",
          "author": null,
          "description": "Comments",
          "link": "https://www.economist.com/science-and-technology/2021/07/01/could-miniature-forests-help-air-condition-cities",
          "publishedOn": "2021-07-02T19:50:39.000Z",
          "wordCount": 1626,
          "title": "Could miniature forests help air-condition cities?"
        },
        {
          "id": "https://www.righto.com/2021/07/space-age-electronics-inside-ge-thin.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.righto.com/2021/07/space-age-electronics-inside-ge-thin.html",
          "publishedOn": "2021-07-02T19:37:46.000Z",
          "wordCount": 2288,
          "title": "“Space age electronics”: Inside a GE thin-film paperweight from the 1960s"
        },
        {
          "id": "https://centuriesofsound.com/2021/06/14/1936/",
          "author": null,
          "description": "Comments",
          "link": "https://centuriesofsound.com/2021/06/14/1936/",
          "publishedOn": "2021-07-02T18:53:12.000Z",
          "wordCount": 2517,
          "title": "Centuries of Sound: 1936"
        },
        {
          "id": "http://www.cs.utah.edu/~mflatt/past-courses/cs6510/public_html/lispm.pdf",
          "author": null,
          "description": "Comments",
          "link": "http://www.cs.utah.edu/~mflatt/past-courses/cs6510/public_html/lispm.pdf",
          "publishedOn": "2021-07-02T18:30:44.000Z",
          "wordCount": 14538,
          "title": "Architecture of Lisp Machines (2008) [pdf]"
        },
        {
          "id": "https://brunocalza.me/getting-to-know-logical-clocks-by-implementing-them/",
          "author": null,
          "description": "Comments",
          "link": "https://brunocalza.me/getting-to-know-logical-clocks-by-implementing-them/",
          "publishedOn": "2021-07-02T17:21:01.000Z",
          "wordCount": 2057,
          "title": "Getting to know logical clocks by implementing them"
        },
        {
          "id": "https://github.com/robinhouston/image-unshredding",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/robinhouston/image-unshredding",
          "publishedOn": "2021-07-02T16:16:26.000Z",
          "wordCount": 1144,
          "title": "Image unshredding using a TSP solver"
        },
        {
          "id": "https://krebsonsecurity.com/2021/07/another-0-day-looms-for-many-western-digital-users/",
          "author": null,
          "description": "Comments",
          "link": "https://krebsonsecurity.com/2021/07/another-0-day-looms-for-many-western-digital-users/",
          "publishedOn": "2021-07-02T16:14:16.000Z",
          "wordCount": 1383,
          "title": "Another 0-day looms for many Western Digital users"
        },
        {
          "id": "https://github.com/neovim/neovim/releases/tag/v0.5.0",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/neovim/neovim/releases/tag/v0.5.0",
          "publishedOn": "2021-07-02T16:10:37.000Z",
          "wordCount": 392,
          "title": "Neovim v0.5"
        },
        {
          "id": "https://supabase.io/blog/2021/07/01/roles-postgres-hooks",
          "author": null,
          "description": "Comments",
          "link": "https://supabase.io/blog/2021/07/01/roles-postgres-hooks",
          "publishedOn": "2021-07-02T15:31:45.000Z",
          "wordCount": 2115,
          "title": "Protecting reserved roles with PostgreSQL Hooks"
        },
        {
          "id": "https://newsroom.ibm.com/IBM-Leadership-Changes",
          "author": null,
          "description": "Comments",
          "link": "https://newsroom.ibm.com/IBM-Leadership-Changes",
          "publishedOn": "2021-07-02T14:41:31.000Z",
          "wordCount": 918,
          "title": "Jim Whitehurst to step down as IBM President"
        },
        {
          "id": "https://twitter.com/mitsuhiko/status/1410886329924194309",
          "author": null,
          "description": "Comments",
          "link": "https://twitter.com/mitsuhiko/status/1410886329924194309",
          "publishedOn": "2021-07-02T11:52:19.000Z",
          "wordCount": 196,
          "title": "Copilot regurgitating Quake code, including sweary comments"
        },
        {
          "id": "https://www.medialens.org/2021/a-remarkable-silence-media-blackout-after-key-witness-against-assange-admits-lying/",
          "author": null,
          "description": "Comments",
          "link": "https://www.medialens.org/2021/a-remarkable-silence-media-blackout-after-key-witness-against-assange-admits-lying/",
          "publishedOn": "2021-07-02T11:17:20.000Z",
          "wordCount": 3037,
          "title": "Media blackout after key witness against Assange admits lying"
        },
        {
          "id": "https://github.com/semiosis/pen.el/",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/semiosis/pen.el/",
          "publishedOn": "2021-07-02T09:55:27.000Z",
          "wordCount": 1364,
          "title": "Pen, a GPL Copilot for Emacs"
        },
        {
          "id": "https://ncase.me/rss/",
          "author": null,
          "description": "Comments",
          "link": "https://ncase.me/rss/",
          "publishedOn": "2021-07-02T09:36:05.000Z",
          "wordCount": 764,
          "title": "Back to the Future with RSS"
        },
        {
          "id": "https://www.rnz.co.nz/programmes/in-depth-special-projects/story/2018800662/the-yoghurt-mafia",
          "author": null,
          "description": "Comments",
          "link": "https://www.rnz.co.nz/programmes/in-depth-special-projects/story/2018800662/the-yoghurt-mafia",
          "publishedOn": "2021-07-02T08:58:10.000Z",
          "wordCount": 280,
          "title": "The Yoghurt Mafia"
        },
        {
          "id": "https://www.gleech.org/psych",
          "author": null,
          "description": "Comments",
          "link": "https://www.gleech.org/psych",
          "publishedOn": "2021-07-02T08:53:50.000Z",
          "wordCount": 6762,
          "title": "Reversals in Psychology (2020)"
        },
        {
          "id": "https://fortelabs.co/blog/mise-en-place-for-knowledge-workers/",
          "author": null,
          "description": "Comments",
          "link": "https://fortelabs.co/blog/mise-en-place-for-knowledge-workers/",
          "publishedOn": "2021-07-02T07:22:27.000Z",
          "wordCount": 3987,
          "title": "Mise-en-place for knowledge workers"
        },
        {
          "id": "https://news.mit.edu/2020/passive-solar-powered-water-desalination-0207",
          "author": null,
          "description": "Comments",
          "link": "https://news.mit.edu/2020/passive-solar-powered-water-desalination-0207",
          "publishedOn": "2021-07-02T06:33:06.000Z",
          "wordCount": 1981,
          "title": "Simple, solar-powered water desalination (2020)"
        },
        {
          "id": "https://placesjournal.org/article/the-filing-cabinet-and-20th-century-information-infrastructure/",
          "author": null,
          "description": "Comments",
          "link": "https://placesjournal.org/article/the-filing-cabinet-and-20th-century-information-infrastructure/",
          "publishedOn": "2021-07-02T05:31:55.000Z",
          "wordCount": 6436,
          "title": "The Filing Cabinet"
        },
        {
          "id": "https://research.protocol.ai/blog/2021/designing-a-dataflow-editor-with-typescript-and-react/",
          "author": null,
          "description": "Comments",
          "link": "https://research.protocol.ai/blog/2021/designing-a-dataflow-editor-with-typescript-and-react/",
          "publishedOn": "2021-07-02T00:30:45.000Z",
          "wordCount": 8162,
          "title": "Designing a Dataflow Editor with TypeScript and React"
        },
        {
          "id": "https://granta.com/kerouac-ginsberg-the-letters/",
          "author": null,
          "description": "Comments",
          "link": "https://granta.com/kerouac-ginsberg-the-letters/",
          "publishedOn": "2021-07-01T21:04:47.000Z",
          "wordCount": 3841,
          "title": "Kerouac and Ginsberg Letters"
        },
        {
          "id": "https://www.lrb.co.uk/the-paper/v43/n13/erin-maglaque/ten-small-raisins",
          "author": null,
          "description": "Comments",
          "link": "https://www.lrb.co.uk/the-paper/v43/n13/erin-maglaque/ten-small-raisins",
          "publishedOn": "2021-07-01T18:46:58.000Z",
          "wordCount": 2509,
          "title": "Inky Fingers: The Making of Books in Early Modern Europe"
        },
        {
          "id": "https://www.sparkfun.com/news/3917",
          "author": null,
          "description": "Comments",
          "link": "https://www.sparkfun.com/news/3917",
          "publishedOn": "2021-06-30T23:00:58.000Z",
          "wordCount": null,
          "title": "SparkFun Hooks a Patent Troll"
        },
        {
          "id": "https://www.seattletimes.com/business/federal-targeting-of-americans-records-is-routine-microsoft-exec-testifies/",
          "author": null,
          "description": "Comments",
          "link": "https://www.seattletimes.com/business/federal-targeting-of-americans-records-is-routine-microsoft-exec-testifies/",
          "publishedOn": "2021-06-30T22:02:47.000Z",
          "wordCount": 1160,
          "title": "Microsoft exec: Targeting of Americans’ records ‘routine’"
        },
        {
          "id": "https://www.tesorio.com/careers#job-openings",
          "author": null,
          "description": "Comments",
          "link": "https://www.tesorio.com/careers#job-openings",
          "publishedOn": "2021-06-30T21:52:24.000Z",
          "wordCount": 386,
          "title": "Tesorio (YC S15) Is Hiring – Join Our 100% Distributed Fintech Team"
        },
        {
          "id": "https://www.rainforestqa.com/blog/accessible-quality",
          "author": null,
          "description": "Comments",
          "link": "https://www.rainforestqa.com/blog/accessible-quality",
          "publishedOn": "2021-06-30T21:45:33.000Z",
          "wordCount": 3798,
          "title": "Asking developers to do QA is broken – why anyone should own QA"
        },
        {
          "id": "https://twitter.com/AlexanderNL/status/1410253599502962692",
          "author": null,
          "description": "Comments",
          "link": "https://twitter.com/AlexanderNL/status/1410253599502962692",
          "publishedOn": "2021-06-30T21:23:43.000Z",
          "wordCount": 196,
          "title": "Brickit – scans your Lego bricks and helps you build new creations"
        },
        {
          "id": "https://www.macrumors.com/2021/06/30/os-x-lion-mountain-lion-free-to-download/",
          "author": null,
          "description": "Comments",
          "link": "https://www.macrumors.com/2021/06/30/os-x-lion-mountain-lion-free-to-download/",
          "publishedOn": "2021-06-30T20:26:46.000Z",
          "wordCount": 2093,
          "title": "Apple Makes Mac OS X Lion and Mountain Lion Free to Download"
        },
        {
          "id": "https://www.theregister.com/2021/06/30/ibm_email_outage/",
          "author": null,
          "description": "Comments",
          "link": "https://www.theregister.com/2021/06/30/ibm_email_outage/",
          "publishedOn": "2021-06-30T20:15:50.000Z",
          "wordCount": 2609,
          "title": "IBM's 18-month company-wide email system migration has been a disaster: sources"
        },
        {
          "id": "https://jacobobryant.com/blog/understand/",
          "author": null,
          "description": "Comments",
          "link": "https://jacobobryant.com/blog/understand/",
          "publishedOn": "2021-06-30T17:59:09.000Z",
          "wordCount": 497,
          "title": "Move fast, but understand the problem first"
        },
        {
          "id": "https://fly.io/blog/globally-distributed-postgres/",
          "author": null,
          "description": "Comments",
          "link": "https://fly.io/blog/globally-distributed-postgres/",
          "publishedOn": "2021-06-30T17:08:33.000Z",
          "wordCount": 2350,
          "title": "Globally Distributed Postgres"
        },
        {
          "id": "https://pluralistic.net/2021/06/29/three-times-is-enemy-action/#ctc",
          "author": null,
          "description": "Comments",
          "link": "https://pluralistic.net/2021/06/29/three-times-is-enemy-action/#ctc",
          "publishedOn": "2021-06-30T16:36:33.000Z",
          "wordCount": 2323,
          "title": "Intuit sabotages the Child Tax Credit"
        },
        {
          "id": "https://www.reuters.com/technology/broker-robinhood-pay-70-mln-systemic-supervisory-failures-2021-06-30/",
          "author": null,
          "description": "Comments",
          "link": "https://www.reuters.com/technology/broker-robinhood-pay-70-mln-systemic-supervisory-failures-2021-06-30/",
          "publishedOn": "2021-06-30T16:33:01.000Z",
          "wordCount": 1050,
          "title": "Robinhood to pay $70M for 'systemic supervisory failures'"
        },
        {
          "id": "http://crpgaddict.blogspot.com/2021/06/brief-everything-we-know-about-1970s.html",
          "author": null,
          "description": "Comments",
          "link": "http://crpgaddict.blogspot.com/2021/06/brief-everything-we-know-about-1970s.html",
          "publishedOn": "2021-06-30T16:30:04.000Z",
          "wordCount": 6071,
          "title": "1970s mainframe RPGs we can no longer play"
        },
        {
          "id": "https://git-history.jpalmer.dev/",
          "author": null,
          "description": "Comments",
          "link": "https://git-history.jpalmer.dev/",
          "publishedOn": "2021-06-30T15:24:12.000Z",
          "wordCount": 6,
          "title": "Show HN: An interactive visual history of Git development"
        },
        {
          "id": "https://principles.dev/",
          "author": null,
          "description": "Comments",
          "link": "https://principles.dev/",
          "publishedOn": "2021-06-30T13:59:47.000Z",
          "wordCount": 272,
          "title": "Software Engineering principles to make teams better"
        },
        {
          "id": "https://zitadel.ch/blog/treat-clusters-as-cattle/",
          "author": null,
          "description": "Comments",
          "link": "https://zitadel.ch/blog/treat-clusters-as-cattle/",
          "publishedOn": "2021-06-30T13:24:36.000Z",
          "wordCount": 2006,
          "title": "Treat Kubernetes clusters as cattle, not pets"
        },
        {
          "id": "https://www.theatlantic.com/technology/archive/2021/06/the-internet-is-a-collective-hallucination/619320/",
          "author": null,
          "description": "Comments",
          "link": "https://www.theatlantic.com/technology/archive/2021/06/the-internet-is-a-collective-hallucination/619320/",
          "publishedOn": "2021-06-30T13:15:35.000Z",
          "wordCount": 6347,
          "title": "Link rot and content drift are endemic to the web"
        },
        {
          "id": "https://nicholasreese.com/lessons-from-building-a-static-site-generator/",
          "author": null,
          "description": "Comments",
          "link": "https://nicholasreese.com/lessons-from-building-a-static-site-generator/",
          "publishedOn": "2021-06-30T12:56:43.000Z",
          "wordCount": 5646,
          "title": "Lessons from Building a Static Site Generator (2020)"
        },
        {
          "id": "https://madned.substack.com/p/black-hat-exploits-of-the-stupid",
          "author": null,
          "description": "Comments",
          "link": "https://madned.substack.com/p/black-hat-exploits-of-the-stupid",
          "publishedOn": "2021-06-30T12:44:24.000Z",
          "wordCount": 3684,
          "title": "Black Hat Exploits of the Stupid-Easy 80s"
        },
        {
          "id": "https://www.cnbc.com/2021/06/29/more-people-plan-to-quit-as-return-to-work-plans-go-into-effect-.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.cnbc.com/2021/06/29/more-people-plan-to-quit-as-return-to-work-plans-go-into-effect-.html",
          "publishedOn": "2021-06-30T12:25:40.000Z",
          "wordCount": 891,
          "title": "‘Great Resignation’ gains steam as return-to-work plans take effect"
        },
        {
          "id": "https://twitter.com/eevee/status/1410037309848752128",
          "author": null,
          "description": "Comments",
          "link": "https://twitter.com/eevee/status/1410037309848752128",
          "publishedOn": "2021-06-30T12:00:41.000Z",
          "wordCount": 196,
          "title": "GitHub co-pilot as open source code laundering?"
        },
        {
          "id": "https://jacobian.org/2021/may/20/estimation/",
          "author": null,
          "description": "Comments",
          "link": "https://jacobian.org/2021/may/20/estimation/",
          "publishedOn": "2021-06-30T11:29:57.000Z",
          "wordCount": 768,
          "title": "Software estimation is hard – do it anyway"
        },
        {
          "id": "https://johz.bearblog.dev/book-review-philosophy-software-design/",
          "author": null,
          "description": "Comments",
          "link": "https://johz.bearblog.dev/book-review-philosophy-software-design/",
          "publishedOn": "2021-06-30T10:14:33.000Z",
          "wordCount": 1787,
          "title": "Book Review: A Philosophy of Software Design (2020)"
        },
        {
          "id": "https://publicdomainreview.org/collection/japanese-fireworks-catalogues",
          "author": null,
          "description": "Comments",
          "link": "https://publicdomainreview.org/collection/japanese-fireworks-catalogues",
          "publishedOn": "2021-06-30T04:32:54.000Z",
          "wordCount": 1728,
          "title": "Flowers of Fire: Illustrations from Japanese Fireworks Catalogues (ca. 1880s)"
        },
        {
          "id": "https://kleinbottle.com/#AMAZON%20BRAND%20HIJACKING",
          "author": null,
          "description": "Comments",
          "link": "https://kleinbottle.com/#AMAZON%20BRAND%20HIJACKING",
          "publishedOn": "2021-06-30T04:18:34.000Z",
          "wordCount": null,
          "title": "A foreign seller has hijacked my Amazon Klein bottle listing"
        },
        {
          "id": "https://medium.com/@fserb/metaphors-in-games-21ee033ad260",
          "author": null,
          "description": "Comments",
          "link": "https://medium.com/@fserb/metaphors-in-games-21ee033ad260",
          "publishedOn": "2021-06-29T23:38:18.000Z",
          "wordCount": 1762,
          "title": "Metaphors in Games (2016)"
        },
        {
          "id": "https://www.bbc.com/travel/article/20210616-funazushi-the-fermented-predecessor-of-modern-sushi?utm_source=bengtan&utm_medium=email",
          "author": null,
          "description": "Comments",
          "link": "https://www.bbc.com/travel/article/20210616-funazushi-the-fermented-predecessor-of-modern-sushi?utm_source=bengtan&utm_medium=email",
          "publishedOn": "2021-06-29T21:46:52.000Z",
          "wordCount": 1874,
          "title": "Funazushi: The fermented predecessor of modern sushi"
        },
        {
          "id": "https://itnext.io/im-changing-how-i-review-code-dbf212507e5f",
          "author": null,
          "description": "Comments",
          "link": "https://itnext.io/im-changing-how-i-review-code-dbf212507e5f",
          "publishedOn": "2021-06-29T21:35:59.000Z",
          "wordCount": 1741,
          "title": "Changing how I review code"
        },
        {
          "id": "https://arstechnica.com/gaming/2021/06/what-the-hecks-an-intellivision-amico-consoles-leaky-dev-portal-offers-hints/",
          "author": null,
          "description": "Comments",
          "link": "https://arstechnica.com/gaming/2021/06/what-the-hecks-an-intellivision-amico-consoles-leaky-dev-portal-offers-hints/",
          "publishedOn": "2021-06-29T20:05:05.000Z",
          "wordCount": 1429,
          "title": "What’s an Intellivision Amico? Console’s leaky dev portal offers hints"
        },
        {
          "id": "https://www.laphamsquarterly.org/roundtable/families-choice",
          "author": null,
          "description": "Comments",
          "link": "https://www.laphamsquarterly.org/roundtable/families-choice",
          "publishedOn": "2021-06-29T05:49:51.000Z",
          "wordCount": 2179,
          "title": "Families of Choice: On the Shakers and Catholics in Early America"
        },
        {
          "id": "https://www.pcmag.com/news/peloton-axes-free-just-run-feature-from-treadmill-bricking-it-for-non-subscribers",
          "author": null,
          "description": "Comments",
          "link": "https://www.pcmag.com/news/peloton-axes-free-just-run-feature-from-treadmill-bricking-it-for-non-subscribers",
          "publishedOn": "2021-06-29T00:04:02.000Z",
          "wordCount": 1792,
          "title": "Peloton Axes Free 'Just Run' Feature from Treadmill"
        },
        {
          "id": "https://www.marketwatch.com/story/one-of-the-largest-owners-of-bitcoin-who-reportedly-held-as-much-as-1-billion-is-dead-at-41-reports-11624904721",
          "author": null,
          "description": "Comments",
          "link": "https://www.marketwatch.com/story/one-of-the-largest-owners-of-bitcoin-who-reportedly-held-as-much-as-1-billion-is-dead-at-41-reports-11624904721",
          "publishedOn": "2021-06-28T23:15:49.000Z",
          "wordCount": 989,
          "title": "One of the largest owners of Bitcoin, reportedly held over 1B dead at 41"
        },
        {
          "id": "https://www.sciencealert.com/this-simple-test-reveals-if-your-mental-images-are-more-vivid-than-other-people-s",
          "author": null,
          "description": "Comments",
          "link": "https://www.sciencealert.com/this-simple-test-reveals-if-your-mental-images-are-more-vivid-than-other-people-s",
          "publishedOn": "2021-06-28T22:39:15.000Z",
          "wordCount": 930,
          "title": "Simple Test Reveals If Your Mental Images Are More Vivid Than Other People's"
        },
        {
          "id": "https://www.nbcnews.com/tech/tech-news/youtube-reinstates-channel-devoted-exposing-conservative-extremism-rcna1286",
          "author": null,
          "description": "Comments",
          "link": "https://www.nbcnews.com/tech/tech-news/youtube-reinstates-channel-devoted-exposing-conservative-extremism-rcna1286",
          "publishedOn": "2021-06-28T22:14:23.000Z",
          "wordCount": 758,
          "title": "YouTube reinstates Right Wing Watch"
        },
        {
          "id": "https://news.ycombinator.com/item?id=27668040",
          "author": null,
          "description": "Comments",
          "link": "https://news.ycombinator.com/item?id=27668040",
          "publishedOn": "2021-06-28T21:00:02.000Z",
          "wordCount": 194,
          "title": "SIRUM (YC W15) is hiring to make access to medicine more equitable"
        },
        {
          "id": "http://nvidia-research-mingyuliu.com/vid2vid-cameo/",
          "author": null,
          "description": "Comments",
          "link": "http://nvidia-research-mingyuliu.com/vid2vid-cameo/",
          "publishedOn": "2021-06-28T19:20:55.000Z",
          "wordCount": 3,
          "title": "Nvidia Vid2vid-Cameo Demo"
        },
        {
          "id": "https://cedwards.xyz/the-fuck-you-pattern/",
          "author": null,
          "description": "Comments",
          "link": "https://cedwards.xyz/the-fuck-you-pattern/",
          "publishedOn": "2021-06-28T19:18:44.000Z",
          "wordCount": 306,
          "title": "The 'Fuck You' Pattern"
        },
        {
          "id": "https://www.cnbc.com/2021/06/28/judge-dismisses-ftc-antitrust-complaint-against-facebook.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.cnbc.com/2021/06/28/judge-dismisses-ftc-antitrust-complaint-against-facebook.html",
          "publishedOn": "2021-06-28T19:17:43.000Z",
          "wordCount": 953,
          "title": "Judge dismisses FTC antitrust complaint against Facebook"
        },
        {
          "id": "https://github.com/andronov04/mondrian-art",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/andronov04/mondrian-art",
          "publishedOn": "2021-06-28T18:23:30.000Z",
          "wordCount": 740,
          "title": "Show HN: Art Generator Neoplasticism"
        },
        {
          "id": "https://blogs.sciencemag.org/pipeline/archives/2021/06/28/an-announcement-about-the-comment-section",
          "author": null,
          "description": "Comments",
          "link": "https://blogs.sciencemag.org/pipeline/archives/2021/06/28/an-announcement-about-the-comment-section",
          "publishedOn": "2021-06-28T18:22:50.000Z",
          "wordCount": 6017,
          "title": "An announcement about the comment section"
        },
        {
          "id": "https://arstechnica.com/tech-policy/2021/06/amazon-is-firing-flex-workers-using-algorithms-with-little-human-intervention/",
          "author": null,
          "description": "Comments",
          "link": "https://arstechnica.com/tech-policy/2021/06/amazon-is-firing-flex-workers-using-algorithms-with-little-human-intervention/",
          "publishedOn": "2021-06-28T17:06:51.000Z",
          "wordCount": 1432,
          "title": "Amazon is using algorithms with little human intervention to fire Flex workers"
        },
        {
          "id": "https://sample.findka.com/?ref=showhn",
          "author": null,
          "description": "Comments",
          "link": "https://sample.findka.com/?ref=showhn",
          "publishedOn": "2021-06-28T16:32:44.000Z",
          "wordCount": 132,
          "title": "Show HN: The Sample – newsletters curated for you with machine learning"
        },
        {
          "id": "https://caseyhandmer.wordpress.com/2021/04/09/the-martian-starship/",
          "author": null,
          "description": "Comments",
          "link": "https://caseyhandmer.wordpress.com/2021/04/09/the-martian-starship/",
          "publishedOn": "2021-06-28T16:17:32.000Z",
          "wordCount": 4181,
          "title": "“The Martian” + Starship"
        },
        {
          "id": "https://www.thischemicaldoesnotexist.com/",
          "author": null,
          "description": "Comments",
          "link": "https://www.thischemicaldoesnotexist.com/",
          "publishedOn": "2021-06-28T15:32:24.000Z",
          "wordCount": 7,
          "title": "This Chemical Does Not Exist"
        },
        {
          "id": "https://www.optery.com/introducing-optery-remove-yourself-from-150-people-search-sites-like-truthfinder-mylife-radaris-socialcatfish-spokeo-whitepages/",
          "author": null,
          "description": "Comments",
          "link": "https://www.optery.com/introducing-optery-remove-yourself-from-150-people-search-sites-like-truthfinder-mylife-radaris-socialcatfish-spokeo-whitepages/",
          "publishedOn": "2021-06-28T14:04:08.000Z",
          "wordCount": 1430,
          "title": "Show HN: Optery – See the private info data brokers are posting about you online"
        },
        {
          "id": "https://2ality.com/2021/06/temporal-api.html",
          "author": null,
          "description": "Comments",
          "link": "https://2ality.com/2021/06/temporal-api.html",
          "publishedOn": "2021-06-28T13:26:59.000Z",
          "wordCount": 3196,
          "title": "Temporal: Getting started with JavaScript's new date time API"
        },
        {
          "id": "https://www.freethink.com/shows/just-might-work/how-to-make-insulin",
          "author": null,
          "description": "Comments",
          "link": "https://www.freethink.com/shows/just-might-work/how-to-make-insulin",
          "publishedOn": "2021-06-28T13:25:03.000Z",
          "wordCount": 1538,
          "title": "Biohackers take aim at big pharma’s stranglehold on insulin"
        },
        {
          "id": "https://fs.blog/2021/06/memory-palace/",
          "author": null,
          "description": "Comments",
          "link": "https://fs.blog/2021/06/memory-palace/",
          "publishedOn": "2021-06-28T13:16:39.000Z",
          "wordCount": 2988,
          "title": "The Method of Loci: Build Your Memory Palace"
        },
        {
          "id": "https://ipds.io/",
          "author": null,
          "description": "Comments",
          "link": "https://ipds.io/",
          "publishedOn": "2021-06-28T10:59:31.000Z",
          "wordCount": 99,
          "title": "Subdomains for IPFS"
        },
        {
          "id": "https://www.bbc.com/news/science-environment-57628653",
          "author": null,
          "description": "Comments",
          "link": "https://www.bbc.com/news/science-environment-57628653",
          "publishedOn": "2021-06-28T10:39:54.000Z",
          "wordCount": 1052,
          "title": "China releases videos of its Zhurong Mars rover"
        },
        {
          "id": "https://blog.dbmiller.org/2021-06-28-dear-google-public-domain-compositions-exist",
          "author": null,
          "description": "Comments",
          "link": "https://blog.dbmiller.org/2021-06-28-dear-google-public-domain-compositions-exist",
          "publishedOn": "2021-06-28T09:31:54.000Z",
          "wordCount": 597,
          "title": "Dear Google: Public domain compositions exist"
        },
        {
          "id": "https://github.com/codr7/whirlog",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/codr7/whirlog",
          "publishedOn": "2021-06-28T01:28:59.000Z",
          "wordCount": 771,
          "title": "Show HN: Minimal versioned log structured relational DB in Common Lisp"
        },
        {
          "id": "https://thereader.mitpress.mit.edu/recounting-cognitive-history-of-numerals/",
          "author": null,
          "description": "Comments",
          "link": "https://thereader.mitpress.mit.edu/recounting-cognitive-history-of-numerals/",
          "publishedOn": "2021-06-28T00:10:30.000Z",
          "wordCount": 3269,
          "title": "Re-counting the cognitive history of numerals"
        },
        {
          "id": "https://danilafe.com/blog/math_rendering_is_wrong/",
          "author": null,
          "description": "Comments",
          "link": "https://danilafe.com/blog/math_rendering_is_wrong/",
          "publishedOn": "2021-06-27T23:27:23.000Z",
          "wordCount": 1652,
          "title": "Math Rendering Is Wrong"
        },
        {
          "id": "https://gizmodo.com/canada-to-make-online-hate-speech-a-crime-punishable-by-1847163213",
          "author": null,
          "description": "Comments",
          "link": "https://gizmodo.com/canada-to-make-online-hate-speech-a-crime-punishable-by-1847163213",
          "publishedOn": "2021-06-27T23:11:28.000Z",
          "wordCount": 657,
          "title": "Canada to Make Online Hate Speech a Crime Punishable by $16,000 Fine"
        },
        {
          "id": "https://www.gosh.nhs.uk/news/gosh-led-metformin-trial-dramatically-reduces-seizures-people-tuberous-sclerosis/",
          "author": null,
          "description": "Comments",
          "link": "https://www.gosh.nhs.uk/news/gosh-led-metformin-trial-dramatically-reduces-seizures-people-tuberous-sclerosis/",
          "publishedOn": "2021-06-27T22:36:49.000Z",
          "wordCount": 2871,
          "title": "Metformin trial reduces seizures and brain tumours in Tuberous Sclerosis"
        },
        {
          "id": "https://jobs.lever.co/substackinc/5b1f2f5c-3809-4278-b93d-379433a34d81",
          "author": null,
          "description": "Comments",
          "link": "https://jobs.lever.co/substackinc/5b1f2f5c-3809-4278-b93d-379433a34d81",
          "publishedOn": "2021-06-27T21:00:23.000Z",
          "wordCount": 742,
          "title": "Substack (YC W18) is hiring engineers to build the future of writing"
        },
        {
          "id": "https://gitlab.com/mpiroot/rideau/-/blob/master/re/re.md",
          "author": null,
          "description": "Comments",
          "link": "https://gitlab.com/mpiroot/rideau/-/blob/master/re/re.md",
          "publishedOn": "2021-06-27T20:26:27.000Z",
          "wordCount": 209,
          "title": "Reverse-engineering the Final Fantasy: Theatrhythm track format"
        },
        {
          "id": "https://dodisturb.me/posts/2021-06-27-Typed-Programs-Dont-Leak-Data.html",
          "author": null,
          "description": "Comments",
          "link": "https://dodisturb.me/posts/2021-06-27-Typed-Programs-Dont-Leak-Data.html",
          "publishedOn": "2021-06-27T20:06:41.000Z",
          "wordCount": 4464,
          "title": "Typed Programs Don't Leak Data"
        },
        {
          "id": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6163803/",
          "author": null,
          "description": "Comments",
          "link": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6163803/",
          "publishedOn": "2021-06-27T20:04:18.000Z",
          "wordCount": 11984,
          "title": "Challenges in the diagnosis of magnesium status"
        },
        {
          "id": "https://github.com/cirosantilli/x86-bare-metal-examples",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/cirosantilli/x86-bare-metal-examples",
          "publishedOn": "2021-06-27T19:04:39.000Z",
          "wordCount": 10541,
          "title": "x86 Bare Metal Examples: Minimal operating systems, learn x86 system programming"
        },
        {
          "id": "https://www.saminiir.com/lets-code-tcp-ip-stack-1-ethernet-arp/",
          "author": null,
          "description": "Comments",
          "link": "https://www.saminiir.com/lets-code-tcp-ip-stack-1-ethernet-arp/",
          "publishedOn": "2021-06-27T18:55:29.000Z",
          "wordCount": 1793,
          "title": "Let's code a TCP/IP stack"
        },
        {
          "id": "https://www.eff.org/press/releases/schools-are-spying-students-students-can-fight-back",
          "author": null,
          "description": "Comments",
          "link": "https://www.eff.org/press/releases/schools-are-spying-students-students-can-fight-back",
          "publishedOn": "2021-06-27T18:55:10.000Z",
          "wordCount": 1677,
          "title": "Schools Are Spying on Students – But Students Can Fight Back"
        },
        {
          "id": "https://www.dw.com/en/cubas-covid-vaccine-rivals-biontech-pfizer-moderna/a-58052365",
          "author": null,
          "description": "Comments",
          "link": "https://www.dw.com/en/cubas-covid-vaccine-rivals-biontech-pfizer-moderna/a-58052365",
          "publishedOn": "2021-06-27T18:23:02.000Z",
          "wordCount": 1714,
          "title": "Cuba′s Covid vaccine rivals Pfizer, Moderna"
        },
        {
          "id": "https://lithub.com/the-genius-of-william-shawn-and-the-invention-of-the-new-yorker/",
          "author": null,
          "description": "Comments",
          "link": "https://lithub.com/the-genius-of-william-shawn-and-the-invention-of-the-new-yorker/",
          "publishedOn": "2021-06-27T17:54:01.000Z",
          "wordCount": 3207,
          "title": "The genius of William Shawn"
        },
        {
          "id": "https://news.ycombinator.com/item?id=27653357",
          "author": null,
          "description": "Comments",
          "link": "https://news.ycombinator.com/item?id=27653357",
          "publishedOn": "2021-06-27T17:24:03.000Z",
          "wordCount": 4039,
          "title": "Ask HN: How to learn how to sell?"
        },
        {
          "id": "https://www.unisonweb.org/",
          "author": null,
          "description": "Comments",
          "link": "https://www.unisonweb.org/",
          "publishedOn": "2021-06-27T16:05:51.000Z",
          "wordCount": 187,
          "title": "Unison Programming Language"
        },
        {
          "id": "https://www.seattletimes.com/business/boeing-aerospace/citing-a-serious-flight-test-incident-and-lack-of-design-maturity-faa-slows-boeing-777x-certification/",
          "author": null,
          "description": "Comments",
          "link": "https://www.seattletimes.com/business/boeing-aerospace/citing-a-serious-flight-test-incident-and-lack-of-design-maturity-faa-slows-boeing-777x-certification/",
          "publishedOn": "2021-06-27T16:00:00.000Z",
          "wordCount": 2392,
          "title": "Citing a serious flight test incident, FAA slows Boeing 777X certification"
        },
        {
          "id": "https://constructionphysics.substack.com/p/lumber-price-faq",
          "author": null,
          "description": "Comments",
          "link": "https://constructionphysics.substack.com/p/lumber-price-faq",
          "publishedOn": "2021-06-27T15:11:17.000Z",
          "wordCount": 2348,
          "title": "Why wood has gotten so dang expensive"
        },
        {
          "id": "https://commonsware.com/blog/2021/06/26/windows-11-amazon-uncomfortable-questions.html",
          "author": null,
          "description": "Comments",
          "link": "https://commonsware.com/blog/2021/06/26/windows-11-amazon-uncomfortable-questions.html",
          "publishedOn": "2021-06-27T14:47:04.000Z",
          "wordCount": 961,
          "title": "Windows 11, Amazon, and Uncomfortable Questions"
        },
        {
          "id": "https://lemonspawn.com/turbo-rascal-syntax-error-expected-but-begin/",
          "author": null,
          "description": "Comments",
          "link": "https://lemonspawn.com/turbo-rascal-syntax-error-expected-but-begin/",
          "publishedOn": "2021-06-27T14:44:41.000Z",
          "wordCount": 750,
          "title": "Turbo Rascal Syntax Error"
        },
        {
          "id": "https://www.bbc.com/news/uk-57624942",
          "author": null,
          "description": "Comments",
          "link": "https://www.bbc.com/news/uk-57624942",
          "publishedOn": "2021-06-27T14:27:43.000Z",
          "wordCount": 1959,
          "title": "Classified Ministry of Defence documents found at bus stop"
        },
        {
          "id": "https://ip.sandia.gov/technology.do/techID=66",
          "author": null,
          "description": "Comments",
          "link": "https://ip.sandia.gov/technology.do/techID=66",
          "publishedOn": "2021-06-27T14:10:06.000Z",
          "wordCount": 761,
          "title": "The Sandia Cooler (2016)"
        },
        {
          "id": "https://roblox.fandom.com/wiki/Roblox_on_Linux",
          "author": null,
          "description": "Comments",
          "link": "https://roblox.fandom.com/wiki/Roblox_on_Linux",
          "publishedOn": "2021-06-27T13:00:11.000Z",
          "wordCount": 3750,
          "title": "Roblox on Linux with recent Wine 6.11"
        },
        {
          "id": "https://arxiv.org/abs/2106.12684",
          "author": null,
          "description": "Comments",
          "link": "https://arxiv.org/abs/2106.12684",
          "publishedOn": "2021-06-27T11:59:42.000Z",
          "wordCount": 583,
          "title": "A Pure HTTP/3 Alternative to MQTT-over-QUIC in Resource-Constrained IoT"
        },
        {
          "id": "https://news.ycombinator.com/item?id=27650775",
          "author": null,
          "description": "Comments",
          "link": "https://news.ycombinator.com/item?id=27650775",
          "publishedOn": "2021-06-27T11:45:29.000Z",
          "wordCount": 1895,
          "title": "Ask HN: Good books/courses to learn networking essentials for web developers?"
        },
        {
          "id": "https://thehustle.co/the-economics-of-dollar-stores",
          "author": null,
          "description": "Comments",
          "link": "https://thehustle.co/the-economics-of-dollar-stores",
          "publishedOn": "2021-06-27T10:54:40.000Z",
          "wordCount": 1187,
          "title": "The economics of dollar stores"
        },
        {
          "id": "https://www.cs.cmu.edu/~guyb/papers/Ble93.pdf",
          "author": null,
          "description": "Comments",
          "link": "https://www.cs.cmu.edu/~guyb/papers/Ble93.pdf",
          "publishedOn": "2021-06-27T10:19:43.000Z",
          "wordCount": 7923,
          "title": "Prefix Sums and Their Applications (1990) [pdf]"
        },
        {
          "id": "https://www.railadvent.co.uk/2021/06/groundbreaking-new-bridge-design-could-transform-rail-crossings-across-the-uk.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.railadvent.co.uk/2021/06/groundbreaking-new-bridge-design-could-transform-rail-crossings-across-the-uk.html",
          "publishedOn": "2021-06-27T07:57:04.000Z",
          "wordCount": 2183,
          "title": "Groundbreaking new bridge design could transform rail crossings across the UK"
        },
        {
          "id": "https://www.ics.uci.edu/~lopes/teaching/inf212W12/readings/lambda-calculus-handout.pdf",
          "author": null,
          "description": "Comments",
          "link": "https://www.ics.uci.edu/~lopes/teaching/inf212W12/readings/lambda-calculus-handout.pdf",
          "publishedOn": "2021-06-27T05:32:24.000Z",
          "wordCount": 3190,
          "title": "Lambda Calculus Examples (2009) [pdf]"
        },
        {
          "id": "https://people.scs.carleton.ca/~paulv/toolsjewels.html",
          "author": null,
          "description": "Comments",
          "link": "https://people.scs.carleton.ca/~paulv/toolsjewels.html",
          "publishedOn": "2021-06-27T05:06:45.000Z",
          "wordCount": 750,
          "title": "Computer Security and the Internet: Tools and Jewels"
        },
        {
          "id": "https://github.com/halfer53/winix",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/halfer53/winix",
          "publishedOn": "2021-06-26T23:43:39.000Z",
          "wordCount": 943,
          "title": "I spent 5 years writing my own operating system"
        },
        {
          "id": "https://nicole.express/2021/pinball-in-your-house.html",
          "author": null,
          "description": "Comments",
          "link": "https://nicole.express/2021/pinball-in-your-house.html",
          "publishedOn": "2021-06-26T22:48:12.000Z",
          "wordCount": 1544,
          "title": "The Sears Tele-Games Pinball Breakaway"
        },
        {
          "id": "https://www.reuters.com/technology/exclusive-youtube-takes-down-xinjiang-videos-forces-rights-group-seek-2021-06-25/",
          "author": null,
          "description": "Comments",
          "link": "https://www.reuters.com/technology/exclusive-youtube-takes-down-xinjiang-videos-forces-rights-group-seek-2021-06-25/",
          "publishedOn": "2021-06-26T22:43:41.000Z",
          "wordCount": 1422,
          "title": "YouTube takes down Xinjiang videos, forcing rights group to seek alternative"
        },
        {
          "id": "https://libertysys.com.au/2016/09/the-school-for-sysadmins-who-cant-timesync-good-and-wanna-learn-to-do-other-stuff-good-too-part-1-the-problem-with-ntp/",
          "author": null,
          "description": "Comments",
          "link": "https://libertysys.com.au/2016/09/the-school-for-sysadmins-who-cant-timesync-good-and-wanna-learn-to-do-other-stuff-good-too-part-1-the-problem-with-ntp/",
          "publishedOn": "2021-06-26T22:40:50.000Z",
          "wordCount": 1147,
          "title": "The School for Sysadmins Who Can’t Timesync Good"
        },
        {
          "id": "https://www.tomshardware.com/news/amd-launches-recycled-xbox-series-x-apu-4700s-desktop-kit",
          "author": null,
          "description": "Comments",
          "link": "https://www.tomshardware.com/news/amd-launches-recycled-xbox-series-x-apu-4700s-desktop-kit",
          "publishedOn": "2021-06-26T22:16:03.000Z",
          "wordCount": 985,
          "title": "AMD Quietly Launches Recycled Xbox Series X APU as 4700S Desktop Kit"
        },
        {
          "id": "https://github.com/rcmaehl/WhyNotWin11",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/rcmaehl/WhyNotWin11",
          "publishedOn": "2021-06-26T21:29:37.000Z",
          "wordCount": 696,
          "title": "Detection Script to help identify why your PC isn't Windows 11 ready"
        },
        {
          "id": "https://jobs.lever.co/rescale/399a7fc1-8318-49fa-a73d-3a1eb7a50c3b?lever-origin=applied&lever-source%5B%5D=Hacker%20News",
          "author": null,
          "description": "Comments",
          "link": "https://jobs.lever.co/rescale/399a7fc1-8318-49fa-a73d-3a1eb7a50c3b?lever-origin=applied&lever-source%5B%5D=Hacker%20News",
          "publishedOn": "2021-06-26T21:01:13.000Z",
          "wordCount": 578,
          "title": "Rescale (YC W12) Is Hiring Product Managers"
        },
        {
          "id": "https://lcamtuf.coredump.cx/gcnc/",
          "author": null,
          "description": "Comments",
          "link": "https://lcamtuf.coredump.cx/gcnc/",
          "publishedOn": "2021-06-26T20:36:28.000Z",
          "wordCount": 233,
          "title": "Guerrilla guide to CNC machining, mold making, and resin casting (2015)"
        },
        {
          "id": "https://restofworld.org/2021/palestine-social-media-silence/2",
          "author": null,
          "description": "Comments",
          "link": "https://restofworld.org/2021/palestine-social-media-silence/2",
          "publishedOn": "2021-06-26T19:59:07.000Z",
          "wordCount": 1602,
          "title": "The blackout Palestinians are facing on social media"
        },
        {
          "id": "https://austinvernon.eth.link/blog/construction.html",
          "author": null,
          "description": "Comments",
          "link": "https://austinvernon.eth.link/blog/construction.html",
          "publishedOn": "2021-06-26T18:12:11.000Z",
          "wordCount": 2564,
          "title": "So you want to build a house more efficiently"
        },
        {
          "id": "https://www.npr.org/sections/health-shots/2021/06/26/1009817539/he-inherited-a-devastating-disease-a-crispr-gene-editing-breakthrough-stopped-it",
          "author": null,
          "description": "Comments",
          "link": "https://www.npr.org/sections/health-shots/2021/06/26/1009817539/he-inherited-a-devastating-disease-a-crispr-gene-editing-breakthrough-stopped-it",
          "publishedOn": "2021-06-26T16:54:31.000Z",
          "wordCount": 1321,
          "title": "CRISPR gene-editing breakthrough opens door to treating broad array of diseases"
        },
        {
          "id": "https://github.com/karayaman/Play-online-chess-with-real-chess-board",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/karayaman/Play-online-chess-with-real-chess-board",
          "publishedOn": "2021-06-26T16:51:01.000Z",
          "wordCount": 1575,
          "title": "Play online chess with a real chess board"
        },
        {
          "id": "https://www.vox.com/recode/2021/6/26/22550981/carl-bergstrom-joe-bak-coleman-biologists-ecologists-social-media-risk-humanity-research-academics",
          "author": null,
          "description": "Comments",
          "link": "https://www.vox.com/recode/2021/6/26/22550981/carl-bergstrom-joe-bak-coleman-biologists-ecologists-social-media-risk-humanity-research-academics",
          "publishedOn": "2021-06-26T16:34:38.000Z",
          "wordCount": 3194,
          "title": "Some biologists and ecologists think social media is a risk to humanity"
        },
        {
          "id": "https://cwtch.im/",
          "author": null,
          "description": "Comments",
          "link": "https://cwtch.im/",
          "publishedOn": "2021-06-26T16:19:03.000Z",
          "wordCount": 1438,
          "title": "Cwtch: Decentralized, privacy-preserving, multi-party messaging protocol"
        },
        {
          "id": "https://brennan.io/2021/06/15/git-less-is-more/",
          "author": null,
          "description": "Comments",
          "link": "https://brennan.io/2021/06/15/git-less-is-more/",
          "publishedOn": "2021-06-26T16:09:20.000Z",
          "wordCount": 743,
          "title": "When it comes to Git history, less is more"
        },
        {
          "id": "https://github.com/trimstray/the-book-of-secret-knowledge",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/trimstray/the-book-of-secret-knowledge",
          "publishedOn": "2021-06-26T16:09:10.000Z",
          "wordCount": 22115,
          "title": "The Book of Secret Knowledge"
        },
        {
          "id": "http://cq.mtc.dev",
          "author": null,
          "description": "Comments",
          "link": "http://cq.mtc.dev",
          "publishedOn": "2021-06-26T16:01:27.000Z",
          "wordCount": 830,
          "title": "Show HN: I’m an introvert – made an app to help maintain connections with people"
        },
        {
          "id": "https://arxiv.org/abs/1802.05968",
          "author": null,
          "description": "Comments",
          "link": "https://arxiv.org/abs/1802.05968",
          "publishedOn": "2021-06-26T15:52:19.000Z",
          "wordCount": 521,
          "title": "Information Theory: A Tutorial Introduction"
        },
        {
          "id": "https://stundin.is/grein/13627/key-witness-in-assange-case-admits-to-lies-in-indictment/",
          "author": null,
          "description": "Comments",
          "link": "https://stundin.is/grein/13627/key-witness-in-assange-case-admits-to-lies-in-indictment/",
          "publishedOn": "2021-06-26T15:22:48.000Z",
          "wordCount": 4105,
          "title": "Key witness in Assange case admits to lies in indictment"
        },
        {
          "id": "https://edoconti.medium.com/offline-policy-evaluation-run-fewer-better-a-b-tests-60ce8f93fa15",
          "author": null,
          "description": "Comments",
          "link": "https://edoconti.medium.com/offline-policy-evaluation-run-fewer-better-a-b-tests-60ce8f93fa15",
          "publishedOn": "2021-06-26T14:44:31.000Z",
          "wordCount": 3188,
          "title": "Run fewer, better A/B tests"
        },
        {
          "id": "https://codewords.recurse.com/issues/six/immutability-is-not-enough",
          "author": null,
          "description": "Comments",
          "link": "https://codewords.recurse.com/issues/six/immutability-is-not-enough",
          "publishedOn": "2021-06-26T14:40:02.000Z",
          "wordCount": 2800,
          "title": "Immutability is not enough (2016)"
        },
        {
          "id": "https://ognjen.io/reddits-disrespectful-design/",
          "author": null,
          "description": "Comments",
          "link": "https://ognjen.io/reddits-disrespectful-design/",
          "publishedOn": "2021-06-26T12:43:45.000Z",
          "wordCount": 828,
          "title": "Reddit’s disrespectful design"
        },
        {
          "id": "https://github.com/abbbi/nullfsvfs",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/abbbi/nullfsvfs",
          "publishedOn": "2021-06-26T11:34:42.000Z",
          "wordCount": 1018,
          "title": "Nullfs: A virtual black hole file system that behaves like /dev/null"
        },
        {
          "id": "https://ianopolous.peergos.me/maths/surreal",
          "author": null,
          "description": "Comments",
          "link": "https://ianopolous.peergos.me/maths/surreal",
          "publishedOn": "2021-06-26T11:30:46.000Z",
          "wordCount": 1818,
          "title": "The wonderful world of Surreal numbers"
        },
        {
          "id": "https://ytakano.github.io/blisp/",
          "author": null,
          "description": "Comments",
          "link": "https://ytakano.github.io/blisp/",
          "publishedOn": "2021-06-26T11:26:44.000Z",
          "wordCount": 2009,
          "title": "BLisp: A Statically Typed Lisp Like Language"
        },
        {
          "id": "https://shkspr.mobi/blog/2021/06/whatever-happened-to-ui-affordances/",
          "author": null,
          "description": "Comments",
          "link": "https://shkspr.mobi/blog/2021/06/whatever-happened-to-ui-affordances/",
          "publishedOn": "2021-06-26T11:16:14.000Z",
          "wordCount": 2071,
          "title": "Whatever Happened to UI Affordances?"
        },
        {
          "id": "https://www.datacenterdynamics.com/en/analysis/caves-of-steel/",
          "author": null,
          "description": "Comments",
          "link": "https://www.datacenterdynamics.com/en/analysis/caves-of-steel/",
          "publishedOn": "2021-06-26T11:08:57.000Z",
          "wordCount": null,
          "title": "The slow rise of robots in the data center"
        },
        {
          "id": "https://camhashemi.com/posts/focus-vs-coordination/",
          "author": null,
          "description": "Comments",
          "link": "https://camhashemi.com/posts/focus-vs-coordination/",
          "publishedOn": "2021-06-26T09:23:05.000Z",
          "wordCount": 1920,
          "title": "Focus vs Coordination"
        },
        {
          "id": "https://github.com/0xhh/TinyE8",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/0xhh/TinyE8",
          "publishedOn": "2021-06-26T08:00:57.000Z",
          "wordCount": 1492,
          "title": "I made Ben Eater's 8-bit breadboard computer Emulator in C++"
        },
        {
          "id": "https://lexi-lambda.github.io/blog/2019/11/05/parse-don-t-validate/",
          "author": null,
          "description": "Comments",
          "link": "https://lexi-lambda.github.io/blog/2019/11/05/parse-don-t-validate/",
          "publishedOn": "2021-06-26T07:23:24.000Z",
          "wordCount": 4160,
          "title": "Parse, Don't Validate (2019)"
        },
        {
          "id": "https://arstechnica.com/science/2014/09/the-little-known-soviet-mission-to-rescue-a-dead-space-station/",
          "author": null,
          "description": "Comments",
          "link": "https://arstechnica.com/science/2014/09/the-little-known-soviet-mission-to-rescue-a-dead-space-station/",
          "publishedOn": "2021-06-26T05:49:45.000Z",
          "wordCount": 2454,
          "title": "A little-known Soviet mission to rescue a dead space station (2014)"
        },
        {
          "id": "https://placesjournal.org/article/watermark-along-the-california-aqueduct/",
          "author": null,
          "description": "Comments",
          "link": "https://placesjournal.org/article/watermark-along-the-california-aqueduct/",
          "publishedOn": "2021-06-25T23:18:42.000Z",
          "wordCount": 1875,
          "title": "Watermark: Along the California Aqueduct (2015)"
        },
        {
          "id": "https://twitter.com/RunDaltonRun/status/1408507323031592964",
          "author": null,
          "description": "Comments",
          "link": "https://twitter.com/RunDaltonRun/status/1408507323031592964",
          "publishedOn": "2021-06-25T21:58:35.000Z",
          "wordCount": 196,
          "title": "Sorry, we replaced that old technology, “see-through glass”"
        },
        {
          "id": "https://news.ycombinator.com/item?id=27636743",
          "author": null,
          "description": "Comments",
          "link": "https://news.ycombinator.com/item?id=27636743",
          "publishedOn": "2021-06-25T21:55:39.000Z",
          "wordCount": 1625,
          "title": "Ask HN: Which book or course gave you an unfair advantage?"
        },
        {
          "id": "https://news.ycombinator.com/item?id=27636593",
          "author": null,
          "description": "Comments",
          "link": "https://news.ycombinator.com/item?id=27636593",
          "publishedOn": "2021-06-25T21:38:03.000Z",
          "wordCount": 2108,
          "title": "Ask HN: What's your experience working for a YC backed startup?"
        },
        {
          "id": "https://onesignal.com/careers/b824ffc4-ac55-4744-b7d8-b5ace6272e96",
          "author": null,
          "description": "Comments",
          "link": "https://onesignal.com/careers/b824ffc4-ac55-4744-b7d8-b5ace6272e96",
          "publishedOn": "2021-06-25T21:00:39.000Z",
          "wordCount": 158,
          "title": "OneSignal (Messaging and Push Notification APIs) is hiring a full stack engineer"
        },
        {
          "id": "https://www.vice.com/en/article/qj83yp/final-fantasy-remasters-reignite-controversies-over-pixel-art",
          "author": null,
          "description": "Comments",
          "link": "https://www.vice.com/en/article/qj83yp/final-fantasy-remasters-reignite-controversies-over-pixel-art",
          "publishedOn": "2021-06-25T20:49:40.000Z",
          "wordCount": 2122,
          "title": "Final Fantasy remasters reignite controversies over pixel art"
        },
        {
          "id": "https://www.dni.gov/index.php/newsroom/reports-publications/reports-publications-2021/item/2223-preliminary-assessment-unidentified-aerial-phenomena",
          "author": null,
          "description": "Comments",
          "link": "https://www.dni.gov/index.php/newsroom/reports-publications/reports-publications-2021/item/2223-preliminary-assessment-unidentified-aerial-phenomena",
          "publishedOn": "2021-06-25T20:36:41.000Z",
          "wordCount": 400,
          "title": "Preliminary Assessment: Unidentified Aerial Phenomena"
        },
        {
          "id": "https://userinyerface.com/",
          "author": null,
          "description": "Comments",
          "link": "https://userinyerface.com/",
          "publishedOn": "2021-06-25T19:37:53.000Z",
          "wordCount": 49,
          "title": "User Inyerface – A worst-practice UI experiment"
        },
        {
          "id": "https://telegram.org/blog/group-video-calls",
          "author": null,
          "description": "Comments",
          "link": "https://telegram.org/blog/group-video-calls",
          "publishedOn": "2021-06-25T19:18:42.000Z",
          "wordCount": 661,
          "title": "Group Video Calls"
        },
        {
          "id": "https://theweek.com/feature/opinion/1001964/the-miami-condo-collapse-is-a-devastating-reminder-of-americas-landfill",
          "author": null,
          "description": "Comments",
          "link": "https://theweek.com/feature/opinion/1001964/the-miami-condo-collapse-is-a-devastating-reminder-of-americas-landfill",
          "publishedOn": "2021-06-25T19:13:02.000Z",
          "wordCount": 1595,
          "title": "The Miami condo collapse is a reminder of America's artificial land problem"
        },
        {
          "id": "https://duckdb.org/2021/06/25/querying-parquet.html",
          "author": null,
          "description": "Comments",
          "link": "https://duckdb.org/2021/06/25/querying-parquet.html",
          "publishedOn": "2021-06-25T18:53:15.000Z",
          "wordCount": 1919,
          "title": "Querying Parquet with Precision Using DuckDB"
        },
        {
          "id": "https://pubs.acs.org/doi/10.1021/acs.est.1c00976",
          "author": null,
          "description": "Comments",
          "link": "https://pubs.acs.org/doi/10.1021/acs.est.1c00976",
          "publishedOn": "2021-06-25T18:27:44.000Z",
          "wordCount": 1017,
          "title": "Deep dive into plastic monomers, additives, and processing aids"
        },
        {
          "id": "https://www.chemistryworld.com/opinion/chemical-space-is-big-really-big/7899.article",
          "author": null,
          "description": "Comments",
          "link": "https://www.chemistryworld.com/opinion/chemical-space-is-big-really-big/7899.article",
          "publishedOn": "2021-06-25T18:26:03.000Z",
          "wordCount": 1277,
          "title": "Chemical space is really big (2014)"
        },
        {
          "id": "https://github.com/MichalStrehovsky/bflat",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/MichalStrehovsky/bflat",
          "publishedOn": "2021-06-25T18:18:28.000Z",
          "wordCount": 1409,
          "title": "Bflat: C# as you know it but with Go-like tooling"
        },
        {
          "id": "https://www.thepullrequest.com/p/the-man-whose-software-ate-the-world",
          "author": null,
          "description": "Comments",
          "link": "https://www.thepullrequest.com/p/the-man-whose-software-ate-the-world",
          "publishedOn": "2021-06-25T18:08:27.000Z",
          "wordCount": 8091,
          "title": "A man whose software ate the world"
        },
        {
          "id": "https://www.info.ucl.ac.be/~pvr/VanRoyChapter.pdf",
          "author": null,
          "description": "Comments",
          "link": "https://www.info.ucl.ac.be/~pvr/VanRoyChapter.pdf",
          "publishedOn": "2021-06-25T17:28:21.000Z",
          "wordCount": 73374,
          "title": "Programming Paradigms for Dummies: What Every Programmer Should Know (2009) [pdf]"
        },
        {
          "id": "https://www.cambridge.org/core/journals/antiquity/article/problematic-stuff-death-memory-and-the-interpretation-of-cached-objects/FEFB14E4C357F336710BA78CF27048AF",
          "author": null,
          "description": "Comments",
          "link": "https://www.cambridge.org/core/journals/antiquity/article/problematic-stuff-death-memory-and-the-interpretation-of-cached-objects/FEFB14E4C357F336710BA78CF27048AF",
          "publishedOn": "2021-06-25T15:28:16.000Z",
          "wordCount": 7188,
          "title": "‘Problematic stuff’: death, memory and the interpretation of cached objects"
        },
        {
          "id": "https://dl.acm.org/doi/pdf/10.1145/3460095",
          "author": null,
          "description": "Comments",
          "link": "https://dl.acm.org/doi/pdf/10.1145/3460095",
          "publishedOn": "2021-06-25T15:24:56.000Z",
          "wordCount": 148,
          "title": "Where did my 256 GB go? Mobile storage Analysis [pdf]"
        },
        {
          "id": "https://hoverbear.org/blog/postgresql-hierarchical-structures/",
          "author": null,
          "description": "Comments",
          "link": "https://hoverbear.org/blog/postgresql-hierarchical-structures/",
          "publishedOn": "2021-06-25T15:10:58.000Z",
          "wordCount": 1130,
          "title": "Hierarchical Structures in PostgreSQL (2020)"
        },
        {
          "id": "https://aws.amazon.com/blogs/security/aws-welcomes-wickr-to-the-team/",
          "author": null,
          "description": "Comments",
          "link": "https://aws.amazon.com/blogs/security/aws-welcomes-wickr-to-the-team/",
          "publishedOn": "2021-06-25T14:38:34.000Z",
          "wordCount": 794,
          "title": "AWS acquires Wickr"
        },
        {
          "id": "https://www.dailydot.com/debug/hacker-smart-meter-texas-snowstorm/",
          "author": null,
          "description": "Comments",
          "link": "https://www.dailydot.com/debug/hacker-smart-meter-texas-snowstorm/",
          "publishedOn": "2021-06-25T13:42:38.000Z",
          "wordCount": 1922,
          "title": "Hacker reveals smart meters are spilling secrets about the Texas snowstorm"
        },
        {
          "id": "https://sirendns.com",
          "author": null,
          "description": "Comments",
          "link": "https://sirendns.com",
          "publishedOn": "2021-06-25T12:15:23.000Z",
          "wordCount": null,
          "title": "Show HN: SirenDNS – A Watchtower for Your Domains (Anti-domain-squatting)"
        },
        {
          "id": "https://blog.tinybird.co/2021/06/25/starting-with-kafka/",
          "author": null,
          "description": "Comments",
          "link": "https://blog.tinybird.co/2021/06/25/starting-with-kafka/",
          "publishedOn": "2021-06-25T11:49:19.000Z",
          "wordCount": 923,
          "title": "Starting with Kafka"
        },
        {
          "id": "https://www.peachesnstink.com/p/6pJoCuczOj8cxCUQDMlfQv",
          "author": null,
          "description": "Comments",
          "link": "https://www.peachesnstink.com/p/6pJoCuczOj8cxCUQDMlfQv",
          "publishedOn": "2021-06-25T11:47:33.000Z",
          "wordCount": 324,
          "title": "I was let go for refusing to deploy a dark pattern"
        },
        {
          "id": "https://allthings.how/how-to-install-windows-11-on-legacy-bios-without-secure-boot-or-tpm-2-0/",
          "author": null,
          "description": "Comments",
          "link": "https://allthings.how/how-to-install-windows-11-on-legacy-bios-without-secure-boot-or-tpm-2-0/",
          "publishedOn": "2021-06-25T11:22:47.000Z",
          "wordCount": 1029,
          "title": "Installing Windows 11 on Legacy BIOS Without Secure Boot"
        },
        {
          "id": "https://www.fortressofdoors.com/the-future-of-games-is-an-instant-flash-to-the-past/",
          "author": null,
          "description": "Comments",
          "link": "https://www.fortressofdoors.com/the-future-of-games-is-an-instant-flash-to-the-past/",
          "publishedOn": "2021-06-25T11:21:11.000Z",
          "wordCount": 8190,
          "title": "The Future of Games is an Instant Flash to the past"
        },
        {
          "id": "https://blog.mozilla.org/en/mozilla/take-control-over-your-data-with-rally-a-novel-privacy-first-data-sharing-platform/",
          "author": null,
          "description": "Comments",
          "link": "https://blog.mozilla.org/en/mozilla/take-control-over-your-data-with-rally-a-novel-privacy-first-data-sharing-platform/",
          "publishedOn": "2021-06-25T10:59:39.000Z",
          "wordCount": 1571,
          "title": "Rally, a novel privacy-first data sharing platform"
        },
        {
          "id": "https://www.nytimes.com/2021/06/25/science/puzzles-fonts-math-demaine.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.nytimes.com/2021/06/25/science/puzzles-fonts-math-demaine.html",
          "publishedOn": "2021-06-25T10:58:52.000Z",
          "wordCount": 2193,
          "title": "Mathematically inspired typefaces"
        },
        {
          "id": "https://blind.guru/blog/2021-06-25-brick.html",
          "author": null,
          "description": "Comments",
          "link": "https://blind.guru/blog/2021-06-25-brick.html",
          "publishedOn": "2021-06-25T10:39:28.000Z",
          "wordCount": 737,
          "title": "Why the text terminal cursor is important for accessibility"
        },
        {
          "id": "https://www.theguardian.com/society/2021/jun/25/blood-test-that-finds-50-types-of-cancer-is-accurate-enough-to-be-rolled-out",
          "author": null,
          "description": "Comments",
          "link": "https://www.theguardian.com/society/2021/jun/25/blood-test-that-finds-50-types-of-cancer-is-accurate-enough-to-be-rolled-out",
          "publishedOn": "2021-06-25T09:35:52.000Z",
          "wordCount": 875,
          "title": "Blood test that finds 50 types of cancer is accurate enough to be rolled out"
        },
        {
          "id": "https://www.wired.com/story/atm-hack-nfc-bugs-point-of-sale/",
          "author": null,
          "description": "Comments",
          "link": "https://www.wired.com/story/atm-hack-nfc-bugs-point-of-sale/",
          "publishedOn": "2021-06-25T07:13:05.000Z",
          "wordCount": 1711,
          "title": "ATM NFC Hack"
        },
        {
          "id": "https://acoup.blog/2021/06/25/collections-the-queens-latin-or-who-were-the-romans-part-ii-citizens-and-allies/",
          "author": null,
          "description": "Comments",
          "link": "https://acoup.blog/2021/06/25/collections-the-queens-latin-or-who-were-the-romans-part-ii-citizens-and-allies/",
          "publishedOn": "2021-06-25T05:18:04.000Z",
          "wordCount": 17051,
          "title": "The Queen’s Latin or Who Were the Romans, Part II: Citizens and Allies"
        },
        {
          "id": "https://v2.onivim.io",
          "author": null,
          "description": "Comments",
          "link": "https://v2.onivim.io",
          "publishedOn": "2021-06-25T04:56:26.000Z",
          "wordCount": 365,
          "title": "Onivim 2 is a retro-futuristic modal editor"
        },
        {
          "id": "http://www.theweatherprediction.com/habyhints2/424/",
          "author": null,
          "description": "Comments",
          "link": "http://www.theweatherprediction.com/habyhints2/424/",
          "publishedOn": "2021-06-24T19:38:46.000Z",
          "wordCount": 822,
          "title": "Weather Forecasting Tricks Series: Timing a Front (2004)"
        },
        {
          "id": "https://izbicki.me/blog/teaching-open-source-in-north-korea.html",
          "author": null,
          "description": "Comments",
          "link": "https://izbicki.me/blog/teaching-open-source-in-north-korea.html",
          "publishedOn": "2021-06-24T16:47:47.000Z",
          "wordCount": 1546,
          "title": "Teaching open-source software in North Korea"
        },
        {
          "id": "https://lareviewofbooks.org/article/cats-and-the-good-life/",
          "author": null,
          "description": "Comments",
          "link": "https://lareviewofbooks.org/article/cats-and-the-good-life/",
          "publishedOn": "2021-06-24T16:16:49.000Z",
          "wordCount": 1601,
          "title": "Cats and the Good Life"
        },
        {
          "id": "https://www.nytimes.com/2021/06/24/science/ancient-coronavirus-epidemic.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.nytimes.com/2021/06/24/science/ancient-coronavirus-epidemic.html",
          "publishedOn": "2021-06-24T15:18:50.000Z",
          "wordCount": 1012,
          "title": "A coronavirus epidemic hit 20k years ago, new study finds"
        },
        {
          "id": "https://www.bbc.com/news/world-us-canada-57592243",
          "author": null,
          "description": "Comments",
          "link": "https://www.bbc.com/news/world-us-canada-57592243",
          "publishedOn": "2021-06-24T14:09:09.000Z",
          "wordCount": 830,
          "title": "Canada: Hundreds of unmarked graves found at residential school"
        },
        {
          "id": "https://cloud.google.com/bigquery/docs/row-level-security-intro",
          "author": null,
          "description": "Comments",
          "link": "https://cloud.google.com/bigquery/docs/row-level-security-intro",
          "publishedOn": "2021-06-24T13:56:42.000Z",
          "wordCount": 6177,
          "title": "Row level security available in BigQuery"
        },
        {
          "id": "https://www.npr.org/2021/06/23/1009567351/hubble-trouble-nasa-cant-figure-out-whats-causing-computer-issues-on-the-telesco",
          "author": null,
          "description": "Comments",
          "link": "https://www.npr.org/2021/06/23/1009567351/hubble-trouble-nasa-cant-figure-out-whats-causing-computer-issues-on-the-telesco",
          "publishedOn": "2021-06-24T13:43:36.000Z",
          "wordCount": 912,
          "title": "NASA Can't Figure Out What's Causing Computer Issues on the Hubble Telescope"
        },
        {
          "id": "https://www.juststeveking.uk/introducing-laravel-transporter/",
          "author": null,
          "description": "Comments",
          "link": "https://www.juststeveking.uk/introducing-laravel-transporter/",
          "publishedOn": "2021-06-24T13:39:18.000Z",
          "wordCount": 899,
          "title": "Laravel Transporter"
        },
        {
          "id": "https://a16z.com/2021/06/24/crypto-fund-iii/",
          "author": null,
          "description": "Comments",
          "link": "https://a16z.com/2021/06/24/crypto-fund-iii/",
          "publishedOn": "2021-06-24T13:34:32.000Z",
          "wordCount": 1493,
          "title": "A16Z Crypto Fund III"
        },
        {
          "id": "https://dpreview.com/news/4668719994/faa-releases-trust-free-online-training-required-for-recreational-pilots-to-fly-legally",
          "author": null,
          "description": "Comments",
          "link": "https://dpreview.com/news/4668719994/faa-releases-trust-free-online-training-required-for-recreational-pilots-to-fly-legally",
          "publishedOn": "2021-06-24T13:33:22.000Z",
          "wordCount": 3428,
          "title": "Effective immediately: You need a drone license before you fly in the US"
        },
        {
          "id": "https://www.theguardian.com/education/2021/jun/24/half-of-uk-university-students-think-degree-is-poor-value-for-money",
          "author": null,
          "description": "Comments",
          "link": "https://www.theguardian.com/education/2021/jun/24/half-of-uk-university-students-think-degree-is-poor-value-for-money",
          "publishedOn": "2021-06-24T13:26:13.000Z",
          "wordCount": 648,
          "title": "Half of UK university students think degree is poor value for money"
        },
        {
          "id": "https://www.poynter.org/ethics-trust/2021/us-ranks-last-among-46-countries-in-trust-in-media-reuters-institute-report-finds/",
          "author": null,
          "description": "Comments",
          "link": "https://www.poynter.org/ethics-trust/2021/us-ranks-last-among-46-countries-in-trust-in-media-reuters-institute-report-finds/",
          "publishedOn": "2021-06-24T13:21:50.000Z",
          "wordCount": 1894,
          "title": "US ranks last among 46 countries in trust in media"
        },
        {
          "id": "https://www.nytimes.com/2021/06/24/science/hills-creep-lasers.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.nytimes.com/2021/06/24/science/hills-creep-lasers.html",
          "publishedOn": "2021-06-24T13:21:02.000Z",
          "wordCount": 841,
          "title": "The Hills Are Alive with the Flows of Physics"
        },
        {
          "id": "https://restofworld.org/2021/the-chinese-content-farms-behind-factory-tiktok/",
          "author": null,
          "description": "Comments",
          "link": "https://restofworld.org/2021/the-chinese-content-farms-behind-factory-tiktok/",
          "publishedOn": "2021-06-24T13:19:59.000Z",
          "wordCount": 1980,
          "title": "The Chinese content farms behind Factory TikTok"
        },
        {
          "id": "https://www.nytimes.com/2021/06/24/us/police-resignations-protests-asheville.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.nytimes.com/2021/06/24/us/police-resignations-protests-asheville.html",
          "publishedOn": "2021-06-24T13:07:20.000Z",
          "wordCount": 2088,
          "title": "Police Have Been Quitting in Droves in the Last Year"
        },
        {
          "id": "https://www.nytimes.com/2021/06/24/business/energy-environment/britain-climate-goals.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.nytimes.com/2021/06/24/business/energy-environment/britain-climate-goals.html",
          "publishedOn": "2021-06-24T12:04:38.000Z",
          "wordCount": 957,
          "title": "Climate watchdog says Britain lacks a strategy to meet its goals"
        },
        {
          "id": "https://www.workatastartup.com/jobs/43782",
          "author": null,
          "description": "Comments",
          "link": "https://www.workatastartup.com/jobs/43782",
          "publishedOn": "2021-06-24T12:00:19.000Z",
          "wordCount": 407,
          "title": "Literably (IK12 W13) Is Hiring a Senior Software Engineer (Remote)"
        },
        {
          "id": "https://www.nytimes.com/2021/06/23/upshot/remote-work-innovation-office.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.nytimes.com/2021/06/23/upshot/remote-work-innovation-office.html",
          "publishedOn": "2021-06-24T11:43:28.000Z",
          "wordCount": 1602,
          "title": "No evidence that chance meetings in office boosts innovation"
        },
        {
          "id": "https://developer.apple.com/documentation/xcode/writing-arm64-code-for-apple-platforms",
          "author": null,
          "description": "Comments",
          "link": "https://developer.apple.com/documentation/xcode/writing-arm64-code-for-apple-platforms",
          "publishedOn": "2021-06-24T11:07:47.000Z",
          "wordCount": 135,
          "title": "Writing ARM64 Code for Apple Platforms"
        },
        {
          "id": "https://www.hindustantimes.com/india-news/messaging-application-signal-not-in-compliance-with-new-rules-say-officials-101624508925464.html",
          "author": null,
          "description": "Comments",
          "link": "https://www.hindustantimes.com/india-news/messaging-application-signal-not-in-compliance-with-new-rules-say-officials-101624508925464.html",
          "publishedOn": "2021-06-24T10:57:13.000Z",
          "wordCount": 846,
          "title": "Messaging app Signal not in compliance with new rules, say officials in India"
        },
        {
          "id": "https://interestingengineering.com/toxoplasmosis-the-cat-poop-parasite-probably-in-your-brain",
          "author": null,
          "description": "Comments",
          "link": "https://interestingengineering.com/toxoplasmosis-the-cat-poop-parasite-probably-in-your-brain",
          "publishedOn": "2021-06-24T10:34:53.000Z",
          "wordCount": 1789,
          "title": "Toxoplasmosis: The Cat Poop Parasite That's Probably in Your Brain"
        },
        {
          "id": "https://www.technologyreview.com/2021/06/24/1027048/youtube-xinjiang-censorship-human-rights-atajurt/",
          "author": null,
          "description": "Comments",
          "link": "https://www.technologyreview.com/2021/06/24/1027048/youtube-xinjiang-censorship-human-rights-atajurt/",
          "publishedOn": "2021-06-24T10:34:08.000Z",
          "wordCount": 1828,
          "title": "How YouTube’s rules are used to silence human rights activists"
        },
        {
          "id": "https://www.theverge.com/2021/6/23/22547397/medical-records-health-data-hospitals-research",
          "author": null,
          "description": "Comments",
          "link": "https://www.theverge.com/2021/6/23/22547397/medical-records-health-data-hospitals-research",
          "publishedOn": "2021-06-24T10:04:53.000Z",
          "wordCount": 1814,
          "title": "Hospitals are selling treasure troves of medical data – what could go wrong?"
        },
        {
          "id": "https://www.cuimc.columbia.edu/news/its-true-stress-does-turn-hair-gray-and-its-reversible",
          "author": null,
          "description": "Comments",
          "link": "https://www.cuimc.columbia.edu/news/its-true-stress-does-turn-hair-gray-and-its-reversible",
          "publishedOn": "2021-06-24T10:01:20.000Z",
          "wordCount": 1465,
          "title": "Stress Does Turn Hair Gray, and It’s Reversible"
        },
        {
          "id": "http://bashrcgenerator.com/",
          "author": null,
          "description": "Comments",
          "link": "http://bashrcgenerator.com/",
          "publishedOn": "2021-06-24T09:34:38.000Z",
          "wordCount": 242,
          "title": "Bash PS1 Generator"
        },
        {
          "id": "https://www.rijksmuseum.nl/en/stories/operation-night-watch/story/night-watch-the-missing-pieces",
          "author": null,
          "description": "Comments",
          "link": "https://www.rijksmuseum.nl/en/stories/operation-night-watch/story/night-watch-the-missing-pieces",
          "publishedOn": "2021-06-24T09:33:46.000Z",
          "wordCount": 158,
          "title": "Recreating the Missing Pieces of the Night Watch with the Help of AI"
        },
        {
          "id": "http://strlen.com/treesheets/",
          "author": null,
          "description": "Comments",
          "link": "http://strlen.com/treesheets/",
          "publishedOn": "2021-06-24T07:40:50.000Z",
          "wordCount": 288,
          "title": "Treesheets: cross-platform, free-form data organizer app"
        },
        {
          "id": "https://3dasd.com/",
          "author": null,
          "description": "Comments",
          "link": "https://3dasd.com/",
          "publishedOn": "2021-06-24T07:34:43.000Z",
          "wordCount": 357,
          "title": "Show HN: 3dasd – open-source DIY room-scale 3D scanner"
        },
        {
          "id": "https://android-developers.googleblog.com/2021/06/continuing-to-boost-developer-success.html",
          "author": null,
          "description": "Comments",
          "link": "https://android-developers.googleblog.com/2021/06/continuing-to-boost-developer-success.html",
          "publishedOn": "2021-06-24T07:30:50.000Z",
          "wordCount": 1147,
          "title": "Google will consider lowering Play Store cut to 15% for certain apps"
        },
        {
          "id": "https://www.cam.ac.uk/research/news/vegan-spider-silk-provides-sustainable-alternative-to-single-use-plastics",
          "author": null,
          "description": "Comments",
          "link": "https://www.cam.ac.uk/research/news/vegan-spider-silk-provides-sustainable-alternative-to-single-use-plastics",
          "publishedOn": "2021-06-24T06:34:11.000Z",
          "wordCount": 1713,
          "title": "‘Vegan spider silk’ provides sustainable alternative to single-use plastics"
        },
        {
          "id": "https://www.freecivweb.org/?2021",
          "author": null,
          "description": "Comments",
          "link": "https://www.freecivweb.org/?2021",
          "publishedOn": "2021-06-24T05:59:54.000Z",
          "wordCount": 629,
          "title": "Show HN: Freeciv-Web"
        },
        {
          "id": "http://eecs.ucf.edu/~dcm/Teaching/COT4810-Spring2011/Literature/JustInTimeCompilation.pdf",
          "author": null,
          "description": "Comments",
          "link": "http://eecs.ucf.edu/~dcm/Teaching/COT4810-Spring2011/Literature/JustInTimeCompilation.pdf",
          "publishedOn": "2021-06-24T05:59:11.000Z",
          "wordCount": 6450,
          "title": "A Brief History of Just-in-Time (2003) [pdf]"
        },
        {
          "id": "http://tylerneylon.com/a/lsh1/",
          "author": null,
          "description": "Comments",
          "link": "http://tylerneylon.com/a/lsh1/",
          "publishedOn": "2021-06-24T05:51:51.000Z",
          "wordCount": 4667,
          "title": "Introduction to Locality-Sensitive Hashing"
        },
        {
          "id": "https://newsblur.com/",
          "author": null,
          "description": "Comments",
          "link": "https://newsblur.com/",
          "publishedOn": "2021-06-24T02:35:29.000Z",
          "wordCount": 675,
          "title": "Hacker deleted all of NewsBlur’s Mongo data and is now holding the data hostage"
        },
        {
          "id": "https://www.laphamsquarterly.org/roundtable/ascendant-steppe",
          "author": null,
          "description": "Comments",
          "link": "https://www.laphamsquarterly.org/roundtable/ascendant-steppe",
          "publishedOn": "2021-06-23T21:01:34.000Z",
          "wordCount": 2272,
          "title": "The Ascendant Steppe: A brisk tour of the early history of Central Asia"
        },
        {
          "id": "https://unherd.com/2021/06/are-twitter-trolls-mentally-ill/",
          "author": null,
          "description": "Comments",
          "link": "https://unherd.com/2021/06/are-twitter-trolls-mentally-ill/",
          "publishedOn": "2021-06-23T17:24:01.000Z",
          "wordCount": 2871,
          "title": "Disproportionate amount of bad online behaviour stems from psychological issues"
        },
        {
          "id": "https://stitcher.io/blog/opinion-driven-design",
          "author": null,
          "description": "Comments",
          "link": "https://stitcher.io/blog/opinion-driven-design",
          "publishedOn": "2021-06-23T15:57:51.000Z",
          "wordCount": 662,
          "title": "Opinion-Driven Design"
        },
        {
          "id": "https://github.com/nidhaloff/igel/tree/v0.4.0",
          "author": null,
          "description": "Comments",
          "link": "https://github.com/nidhaloff/igel/tree/v0.4.0",
          "publishedOn": "2021-06-23T11:27:52.000Z",
          "wordCount": 6337,
          "title": "Show HN: Machine learning automation from creating to using models in production"
        },
        {
          "id": "http://web.archive.org/web/20160304093204/http://www.atmind.nl/blender/mystery_ot_blend.html",
          "author": null,
          "description": "Comments",
          "link": "http://web.archive.org/web/20160304093204/http://www.atmind.nl/blender/mystery_ot_blend.html",
          "publishedOn": "2021-06-23T08:00:53.000Z",
          "wordCount": 2679,
          "title": "The Mystery of the Blend (2009)"
        },
        {
          "id": "https://hynek.me/articles/python-subclassing-redux/",
          "author": null,
          "description": "Comments",
          "link": "https://hynek.me/articles/python-subclassing-redux/",
          "publishedOn": "2021-06-22T17:45:08.000Z",
          "wordCount": 5440,
          "title": "Subclassing in Python: Redux"
        },
        {
          "id": "https://retrohax.net/acorn-archimedes-a3020-refurb-and-mods/",
          "author": null,
          "description": "Comments",
          "link": "https://retrohax.net/acorn-archimedes-a3020-refurb-and-mods/",
          "publishedOn": "2021-06-22T06:52:05.000Z",
          "wordCount": 1601,
          "title": "Acorn Archimedes A3020 – Refurb and Mods"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}